{"image_id": 220050, "caption": "In the image, a young girl is standing on a tennis court, holding a tennis racket in her hand. She appears to be posing for a picture, showcasing her enthusiasm for the sport. The girl is wearing a white dress, which complements her outfit.\n\nThe tennis court is surrounded by a fence, and there are a few chairs placed around the area, likely for spectators or players to rest during breaks. The scene captures the girl's passion for tennis and her readiness to engage in the sport."}
{"image_id": 535050, "caption": "The image features a room with a large suitcase and a cardboard box placed next to each other. The suitcase is positioned towards the right side of the room, while the box is on the left side, occupying a significant portion of the space.\n\nIn addition to the suitcase and the box, there is a smaller suitcase located near the center of the room. The room appears to be a storage area or a place where luggage is temporarily stored."}
{"image_id": 438364, "caption": "The image depicts a red double-decker bus driving down a street. The bus is quite large, occupying a significant portion of the scene. There are two people visible on the street, one closer to the bus and the other further away.\n\nIn addition to the bus, there is a car parked on the side of the street, and a truck can be seen further down the road. The street appears to be a busy urban area with various vehicles and pedestrians."}
{"image_id": 173819, "caption": "The image depicts a pink Hello Kitty bathroom featuring a toilet and a sink. The toilet is situated on the left side of the bathroom, while the sink is located towards the right side. Above the toilet, there is a Hello Kitty towel hanging, adding a playful touch to the room.\n\nIn addition to the toilet and sink, there are several bottles placed around the bathroom. One bottle is located near the left side of the toilet, while two others are positioned closer to the right side of the sink. The bathroom appears to be well-maintained and ready for use."}
{"image_id": 196295, "caption": "The image depicts a herd of elephants walking down a dirt road in a wooded area. There are a total of eight elephants in the scene, with some of them being adults and others being young. The elephants are spread out along the road, creating a sense of depth in the scene.\n\nIn addition to the elephants, there are also two birds visible in the image. One bird is located near the left side of the scene, while the other is closer to the right side. The combination of the elephants, birds, and the dirt road creates a lively and natural atmosphere."}
{"image_id": 527704, "caption": "The image depicts a woman wearing a blue outfit, rollerblading down a sidewalk next to a parked RV. She appears to be enjoying her time outdoors, possibly skating for exercise or leisure.\n\nIn the background, there is a car parked on the left side of the scene, and another car can be seen further back on the right side. The woman's outfit and the presence of the RV suggest that she might be at a campsite or a recreational area."}
{"image_id": 517454, "caption": "The image features a bed with two cats lying on it. One cat is positioned towards the left side of the bed, while the other cat is on the right side. Both cats appear to be sleeping or resting comfortably on the bed.\n\nIn addition to the cats, there are several pairs of shoes scattered around the bed. Some shoes are placed near the top left corner of the bed, while others are located near the top right corner. A handbag can also be seen on the left side of the bed, adding to the cluttered appearance of the scene."}
{"image_id": 474528, "caption": "The image features a group of stuffed teddy bears arranged on a table. There are five teddy bears in total, with one large teddy bear in the center and four smaller teddy bears surrounding it. The large teddy bear is wearing a pink dress, while the smaller bears are dressed in various outfits.\n\nIn addition to the teddy bears, there are two chairs in the scene. One chair is positioned on the left side of the table, and the other chair is on the right side. A potted plant is also present in the background, adding a touch of greenery to the scene."}
{"image_id": 475271, "caption": "The image features a woman wearing a blue shirt, sitting on the floor and using a laptop. She appears to be smiling and enjoying her time on the computer. The laptop is positioned in front of her, occupying a significant portion of the lower part of the image. The woman's posture suggests that she is comfortable and engaged in her activity."}
{"image_id": 496081, "caption": "The image features two horses standing next to each other near a stone fence. Both horses are wearing blankets, with one horse wearing a purple blanket and the other horse wearing a black blanket. The horses appear to be looking over the fence, possibly curious about their surroundings or seeking attention from passersby.\n\nIn the background, there is a truck parked near the fence, possibly belonging to the owner of the horses or someone visiting the area. The scene conveys a sense of tranquility and connection between the horses and their environment."}
{"image_id": 41923, "caption": "The image features a dining table with a delicious meal laid out on a white plate. The meal consists of a sandwich and a generous portion of french fries. The plate is placed in the center of the table.\n\nIn addition to the main meal, there are several bowls and cups scattered around the table. Two bowls can be seen on the left side of the table, one near the top and the other near the bottom. Two cups are also present on the table, one near the top left corner and the other near the top right corner. A bottle is located on the right side of the table, close to the top.\n\nThe dining table is surrounded by chairs, with one on the left side and another on the right side of the table."}
{"image_id": 40681, "caption": "The image captures a group of people skiing down a snow-covered slope. There are at least 12 people visible in the scene, with some skiers closer to the foreground and others further down the slope. The skiers are spread out across the slope, with some skiing in pairs and others skiing individually.\n\nThe skiers are equipping themselves with skis, which can be seen attached to their feet. There are at least 11 pairs of skis visible in the scene, with some skis being closer to the foreground and others further down the slope. The skiers appear to be enjoying their time on the slopes, taking advantage of the snowy conditions for winter sports."}
{"image_id": 393547, "caption": "The image features an orange and white cat sitting on top of a glass surface, possibly a table or a mirror. The cat appears to be looking at its own image in the glass, creating a captivating scene. The cat seems to be intrested in the reflection, as if it is observing itself."}
{"image_id": 1803, "caption": "The image depicts a small, clean bathroom with a blue tiled floor. The bathroom features two sinks, one on the left side and another on the right side of the room. Above the sinks, there are two shelves, providing storage space for toiletries and other bathroom essentials.\n\nIn addition to the sinks and shelves, there are two toilets in the bathroom. One is located near the left side of the room, and the other is situated closer to the right side. The bathroom appears to be well-maintained and ready for use."}
{"image_id": 417055, "caption": "The image features a close-up view of the famous Big Ben clock tower in London, England. The clock tower is adorned with two large clocks, one on the left side and the other on the right side. The clocks are positioned at the top of the tower, making them easily visible from a distance.\n\nIn addition to the clocks, the tower is also decorated with gold trim, enhancing its grandeur and elegance. The combination of the clocks, gold trim, and the iconic architecture of Big Ben creates an impressive and memorable scene."}
{"image_id": 498374, "caption": "The image depicts a bathroom with a white toilet positioned under a mirror. The mirror reflects a person taking a picture of the bathroom. The bathroom is equipped with a sink and a toilet paper holder.\n\nThe bathroom appears to be clean and well-maintained. The presence of the mirror and the person taking a picture suggests that the bathroom is being documented or photographed for some purpose, such as a real estate listing, a renovation project, or a design inspiration."}
{"image_id": 577866, "caption": "The image is a black and white photo of an old bus parked on the side of a road. The bus is positioned near a fence and appears to be in a residential area with several houses in the background.\n\nThere are a couple of people in the scene, with one person standing close to the bus and another person further away on the right side of the image. The presence of these individuals suggests that they might be passengers or passersby in the area."}
{"image_id": 254491, "caption": "The image features a sandy beach with two bicycles parked next to each other, facing the ocean. The bicycles are positioned in such a way that they seem to be enjoying the view of the water. The beach appears to be relatively empty, with no people visible in the scene. The two bicycles are the main focus of the image, capturing the essence of a leisurely day at the beach."}
{"image_id": 360735, "caption": "In the image, a person is riding a red motorcycle down a street. The motorcycle is positioned in the middle of the scene, and the rider is wearing a helmet for safety. There is a blue car parked on the side of the street, and another car can be seen further down the road.\n\nAdditionally, there is a person standing near the blue car, possibly observing the motorcycle rider or waiting to cross the street. A handbag is also visible in the scene, placed near the person standing by the car."}
{"image_id": 151338, "caption": "The image captures a young man skillfully riding a skateboard up the side of a cement wall. He is performing a trick, possibly grinding along the edge of the wall. The skateboarder is wearing a black shirt and appears to be enjoying the thrill of the stunt.\n\nIn the background, there is a person standing near a fence, possibly watching the skateboarder or waiting for their turn to perform their own tricks. The scene is set at night, with the skateboarder and the person in the background being the main subjects of the image."}
{"image_id": 183332, "caption": "In the image, a woman is using a laptop computer, which is placed on a desk. She appears to be focused on the screen, possibly working or browsing the internet. Another person can be seen standing behind her, observing the laptop screen.\n\nThere are several books scattered around the scene, with some placed on the desk and others on the floor. Additionally, there is a clock hanging on the wall, indicating the time. The overall setting suggests a workspace or study area where the woman and the person behind her are engaged in various tasks or discussions."}
{"image_id": 248148, "caption": "The image features a red and white train parked at a train station. The train has a distinctive maroon and white color scheme, making it stand out. The train is positioned on the tracks, occupying a significant portion of the scene.\n\nIn addition to the train, there are two people visible in the image. One person is standing near the left side of the train, while the other person is located closer to the right side. The presence of these individuals suggests that they might be waiting for the train or simply passing by the station."}
{"image_id": 329341, "caption": "The image depicts a small, empty kitchen with white walls and wooden cabinets. The kitchen is equipped with a stainless steel sink, a refrigerator, an oven, and a microwave. There is also a toaster placed on the countertop.\n\nA few items can be seen in the kitchen, such as a bottle and a bowl, which are placed on the countertop near the sink. The kitchen appears to be in the process of being set up or rearranged, as evidenced by the presence of a pile of items on the floor near the refrigerator."}
{"image_id": 373341, "caption": "The image depicts a busy city street filled with various vehicles, including cars, trucks, and motorcycles. A FedEx truck is driving down the street, surrounded by other cars and a motorcycle. The street is lined with parked cars on both sides, creating a bustling urban atmosphere.\n\nIn addition to the vehicles, there are several pedestrians walking along the sidewalks, contributing to the overall liveliness of the scene. The street is also adorned with a few potted plants, adding a touch of greenery to the urban environment.\n\nOverall, the image captures the essence of a busy city street with a mix of vehicles and pedestrians, showcasing the hustle and bustle of urban life."}
{"image_id": 441840, "caption": "The image depicts a young boy in a blue shirt swinging a baseball bat on a field, attempting to hit a ball. He is wearing a baseball glove, ready to catch the ball if it comes his way. Another person can be seen in the background, possibly watching the boy or waiting for their turn to play.\n\nThe field is surrounded by various vehicles, including cars and trucks parked in the background. Some cars are parked closer to the foreground, while others are further away, indicating that this might be a popular spot for people to gather and enjoy outdoor activities."}
{"image_id": 562875, "caption": "The image depicts a cluttered bathroom with a large mirror on the wall. The mirror is adorned with various items such as a cat figurine, a star, and a bottle of shampoo. The bathroom is equipped with a TV mounted on the wall above the mirror.\n\nOn the counter, there are multiple bottles of shampoo and other toiletries scattered around, adding to the messy appearance of the bathroom. A book can also be seen resting on the counter, further contributing to the clutter."}
{"image_id": 522021, "caption": "The image features a group of three zebras standing close together in a grassy area. They are positioned in a line, with one zebra on the left, another in the middle, and the third on the right. The zebras appear to be looking in the same direction, possibly focusing on something in the distance.\n\nThe zebras are surrounded by a lush green environment, with trees visible in the background. The scene captures the beauty and camaraderie of these majestic animals as they stand together in their natural habitat."}
{"image_id": 226571, "caption": "In the image, a man and a woman are riding horses on the beach, enjoying a leisurely ride along the shoreline. The woman is riding a brown horse, while the man is riding a brown and white horse. Both riders are wearing cowboy hats, adding to the western vibe of the scene.\n\nIn the background, there is a boat visible on the water, adding to the coastal atmosphere. The couple appears to be enjoying their time together, taking in the beautiful beach scenery."}
{"image_id": 270097, "caption": "In the image, a man is sitting in front of a laptop computer, working or browsing the internet. The laptop is placed on a table, and the man is seated in front of a mirror. The room appears to be dimly lit, creating a cozy atmosphere.\n\nThe man is wearing a sweater, and there are a few books scattered around the room. One book is located on the left side of the room, another on the right side, and the third book is placed closer to the laptop. Additionally, there is a cell phone on the table, slightly to the left of the laptop."}
{"image_id": 99177, "caption": "In the image, a man and a woman are sitting on the grass, enjoying each other's company under a white umbrella. They are positioned close to each other, with the woman on the left and the man on the right. The woman is wearing a black shirt and jeans, while the man is wearing a white shirt and jeans.\n\nThere is a handbag placed between them, and a cell phone can be seen on the ground near the woman. The scene appears to be a relaxed and intimate moment shared by the couple."}
{"image_id": 434159, "caption": "The image is a black and white photo of a castle-like building with a moat and a drawbridge. The castle is surrounded by a stone wall, and there is a bus parked in front of it. The bus occupies a significant portion of the scene, stretching from the left side to the right side of the image.\n\nThere are several people near the castle, with some standing closer to the bus and others scattered around the area. A traffic light can be seen on the right side of the image, indicating that the castle is located near a road or intersection. Overall, the scene captures a unique blend of historical architecture and modern transportation."}
{"image_id": 422640, "caption": "The image features a baseball game in progress, with a pitcher and a catcher on the field. The pitcher, wearing a maroon shirt, is in the process of throwing the ball towards the catcher. The catcher is positioned behind the pitcher, ready to catch the ball.\n\nIn addition to the pitcher and catcher, there are three other people visible in the scene, likely teammates or opponents. One of them is located near the left side of the image, while the other two are on the right side. A baseball glove can also be seen in the scene, likely belonging to one of the players."}
{"image_id": 530630, "caption": "The image features a dining table with a white plate containing a sandwich and a bowl of soup. The sandwich is placed on the left side of the plate, while the bowl of soup occupies the majority of the right side. The soup appears to be a hearty, flavorful stew.\n\nIn addition to the main dish, there are a few utensils on the table, including a knife and a spoon. A cup can also be seen on the left side of the table, possibly containing a beverage to accompany the meal."}
{"image_id": 523529, "caption": "The image features a close-up of a large brown bear with its head tilted to the side, possibly sniffing the ground. The bear appears to be in a rocky area, possibly near a water source. The bear''s fur is wet, indicating that it might have been in the water recently. The scene captures the bear's natural behavior and environment."}
{"image_id": 426686, "caption": "The image depicts a herd of cows grazing in a lush green field. There are at least 13 cows in the scene, scattered throughout the field. Some of the cows are closer to the foreground, while others are further in the background. The cows appear to be enjoying their time grazing on the grass, creating a serene and peaceful scene."}
{"image_id": 191360, "caption": "The image features a colorful surfboard leaning against a wall. This surfboard is adorned with a floral pattern and is positioned next to a building. There are several other surfboards visible in the scene, some of which are also adorned with floral patterns. \n\nIn addition to the surfboards, there are a few people present in the scene. One person is located near the left side of the image, while two others can be seen on the right side of the image. A handbag is also visible in the scene, placed close to the person on the right side."}
{"image_id": 102421, "caption": "The image features a black and white cat lying on a couch, resting its head on a piece of black luggage. The cat is positioned near the center of the scene, with the luggage on its left side. The couch appears to be a comfortable spot for the cat, as it lounges and enjoys the cozy environment."}
{"image_id": 545796, "caption": "The image features a young child, possibly a toddler, brushing their teeth with a red toothbrush. The child is focused on the task at hand, and the toothbrush can be seen in their mouth. The scene takes place in a room with a couch visible in the background. The child appears to be enjoying the process of maintaining their oral hygiene."}
{"image_id": 476722, "caption": "The image captures a group of snowboarders enjoying their time on a snow-covered slope. There are six snowboarders in total, each riding their snowboards down the hill. The snowboarders are spread out across the slope, with some closer to the foreground and others further in the background.\n\nIn addition to the snowboarders, there are two backpacks visible in the scene, likely belonging to the snowboarders. One backpack is located near the middle of the slope, while the other is situated closer to the right side. The snowboarders appear to be having a great time, showcasing their skills and enjoying the thrill of snowboarding down the mountain."}
{"image_id": 139971, "caption": "The image depicts a men's public restroom with a row of urinals lined up against a brick wall. There are five urinals in total, with one on the left side, two in the middle, and two on the right side of the wall. The restroom is clean and well-maintained.\n\nIn addition to the urinals, there are two sinks in the restroom. One sink is located on the left side of the restroom, and the other sink is situated on the right side. A toilet is also present in the restroom, positioned towards the right side of the room."}
{"image_id": 264201, "caption": "The image depicts a snowy scene with a yellow fire hydrant and two green trash cans. The fire hydrant is located on the left side of the scene, while the two trash cans are positioned closer to the right side. The trash cans appear to be covered in snow, indicating that it has been snowing recently. The snow-covered ground and the presence of the fire hydrant and trash cans create a wintery atmosphere in the scene."}
{"image_id": 486501, "caption": "The image features a large orange tabby cat comfortably laying on the edge of a white bathroom sink. The cat appears relaxed and content as it lounges on the sink's edge.\n\nIn the background, there is a toothbrush placed near the sink, possibly belonging to the cat's owner. Additionally, there is a bottle located close to the sink, possibly containing soap or other bathroom essentials."}
{"image_id": 58089, "caption": "The image features a parking meter with a sticker on it that reads \"Zone 3.\" The parking meter is located on the side of a street, and there is a car parked nearby. The parking meter is positioned close to the curb, making it easily accessible for drivers to use."}
{"image_id": 79686, "caption": "The image depicts a cozy living room with a brick wall and a white table in the center. On the table, there is a plate filled with shells and a bowl. The room also features a bookshelf filled with various books, creating a warm and inviting atmosphere.\n\nIn addition to the table and bookshelf, there are three chairs placed around the room. One chair is positioned near the left side of the table, another chair is on the right side of the table, and the third chair is located near the back of the room. The combination of the brick wall, the white table, and the bookshelf creates a visually appealing and comfortable living space."}
{"image_id": 241187, "caption": "In the image, a person is sitting at a dining table with a laptop computer in front of them. The laptop is open, and the person appears to be typing on the keyboard. The table is surrounded by chairs, with one on the left side and another on the right side.\n\nIn the background, there is a television mounted on the wall, providing entertainment or information for the person working on the laptop. The scene seems to be a cozy and comfortable workspace."}
{"image_id": 378334, "caption": "The image is a vintage black and white photograph featuring two young men dressed in suits and ties. They are both wearing hats, with one of them wearing a fedora. The men are sitting next to each other, posing for the picture.\n\nIn the background, there is a chair visible on the right side of the image. The photograph captures a moment of camaraderie between the two well-dressed gentlemen."}
{"image_id": 348379, "caption": "The image depicts a group of people gathered on a staircase, protesting against foreclosures. There are at least nine people visible in the scene, with some standing closer to the foreground and others further in the background.\n\nTwo of the individuals in the group are holding signs, one of which reads \"Stop Foreclosures\" and the other reads \"Stand Together.\" The protesters appear to be united in their cause, advocating for the rights of homeowners and raising awareness about the issue of foreclosures."}
{"image_id": 104669, "caption": "The image features a dining table with a white plate filled with a delicious meal. On the plate, there is a generous portion of meat, likely steak, accompanied by a variety of vegetables such as broccoli, carrots, and potatoes. The plate is placed on a table with a colorful tablecloth, adding a vibrant touch to the setting.\n\nIn the background, there is a person partially visible, likely enjoying the meal or preparing to eat. The combination of meat, vegetables, and a visually appealing table setting creates an inviting atmosphere for a delightful dining experience."}
{"image_id": 422212, "caption": "The image features a wall with three pictures hanging on it. Two of the pictures are framed and showcase tennis rackets, while the third picture is a black and white photo of a tennis player. The tennis rackets are positioned close to each other, with one on the left side and the other on the right side of the wall. The black and white photo of the tennis player is located in the middle of the wall, creating a visually appealing arrangement."}
{"image_id": 324818, "caption": "The image features two colorful parrots perched on a wooden post or branch, surrounded by a lush green forest. The parrots have vibrant blue and yellow plumage, making them stand out against the backdrop of the forest.\n\nIn addition to the two parrots, there are several potted plants scattered throughout the scene, adding to the natural ambiance. Some of the plants are located close to the parrots, while others are positioned further away. The combination of the parrots, plants, and forest creates a serene and picturesque scene."}
{"image_id": 251250, "caption": "The image depicts a group of three people, including two adults and a child, paddling on blue surfboards in a large body of water. They are navigating through the water, likely enjoying a leisurely day out on the water.\n\nIn the background, there are several boats of various sizes, including a large boat on the left side and a smaller boat on the right side of the scene. The presence of multiple boats and the group of people on surfboards create a lively and active atmosphere in the water."}
{"image_id": 396526, "caption": "The image is a split-screen view of a dining room and a living room. The dining room features a dining table with chairs placed around it. There are four chairs in total, two on each side of the table. A vase is placed on the table, adding a touch of elegance to the setting.\n\nIn the living room, there is a couch and a chair, creating a cozy seating area. A potted plant can be seen in the room, adding a touch of greenery to the space. The living room also has a TV mounted on the wall, providing entertainment for the occupants."}
{"image_id": 159944, "caption": "The image features a white and orange cat lying on a desk, resting its head on a computer mouse. The cat is positioned near the center of the scene, occupying a significant portion of the desk.\n\nIn addition to the cat and the computer mouse, there are a few other items on the desk. A keyboard is located towards the left side of the desk, while a TV can be seen in the background on the left side. There are also two books placed on the desk, one near the left edge and the other closer to the center. A pair of scissors can be spotted on the right side of the desk."}
{"image_id": 86625, "caption": "The image features a man standing in front of an open refrigerator. He appears to be making a funny face as he looks at the contents of the refrigerator. The refrigerator is stocked with multiple bottles, some of which are placed on the door shelves.\n\nIn addition to the refrigerator, there is a microwave visible in the scene, located above the refrigerator. The man's facial expression and the assortment of items in the refrigerator create a light-hearted and humorous atmosphere."}
{"image_id": 56874, "caption": "The image features a group of three people dressed in costumes, standing around a dining table. Two of the individuals are wearing blue and red costumes, while the third person is dressed as a chef. The chef appears to be wearing a white shirt and a hat.\n\nThe dining table is adorned with a donut and a cup, adding to the festive atmosphere. The group seems to be enjoying their time together, possibly at a party or a themed event."}
{"image_id": 490381, "caption": "The image features a group of people walking down a sidewalk in front of a large advertisement of a young boy holding a skateboard. Among the group, there is a man wearing a black suit and a black hat, walking next to a woman in a pink shirt. The woman is carrying a handbag.\n\nThere are a total of five people in the scene, including the man in the black suit and the woman in the pink shirt. The skateboard is prominently displayed in the advertisement, capturing the attention of the pedestrians passing by."}
{"image_id": 407915, "caption": "The image depicts a well-lit bathroom featuring a white sink with a mirror above it. The bathroom is decorated in a pink and purple color scheme, creating a warm and inviting atmosphere. Above the sink, there are two framed pictures hanging on the wall, adding a personal touch to the space.\n\nIn addition to the sink and mirror, the bathroom is equipped with a toothbrush holder, a cup, and a bottle. There are also two toothbrushes placed in the holder, indicating that the bathroom is actively used. The combination of the pink and purple color scheme, the framed pictures, and the well-organized toiletries make this bathroom a cozy and functional space."}
{"image_id": 80273, "caption": "In the image, a man wearing a green jacket is standing on a snowboard on a snow-covered slope. He appears to be enjoying his time on the snowboard, possibly preparing to ride down the hill. The man is positioned in the center of the scene, with the snowboard beneath his feet.\n\nThe snow-covered slope stretches across the background of the image, creating a picturesque winter scene. The man's green jacket stands out against the white snow, adding a pop of color to the otherwise monochromatic landscape."}
{"image_id": 12370, "caption": "The image features a man sitting on a motorcycle, wearing a helmet and a yellow jacket. The motorcycle is parked on the grass, and the man appears to be taking a break from riding.\n\nIn the background, there are several cars and a truck parked in a parking lot. Some of the cars are positioned closer to the foreground, while others are further back. The truck is located towards the right side of the parking lot. The scene captures a moment of leisure and relaxation for the man on the motorcycle."}
{"image_id": 175205, "caption": "The image features a dining table with two red lunch boxes placed on it. Each lunch box is filled with a variety of healthy foods, including grapes, carrots, and other fruits and vegetables. The grapes are spread across both lunch boxes, with some in the center and others closer to the edges. The carrots can be seen in different sections of the boxes, with some placed near the top and others closer to the bottom.\n\nIn addition to the fruits and vegetables, the lunch boxes also contain cheese and crackers, making for a well-rounded and nutritious meal. Overall, the lunch boxes present a colorful and appetizing assortment of food items."}
{"image_id": 367424, "caption": "The image features a dining table with a spoon and a bowl placed on it. The spoon is positioned on the left side of the table, while the bowl is located on the right side. The table appears to be set for a meal, with the spoon and bowl being the main focus of the scene."}
{"image_id": 120519, "caption": "The image features a cozy bed with a stuffed teddy bear sitting on top of a pink and white comforter. The teddy bear is positioned near the center of the bed, and it appears to be the main focus of the scene.\n\nIn addition to the teddy bear, there are two pillows on the bed. One is located on the left side of the bed, and the other is on the right side. The combination of the teddy bear, pillows, and the pink and white comforter creates a warm and inviting atmosphere in the bedroom."}
{"image_id": 16599, "caption": "The image features a large, ornate clock tower standing prominently in the middle of a city street. The clock tower is adorned with various decorative elements, including a statue of a man and a bird. The clock face is positioned towards the top of the tower, making it easily visible to passersby.\n\nThe street is lined with buildings on both sides, creating a bustling urban atmosphere. The clock tower serves as a focal point in the scene, drawing attention to its impressive design and historical significance."}
{"image_id": 512760, "caption": "The image depicts a small bathroom with a white toilet situated next to a sink. Above the toilet, there are three posters hanging on the wall, adding a decorative touch to the space. The toilet is positioned under a mirror, which is mounted on the wall above the sink.\n\nIn addition to the toilet and sink, there is a towel rack in the bathroom, providing a convenient place to hang towels. A bottle can also be seen on the sink, possibly containing soap or other toiletries. The bathroom appears to be well-maintained and organized."}
{"image_id": 442609, "caption": "The image depicts a small, cluttered kitchen with a white stove top oven as the focal point. The stove is covered in various cooking utensils and ingredients, creating a busy and disorganized appearance. There are multiple spoons, bowls, and cups scattered around the stove and countertops.\n\nIn addition to the stove, the kitchen features a sink on the left side and a refrigerator on the right side. A bottle can be seen placed near the refrigerator, and a knife is resting on the countertop. The overall scene conveys a sense of a bustling, lived-in kitchen where cooking and meal preparation take place."}
{"image_id": 545735, "caption": "The image features a woman standing in front of a large, ornate cathedral. She is holding a yellow umbrella above her head, possibly to shield herself from the sun or rain. The woman appears to be smiling and enjoying her time in front of the historic building.\n\nThe cathedral's architecture is quite impressive, with multiple windows and intricate details on the facade. The woman is positioned towards the right side of the image, with the cathedral taking up the majority of the background."}
{"image_id": 344548, "caption": "The image features a man sitting at a dining table with a green birthday cake in front of him. The cake has lit candles on it, indicating that it is a birthday celebration. The man appears to be looking at the cake with a surprised expression.\n\nThe dining table is surrounded by chairs, with one chair on the left side of the table and another on the right side. There is also a cup placed on the table, possibly containing a beverage for the man to enjoy during the celebration."}
{"image_id": 409646, "caption": "The image depicts a black bear walking across a grassy field near a road. The bear is positioned in the middle of the scene, with its back facing the viewer. The field is lush and green, providing a natural habitat for the bear.\n\nIn addition to the bear, there are a few other elements in the scene. A car can be seen parked on the side of the road, and a person is visible in the background, likely observing the bear from a safe distance."}
{"image_id": 480173, "caption": "The image captures a female tennis player in action on a tennis court, swinging her racket to hit the ball. She is wearing a blue shirt and black shorts, and her tennis racket is positioned above her head as she prepares to make contact with the ball. The tennis ball can be seen in the air, close to the player.\n\nThe scene is set on a blue tennis court, which provides a vibrant backdrop for the action taking place. The player's focus and determination are evident as she skillfully plays the game."}
{"image_id": 387244, "caption": "The image features a manhole cover with a yellow fire hydrant connected to it. The fire hydrant is spewing water, creating a puddle around the manhole cover. The water appears to be coming from the hydrant, possibly due to maintenance or a malfunction. The scene captures the interaction between the manhole cover and the fire hydrant, showcasing the city's infrastructure."}
{"image_id": 501855, "caption": "The image depicts a commercial kitchen with a stainless steel stove top oven and a refrigerator. The oven is located on the left side of the kitchen, while the refrigerator is situated on the right side. The kitchen appears to be clean and well-maintained.\n\nIn addition to the main appliances, there are a few bottles scattered around the kitchen. One bottle is located near the left side of the refrigerator, another is on the right side of the refrigerator, and the third bottle is on the left side of the oven. The presence of these bottles suggests that the kitchen is actively used for food preparation and cooking."}
{"image_id": 388409, "caption": "The image features a lone black horse standing in a snow-covered field. The horse is positioned towards the center of the scene, surrounded by a vast expanse of snow-covered ground. In the distance, there are a few buildings, likely farmhouses or barns, adding to the rural atmosphere. The horse appears to be calmly grazing in the snow, creating a serene and picturesque winter scene."}
{"image_id": 485149, "caption": "The image features an orange tabby cat sitting on a desk in front of a laptop computer. The cat appears to be staring at the laptop screen, which is displaying a picture of a man. The laptop is placed on a table, and there is a beer bottle nearby, possibly for the cat's owner to enjoy while working or browsing the internet."}
{"image_id": 570773, "caption": "The image captures a snowboarder standing on a snow-covered slope, likely taking a break or preparing to continue their descent down the mountain. The snowboarder is positioned towards the center of the scene, with their snowboard visible beneath them.\n\nIn the background, a beautiful mountain range can be seen, providing a stunning backdrop for the snowboarder's adventure. The snow-covered slope extends across the entire image, creating a sense of vastness and tranquility in the winter landscape."}
{"image_id": 342186, "caption": "The image features a close-up view of a freshly baked pizza with a generous amount of cheese and greens on top. The pizza is placed on a white plate, which occupies the majority of the image. The greens on the pizza are predominantly broccoli, with several pieces scattered across the surface. The pizza appears to be a spinach and cheese pizza, making it a delicious and nutritious meal option."}
{"image_id": 293751, "caption": "The image features a herd of elephants walking through a grassy field with tall, dry grass. There are eleven elephants in total, spread out across the field. Some elephants are closer to the foreground, while others are further in the background, creating a sense of depth in the scene. The elephants appear to be enjoying their time in the open field, possibly grazing or exploring their surroundings."}
{"image_id": 371058, "caption": "The image features a young man standing on a skateboard with a plate of food in his hand. He is wearing a brown shirt and green shorts, and he appears to be enjoying his meal while riding the skateboard.\n\nThere are several other people in the scene, with one person standing to the left of the young man on the skateboard and another person standing to the right. A backpack can be seen placed on the ground near the center of the scene.\n\nIn addition to the main skateboard, there are two other skateboards visible in the image, one on the right side and another on the far right."}
{"image_id": 580766, "caption": "The image features a blue glass vase filled with water, holding a single yellow flower. The vase is placed on a table, and the flower appears to be a sunflower. The vase is positioned in the center of the scene, drawing attention to the beauty of the yellow flower. The combination of the blue vase and the vibrant yellow flower creates a visually appealing and harmonious display."}
{"image_id": 131556, "caption": "The image captures a snowboarder skillfully performing a trick on a rail. The snowboarder is wearing a blue jacket and appears to be in mid-air while executing the maneuver. Another person can be seen in the background, possibly watching the snowboarder or waiting for their turn to perform their own tricks.\n\nThe scene takes place on a snow-covered slope, with the snowboarder's snowboard prominently visible in the foreground. The overall atmosphere of the image is energetic and exciting, showcasing the snowboarder's talent and the thrilling nature of the sport."}
{"image_id": 32570, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is positioned in the center of the scene, with his surfboard gliding through the water. The man appears to be enjoying the thrill of surfing and maintaining his balance on the surfboard.\n\nThe wave he is riding is quite large, providing an exciting and challenging experience for the surfer. The scene showcases the surfer's talent and the power of the ocean's waves."}
{"image_id": 419371, "caption": "The image features a zebra standing in a fenced enclosure, surrounded by trees and bushes. The zebra appears to be grazing on the ground, with its head down. The enclosure is a mix of dirt and grass, providing a natural environment for the zebra.\n\nThe zebra is positioned in the middle of the enclosure, with its body facing the camera. The fence surrounding the enclosure is visible, ensuring the zebra's safety and containment. The scene captures a moment of the zebra enjoying its time in the enclosure, surrounded by the lush greenery of the trees and bushes."}
{"image_id": 224554, "caption": "The image depicts a train traveling down the tracks, surrounded by a lush green landscape. The train appears to be an old-fashioned passenger train, with a red and yellow color scheme. It is moving along the tracks, passing through a wooded area with trees on both sides.\n\nThere are several people visible in the scene, likely enjoying the beautiful surroundings or waiting for the train to pass. Some of them are closer to the train, while others are further away, scattered across the scene. Overall, the image captures a serene and picturesque moment as the train makes its way through the countryside."}
{"image_id": 275270, "caption": "The image features a bathroom sink with a white porcelain basin. Above the sink, there is a mirror that reflects the bathroom's interior. The bathroom is well-stocked with a variety of toiletries, including several toothbrushes placed around the sink area.\n\nIn addition to the toothbrushes, there are multiple bottles and cups scattered throughout the bathroom. Some bottles are placed near the sink, while others are located further away. A cup can be seen on the right side of the sink, and a vase is also present in the scene, adding a decorative touch to the bathroom.\n\nOverall, the bathroom appears to be well-organized and equipped with all the necessary toiletries for daily use."}
{"image_id": 342765, "caption": "In the image, a man and a woman are standing in a kitchen, looking into an open refrigerator. The woman is on the left side of the refrigerator, while the man is on the right side. They appear to be searching for something or deciding what to eat.\n\nThe refrigerator is filled with a variety of items, including several bottles placed on different shelves. Some bottles are located near the top, middle, and bottom sections of the refrigerator, while others are scattered throughout the shelves. Additionally, there is a cup placed on one of the shelves."}
{"image_id": 448779, "caption": "The image depicts a group of horses galloping through a grassy field on a sunny day. There are a total of nine horses in the scene, with some positioned closer to the foreground and others further in the background. The horses are spread out across the field, creating a dynamic and lively atmosphere.\n\nThe field appears to be a mix of grass and dirt, with the horses' hooves kicking up dust as they run. The horses are in various stages of motion, some closer to the camera and others further away, showcasing the energy and excitement of the scene."}
{"image_id": 453757, "caption": "The image features a group of men playing soccer on a field. One man is in the process of kicking a soccer ball, while the other players are actively engaged with the game. The soccer ball can be seen in the air, close to the center of the field.\n\nThere are a total of five players visible in the scene, with one player wearing an orange shirt and another wearing a blue shirt. The players are spread out across the field, with some closer to the foreground and others further in the background. The scene captures the intensity and excitement of a soccer match."}
{"image_id": 232489, "caption": "The image features a delicious slice of pizza sitting on a paper plate. The pizza has a generous amount of toppings, including cheese, mushrooms, and tomatoes. The slice is placed on a dining table, ready to be enjoyed.\n\nIn the background, there are two cups, one on the left side and the other on the right side of the table. Additionally, there are two bowls, one near the top left corner and the other near the top right corner of the table. A knife can also be seen on the table, likely used for cutting the pizza."}
{"image_id": 26204, "caption": "The image depicts a busy city street filled with various vehicles, including cars, buses, and trucks. A red car is prominently featured in the scene, driving down the street alongside other cars. A bus is also visible, traveling in the same direction as the red car.\n\nThere are multiple traffic lights in the scene, ensuring the smooth flow of traffic. One traffic light is located near the left edge of the image, another is in the middle, and the third is on the right side.\n\nIn addition to the vehicles and traffic lights, there are a few pedestrians walking along the sidewalk, contributing to the bustling atmosphere of the city street."}
{"image_id": 431023, "caption": "In the image, a woman is walking down a city sidewalk while talking on her cell phone. She is wearing a black leather jacket and appears to be engaged in a conversation. There are several other people in the scene, including a man wearing a red hat who is also walking down the sidewalk.\n\nAdditionally, there is a handbag visible in the scene, possibly belonging to one of the pedestrians. The overall atmosphere of the image suggests a bustling urban environment with people going about their daily activities."}
{"image_id": 138979, "caption": "The image depicts a busy city street with a white bus driving down the road, surrounded by various vehicles. There is a red car parked on the side of the street, and another car can be seen further down the road. In addition to the bus, there is a truck parked on the side of the street.\n\nSeveral people are present in the scene, with one person standing close to the red car, another person near the bus, and a third person further down the street. A handbag is visible near the person standing by the red car.\n\nOverall, the scene captures the hustle and bustle of urban life, with people and vehicles navigating the city streets."}
{"image_id": 538204, "caption": "The image features a dining table with three glass vases placed on it. Each vase contains a different type of fruit, creating a visually appealing display. The first vase on the left is filled with apples, the second vase in the middle has oranges, and the third vase on the right is filled with bananas. The arrangement of the vases on the table adds a touch of color and freshness to the setting."}
{"image_id": 562381, "caption": "The image depicts a man and a woman playing a game of tennis on a grass court. The man is holding a tennis racket, preparing to hit a tennis ball that is in the air. The woman is also holding a tennis racket, ready to return the ball.\n\nThere are several tennis balls scattered around the court, indicating an ongoing practice session. A bench can be seen on the side of the court, providing a place for players to rest during breaks. The scene captures the essence of a friendly tennis match between the two players."}
{"image_id": 559440, "caption": "The image depicts a small bathroom with a white toilet and a sink. The toilet is situated on the right side of the bathroom, while the sink is positioned on the left side. A shower with a glass door can be seen in the middle of the bathroom.\n\nThere are a few toiletries scattered around the bathroom, including a cup, a bottle, and a pair of scissors. The cup is placed on the left side of the sink, while the bottle is located near the center of the bathroom. The scissors are positioned on the right side of the bathroom, close to the toilet. Additionally, there is a towel on the floor near the toilet, and a toilet brush can be seen on the left side of the bathroom."}
{"image_id": 87230, "caption": "The image features a neatly made bed with a blue and white striped comforter. The bed is situated in a bedroom with a wooden headboard and footboard. Two lamps are placed on either side of the bed, providing ample lighting for the room. The lamps are turned on, creating a warm and inviting atmosphere in the bedroom."}
{"image_id": 194310, "caption": "In the image, a woman is sitting on a chair, holding a tennis racket in her hand. The chair she is sitting on is positioned next to a dining table, which has a cup placed on it. The woman appears to be posing with the tennis racket, showcasing her interest in the sport."}
{"image_id": 46633, "caption": "The image features a brown straw hat sitting on top of a blue surface, possibly a table or a counter. The hat appears to be made of burlap or a similar material, giving it a rustic appearance. The hat is positioned in the center of the scene, drawing attention to its unique texture and design."}
{"image_id": 495894, "caption": "The image features a large wooden clock mounted on the side of a building. The clock is prominently displayed, taking up a significant portion of the wall space. It is positioned towards the left side of the building.\n\nIn addition to the clock, there is a banner on the right side of the building, possibly advertising a business or event. The scene also includes a car parked in front of the building, occupying a significant portion of the lower part of the image. The presence of the car and the banner suggests that the building might be a commercial or public space."}
{"image_id": 118065, "caption": "The image features a store display with a variety of fruits and nuts. There is a large pile of bananas prominently displayed, occupying a significant portion of the scene. In addition to the bananas, there are several oranges and apples scattered throughout the display, adding to the colorful assortment of fruits.\n\nA scale is placed next to the fruit display, likely for customers to weigh their purchases. The store also offers a sale on bananas, with a price of $1.49 per pound. Overall, the display showcases a diverse selection of fresh produce for customers to choose from."}
{"image_id": 116096, "caption": "The image captures a lively scene at a beach, where a large group of people, including both adults and children, are gathered around a surfboard rental booth. There are numerous surfboards of various sizes and colors, some of which are lined up on the sand, while others are placed closer to the water's edge.\n\nIn addition to the surfboards, there are a few backpacks and handbags scattered around the area, likely belonging to the beachgoers who are renting or preparing to use the surfboards. The atmosphere appears to be fun and energetic, with everyone enjoying their time at the beach."}
{"image_id": 98497, "caption": "The image features a man standing on top of a surfboard, positioned in front of a building with a gold dome. The man appears to be enjoying his time on the surfboard, possibly preparing to ride the waves.\n\nIn the background, there are two palm trees, one on the left side and another on the right side of the scene. The presence of the palm trees and the building with a gold dome create a picturesque and tropical atmosphere."}
{"image_id": 19324, "caption": "The image depicts a group of police officers riding horses down a street in front of the U.S. Capitol building. There are two prominent police officers on horseback, leading the way, while other officers follow behind them.\n\nIn addition to the officers on horseback, there are several other people visible in the scene. Some of them are standing on the sidewalk or walking along the street, possibly observing the event or going about their daily activities.\n\nA motorcycle can also be seen parked on the side of the street, adding to the bustling atmosphere of the scene."}
{"image_id": 89027, "caption": "The image depicts a lively scene of a group of young boys playing soccer on a grassy field. There are at least nine children actively participating in the game, with some of them running and others kicking the soccer ball. The soccer ball is located in the center of the field, surrounded by the children.\n\nIn the background, there are a few chairs and dining tables scattered around the area, possibly indicating that the field is near a dining or recreational area. Some of the children are wearing t-shirts, adding to the casual atmosphere of the game. Overall, the scene is filled with energy and excitement as the children enjoy their time playing soccer together."}
{"image_id": 525058, "caption": "The image features a city street with a tall building in the background. The building is adorned with a blue sign that reads \"Sone.\" There are two traffic lights visible in the scene, one closer to the left side and the other near the right side of the image.\n\nIn addition to the tall building, there are two smaller buildings on the right side of the image. A car is parked on the left side of the street, and a person can be seen standing near the center of the scene. The overall atmosphere of the image suggests a bustling urban environment."}
{"image_id": 561009, "caption": "The image features a brown and black bird perched on a tree branch. The bird is sitting prominetly in the center of the scene, surrounded by the tree's branches. The tree appears to be filled with leaves, providing a natural and lush environment for the bird."}
{"image_id": 480000, "caption": "The image features a dining table with four plates of food, including slices of watermelon, salad, and oranges. The plates are neatly arranged on the table, showcasing a variety of fresh fruits and vegetables.\n\nIn addition to the plates, there are several cups placed around the table, possibly containing beverages to accompany the meal. A bowl can also be seen on the table, adding to the assortment of dishes.\n\nThe dining table is surrounded by chairs, inviting guests to sit and enjoy the delicious spread. The scene appears to be set in a restaurant or a well-prepared home dining area."}
{"image_id": 501665, "caption": "The image depicts a group of people gathered around a dining table, enjoying a wine tasting event. There are at least 11 people in the scene, with some standing closer to the table while others are positioned further away.\n\nOn the table, there are several wine glasses, with at least 11 wine glasses visible in various positions. A bottle of wine can also be seen on the table, adding to the ambiance of the wine tasting.\n\nIn addition to the wine glasses and bottle, there are a few other items on the table, such as a cell phone, a handbag, and a cup. The atmosphere appears to be lively and social, with people engaging in conversation and enjoying the wine tasting experience."}
{"image_id": 62220, "caption": "The image depicts a lush green field where two large, horned animals are grazing. One animal is positioned towards the left side of the field, while the other is on the right side. Both animals appear to be bulls or oxen, with their horns visible as they graze on the grass.\n\nThe field is surrounded by a forest, creating a serene and picturesque scene. The animals seem to be enjoying their time grazing in the open field, surrounded by the natural beauty of the forest."}
{"image_id": 503667, "caption": "The image features a red and white double-decker bus parked at a bus stop. The bus is quite large, occupying a significant portion of the scene. There are quite a few people around the bus, with some standing closer to the bus stop and others further away.\n\nIn addition to the bus and people, there are two umbrellas visible in the scene. One umbrella is located near the left side of the bus, while the other is positioned closer to the right side. The presence of these umbrellas suggests that it might be raining or that the people are prepared for potential rain."}
{"image_id": 573605, "caption": "The image features a dining table with two wine glasses placed on it. One of the glasses is filled with champagne, while the other is empty. The champagne glass is positioned towards the left side of the table, while the empty glass is on the right side.\n\nIn addition to the wine glasses, there are two chairs visible in the scene. One chair is located on the left side of the table, and the other chair is on the right side. A person can also be seen in the background, partially visible on the right side of the image."}
{"image_id": 537721, "caption": "The image features a book titled \"Connected to God: SMS-GEBETE\" placed on a table. The book is prominently displayed, taking up a significant portion of the table. In addition to the book, there are two cell phones present in the scene. One of the cell phones is located on the left side of the table, while the other is positioned on the right side. The presence of the cell phones suggests that the book might be related to mobile technology or communication."}
{"image_id": 115370, "caption": "The image depicts two police officers riding motorcycles down a street, likely participating in a parade or event. The officers are wearing red coats, and one of them is also wearing a helmet. The motorcycles are positioned close to each other, with one slightly ahead of the other.\n\nThere are several other individuals in the scene, some of them standing or walking along the street. A few chairs can be seen placed along the sidewalk, possibly for spectators to sit and enjoy the event. Additionally, a traffic light is visible in the background, indicating the presence of an intersection nearby."}
{"image_id": 437370, "caption": "The image features a large black propeller airplane parked on a grassy field. The airplane is surrounded by two smaller yellow airplanes, one on the left side and another on the right side. The black airplane appears to be the main focus of the scene.\n\nIn addition to the airplanes, there are two people visible in the image. One person is standing near the left side of the black airplane, while the other person is positioned closer to the right side. The presence of these individuals suggests that they might be pilots or aviation enthusiasts admiring the planes."}
{"image_id": 53490, "caption": "In the image, a man is skillfully riding a wave on a surfboard, showcasing his surfing abilities. He is wearing a black wetsuit and appears to be enjoying the thrill of the sport. The surfboard is positioned in the center of the scene, with the man skillfully balancing on it as he navigates the wave. The scene captures the excitement and challenge of surfing in the ocean."}
{"image_id": 182895, "caption": "The image depicts a row of parking meters lined up along a sidewalk. There are a total of 12 parking meters in the scene, with some closer to the foreground and others further in the background. The parking meters are situated next to a row of palm trees, creating a visually appealing scene.\n\nIn addition to the parking meters and palm trees, there are a few cars parked along the street. Two cars can be seen in the middle of the scene, while another car is parked further back on the right side of the image. The combination of the parking meters, palm trees, and parked cars creates a typical urban environment."}
{"image_id": 292804, "caption": "The image depicts a bustling train station with a large clock hanging from the ceiling. A woman wearing a black coat is walking through the station, pulling a suitcase behind her. She appears to be the main focus of the scene.\n\nThere are several other people in the station, some of them carrying handbags and backpacks. In total, there are at least 13 people visible in the scene, some of them closer to the foreground and others further in the background.\n\nAdditionally, there are two clocks visible in the station, one on the left side and another on the right side. The presence of these clocks suggests that the station is well-equipped with timekeeping devices for the convenience of its passengers."}
{"image_id": 167501, "caption": "The image features a brown and white dog playing in a body of water, such as a lake or a pond. The dog is jumping into the water with enthusiasm, creating a splash as it enters the water. The scene captures the dog's joyful and energetic moment."}
{"image_id": 544009, "caption": "The image features a toilet bowl filled with water, where a dead mouse is floating. The mouse is positioned in the middle of the toilet bowl, surrounded by water. The scene captures the unfortunate fate of the mouse as it drowns in the toilet."}
{"image_id": 150685, "caption": "The image features a wooden dining table with a wooden bowl filled with four green apples placed on it. The apples are arranged in a visually appealing manner, with one on the left, one in the middle, and two on the right side of the bowl. \n\nIn the background, there is a white stove with two burners visible. The stove is positioned on the left side of the table, creating a cozy and inviting atmosphere for cooking and dining. The combination of the wooden table, bowl of apples, and the stove creates a warm and welcoming scene."}
{"image_id": 391375, "caption": "In the image, a woman is sitting on a bench in front of a brick wall. She is wearing a black jacket and has a ponytail. The bench she is sitting on is positioned close to the wall, creating a sense of depth in the scene. The woman appears to be looking at the camera, capturing the viewer's attention."}
{"image_id": 418288, "caption": "The image features a green motorcycle parked in a room with a checkered floor. The motorcycle has a bow wrapped around the handlebars, adding a festive touch to the scene. The motorcycle is positioned in the middle of the room, drawing attention to its unique decoration."}
{"image_id": 106046, "caption": "In the image, a young girl is sitting at a dining table with a plate of cake in front of her. She is wearing a brown sweater and appears to be enjoying her dessert. There are two cakes on the table, one closer to the girl and the other further away.\n\nThe dining table is surrounded by chairs, with one on the left side and another on the right side. A handbag can be seen placed on the left side of the table, possibly belonging to the girl or someone else in the scene."}
{"image_id": 207179, "caption": "The image showcases a group of motorcycles parked in a garage. There are three motorcycles prominently displayed, with one being an orange and white dirt bike, another being a red and white dirt bike, and the third one being an orange and black dirt bike. The motorcycles are parked next to each other, with the orange and white dirt bike being the most prominent in the scene.\n\nIn addition to the main group of motorcycles, there are two more motorcycles visible in the background, one on the left side and the other on the far right side of the image. A car can also be seen in the background, parked behind the motorcycles."}
{"image_id": 173832, "caption": "The image features a brown and white cat lying on a black couch. The cat is positioned near a computer mouse, which is placed close to its paw. The couch appears to be a comfortable spot for the cat to relax and enjoy its time."}
{"image_id": 347664, "caption": "The image features a herd of cattle walking across a sandy beach near a body of water. There are at least 14 cows visible in the scene, with some closer to the water's edge and others further inland. The cows seem to be enjoying their time on the beach, creating a picturesque scene. The combination of the cows, the sandy beach, and the water creates a serene and peaceful atmosphere."}
{"image_id": 82363, "caption": "The image depicts a small bathroom with a toilet and a bathtub. The toilet is situated on the left side of the bathroom, while the bathtub occupies the majority of the space on the right side. A shower curtain is hanging in front of the bathtub, providing privacy and separation from the rest of the bathroom.\n\nIn addition to the toilet and bathtub, the bathroom also features a sink, which is located on the left side of the toilet. There are two bottles placed near the sink, one closer to the left edge and the other near the center of the bathroom. A towel can be seen hanging on the right side of the bathtub, close to the shower curtain."}
{"image_id": 540760, "caption": "In the image, there are two zebras standing in a grassy field. One zebra is positioned towards the left side of the field, while the other zebra is on the right side. Both zebras appear to be looking at the camera, capturing the viewer's attention. The grassy field provides a natural background for these beautiful animals."}
{"image_id": 28714, "caption": "The image features a white bicycle parked on the sidewalk in front of a building. The bicycle is leaning against a pole, which is located near a doorway. The building has a colorful mural painted on it, adding a vibrant touch to the scene.\n\nIn addition to the bicycle and the mural, there are several bottles scattered around the area, possibly indicating a nearby store or cafe. The presence of these bottles, along with the bicycle and the mural, creates a lively urban atmosphere."}
{"image_id": 476873, "caption": "The image features a red stop sign with the word \"Arret\" written on it, which is the French word for \"stop.\" The stop sign is positioned in front of a house, and there is a four-way stop sign below it. The scene also includes a parking sign, a no parking sign, and a no left turn sign.\n\nIn the background, there is a person standing near the left side of the image, possibly observing the street signs or waiting to cross the street. Additionally, a car can be seen parked on the right side of the image."}
{"image_id": 458613, "caption": "The image depicts a busy city street with a green and white bus driving down the road. There are several cars on the street as well, with one car positioned in front of the bus, another car behind the bus, and two more cars on the right side of the street.\n\nIn addition to the vehicles, there are a few pedestrians visible in the scene. One person can be seen near the left edge of the image, while another person is located closer to the center. A traffic light is also present on the right side of the street, controlling the flow of traffic.\n\nOverall, the scene captures the hustle and bustle of a typical city street with various modes of transportation and pedestrians."}
{"image_id": 300221, "caption": "The image showcases a vibrant display of fresh vegetables, including a variety of carrots, cauliflower, and broccoli. The carrots are spread across the scene, with some in the foreground and others in the background. The cauliflower and broccoli are also prominently featured in the display, with multiple pieces of each vegetable visible.\n\nThe vegetables are arranged in a visually appealing manner, likely for sale at a market or grocery store. The display is well-organized and inviting, making it an attractive sight for shoppers looking for healthy and fresh produce."}
{"image_id": 149398, "caption": "The image features a large clock mounted on the side of a building, possibly a church steeple. The clock has Roman numerals on its face, making it easy to read the time. In addition to the clock, there is a weather vane on top of the building, indicating the direction of the wind.\n\nThere are several bells hanging around the clock, adding to the overall aesthetic of the structure. These bells are positioned at different heights and angles, creating an interesting visual effect. The combination of the clock, weather vane, and bells make the building a unique and eye-catching landmark."}
{"image_id": 558927, "caption": "The image depicts a beautiful scene of two giraffes standing together in a grassy field. One giraffe is significantly taller than the other, possibly an adult and a younger giraffe. The taller giraffe is positioned towards the left side of the image, while the smaller giraffe is on the right side.\n\nThe field is surrounded by trees, providing a natural habitat for the giraffes. The giraffes are standing close to each other, possibly interacting or enjoying each other's company."}
{"image_id": 58384, "caption": "The image depicts a group of three elephants standing together in a fenced-in area. The elephants are positioned close to each other, with one on the left side, another in the middle, and the third on the right side. They appear to be enjoying each other's company in their enclosure.\n\nIn addition to the elephants, there are several birds scattered throughout the scene. Some birds are perched on the fence or flying in the air, adding a lively atmosphere to the image. Overall, the scene captures the beauty and tranquility of these majestic creatures in their natural habitat."}
{"image_id": 120776, "caption": "The image features a group of people sitting on a balcony overlooking a sculpture. The sculptures are located in front of a building, and there are several umbrellas nearby, providing shade for the people on the balcony. In total, there are four umbrellas, with one on the left side, one in the middle, and two on the right side of the balcony.\n\nThere are five people sitting on the balcony, engaged in conversation or enjoying the view of the sculptures and the surrounding area. A handbag is placed on the balcony, likely belonging to one of the individuals. The scene appears to be a relaxed and social gathering, with people appreciating the art and the outdoor setting."}
{"image_id": 404534, "caption": "The image depicts a city street with a fenced-in area in front of a building. The building is a laundromat called \"Courtdrier,\" as indicated by the sign above the entrance. The fence is blocking off the entrance to the laundromat.\n\nOn the sidewalk, there are a couple of bicycles parked, one closer to the left side and the other further to the right. Additionally, there is a fire hydrant located near the center of the scene. A person can be seen standing on the right side of the image, possibly waiting to enter the laundromat or just passing by."}
{"image_id": 262672, "caption": "In the image, a woman is skiing down a snow-covered slope, wearing skis and holding ski poles. She appears to be enjoying her time on the snow-covered hill. Another person can be seen in the background, possibly skiing or watching the woman.\n\nThere is a car parked nearby, possibly belonging to one of the skiers. Additionally, a backpack is visible in the scene, suggesting that the skiers might be carrying their belongings with them during their skiing adventure."}
{"image_id": 407614, "caption": "The image depicts a small kitchen with a white refrigerator, a sink, a stove, and wooden cabinets. The refrigerator is adorned with a variety of magnets, giving it a personalized touch. A potted plant is placed on top of the refrigerator, adding a touch of greenery to the space.\n\nOn the countertops, there are several bottles, cups, and bowls, indicating that the kitchen is well-equipped for cooking and dining. A vase can also be seen on the countertop, adding a decorative element to the room. A toilet is visible in the background, suggesting that the kitchen is part of a larger living space. Overall, the kitchen has a cozy and inviting atmosphere."}
{"image_id": 146193, "caption": "The image features a young boy standing in the ocean, holding a white surfboard under his arm. He appears to be enjoying his time in the water, possibly preparing to surf or having just finished a ride. The surfboard is positioned close to the boy's body, indicating that he is ready to catch a wave. The scene captures a moment of leisure and adventure for the young surfer."}
{"image_id": 250924, "caption": "In the image, there are two cats sitting in a room, facing each other. One cat is positioned on the left side of the room, while the other cat is on the right side. They appear to be looking at each other, possibly engaging in a playful interaction.\n\nThe room features a bookshelf filled with numerous books of various sizes, creating a cozy and intellectual atmosphere. The bookshelf occupies a significant portion of the background, stretching from one side of the room to the other. The two cats seem to be enjoying their time in this well-stocked space."}
{"image_id": 154931, "caption": "The image depicts a man and a woman sitting at a dining table, enjoying a meal together. The table is filled with a delicious assortment of food, including plates of salad, sandwiches, and vegetables. There are several cups and wine glasses spread across the table, indicating that they are drinking beverages as well.\n\nVarious cutlery items, such as forks, knives, and spoons, can be seen on the table, ready for the diners to use while eating their meal. A chair is positioned near the table, likely for another person to join them. Overall, the scene conveys a pleasant and enjoyable dining experience for the couple."}
{"image_id": 467593, "caption": "The image features a close-up of a colorful bird, possibly a parrot or a peacock, with green, blue, and yellow feathers. The bird is looking directly at the camera, capturing attention with its vibrancy. The bird's feathers appear to be shiny and well-maintained, adding to its striking appearance."}
{"image_id": 406917, "caption": "In the image, a man is walking on a sandy beach while holding a surfboard. He is wearing a blue shirt and appears to be enjoying his time at the beach. The surfboard he is carrying has a colorful design, adding a vibrant touch to the scene.\n\nIn the background, there are several palm trees lining the beach, creating a picturesque and relaxing atmosphere. The man's presence and the surfboard suggest that he might be preparing to go surfing or has just finished a surfing session."}
{"image_id": 403345, "caption": "The image features a bunch of green bananas hanging from a tree in a lush green forest. The bananas are in various stages of ripeness, with some appearing ripe and others still unripe. The tree is surrounded by other trees, creating a dense and vibrant forest atmosphere. The bananas are positioned at different heights, with some closer to the ground and others higher up in the tree. Overall, the scene is a beautiful representation of nature and the growth of bananas."}
{"image_id": 422017, "caption": "In the image, a man is standing on a snow-covered slope, holding a pair of skis. He is wearing a black shirt and appears to be enjoying his time on the mountain. The skis are positioned in front of him, ready for use.\n\nThe scene is set against a beautiful backdrop of snow-covered mountains, creating a picturesque winter landscape. The man seems to be taking a moment to appreciate the breathtaking view before continuing his skiing adventure."}
{"image_id": 48169, "caption": "The image depicts a woman playing tennis on a court. She is holding a tennis racket and is in the middle of a swing, attempting to hit a tennis ball. There are several tennis balls scattered around the court, some close to the woman and others further away.\n\nIn addition to the main tennis player, there is another person visible in the background, possibly watching the game or waiting for their turn to play. The scene captures the intensity and focus of the woman as she engages in the sport."}
{"image_id": 511050, "caption": "The image depicts a cozy living room with a black and white dog standing in the center of the wooden floor. The living room is furniture-rich, featuring a couch on the right side of the room, a chair on the left side, and a dining table in the middle of the space.\n\nThere is a television on the left side of the room, and a collection of books can be found on the dining table and around the room. A vase is placed on the dining table, adding a decorative touch to the space. Additionally, there is a clock hanging on the wall above the dining table.\n\nThe room appears to be a combination of a living room and a dining area, creating a comfortable and inviting atmosphere for the dog and its owner."}
{"image_id": 101948, "caption": "The image features a man wearing a suit and tie, with a smiling expression on his face. He is adjusted his tie, giving the impression that he is preparing for a formal event or a professional occasion. The man's attire and demeanor convey a sense of confidence and professionalism."}
{"image_id": 525899, "caption": "In the image, a person is skillfully riding a wave on a surfboard in the ocean. They are wearing a black wetsuit, which provides them with the necessary protection and flexibility while surfing. The surfer is positioned in the center of the scene, with their surfboard gliding through the water. The wave they are riding appears to be quite large, adding to the excitement of the surfing experience."}
{"image_id": 41276, "caption": "The image features a large silver airplane flying high in the sky, with a clear blue sky serving as the perfect backdrop. The airplane occupies a significant portion of the scene, stretching from the left to the right side of the image. It appears to be a vintage airplane, possibly a propeller plane, given its size and design. The airplane's presence in the sky creates a sense of freedom and adventure, as it soars through the vast expanse of the blue sky."}
{"image_id": 44718, "caption": "The image features a parking lot with two motorcycles parked next to each other. The motorcycles are positioned in a way that they are facing opposite directions. One motorcycle is located on the left side of the image, while the other is on the right side.\n\nIn addition to the motorcycles, there are two people visible in the scene. One person is standing near the left motorcycle, and the other person is standing near the right motorcycle. The presence of these individuals suggests that they might be the owners or riders of the motorcycles."}
{"image_id": 330754, "caption": "In the image, a man and a woman are standing in front of a bus, posing for a picture. The man is wearing a cowboy hat and a vest, while the woman is wearing a cowboy hat as well. They are both smiling and appear to be enjoying their time together.\n\nThe bus is prominently visible in the background, occupying a significant portion of the image. There is also a handbag placed on the ground near the couple, possibly belonging to one of them. The scene conveys a sense of adventure and camaraderie between the two individuals."}
{"image_id": 18073, "caption": "In the image, a person is kiteboarding in the ocean, riding a surfboard while being pulled by a large kite. The kite is flying high in the sky, and the surfer is skillfully maneuvering through the waves. The scene captures the excitement and adventurous nature of kiteboarding, as the surfer enjoys the thrill of harnessing the power of the wind to glide across the water."}
{"image_id": 106641, "caption": "The image features a playground with a green train-themed play structure. A man is standing nearby, watching his child play on the train-shaped playground. There are two benches in the scene, one located closer to the left side of the playground and the other further to the right.\n\nIn addition to the playground, there is a baby stroller parked on the right side of the scene, likely belonging to one of the parents or caregivers. A sports ball can also be seen on the ground, possibly belonging to the child playing on the train-shaped playground."}
{"image_id": 274091, "caption": "The image features a horse statue with a clock mounted on its back, located in a shopping mall. The horse statue is positioned in the center of the scene, with the clock prominently displayed on its back. \n\nThe shopping mall is bustling with activity, as several people can be seen walking around and exploring the area. There are at least 12 people visible in the scene, some closer to the horse statue and others further away. The overall atmosphere of the shopping mall is lively and engaging."}
{"image_id": 145101, "caption": "The image depicts a cozy living room with a black leather couch positioned against the wall. In front of the couch, there is a coffee table with a remote control placed on it. A television is mounted on the wall above the couch, providing entertainment for the occupants.\n\nThe room also features a dining table with chairs surrounding it, creating a comfortable space for meals and gatherings. There are several books scattered throughout the room, indicating a love for reading or a well-stocked library. Additionally, a handbag can be seen on the floor, possibly belonging to one of the room's occupants.\n\nA refrigerator is visible in the background, indicating that the living room is part of an open-concept living space. Overall, the room appears to be a comfortable and inviting space for relaxation and socializing."}
{"image_id": 476767, "caption": "The image features a large, light-colored dog laying down on a brown leather couch. The dog appears to be resting or sleeping comfortably on the couch, occupying a significant portion of the couch's surface. The scene captures the dog's peaceful and relaxed state."}
{"image_id": 314992, "caption": "The image features a woman wearing a black jacket and holding a cell phone in her hand. She is smiling and appears to be posing for a picture. The woman is also holding a handbag, which is placed close to her.\n\nIn the background, there is a backpack, possibly belonging to the woman or someone else in the scene. The woman's smile and the presence of the cell phone suggest that she might be capturing a moment or communicating with someone."}
{"image_id": 475813, "caption": "The image features a young child standing in a room, holding a Nintendo Wii remote in their hand. The child appears to be enjoying their time playing a video game, possibly on a Wii console.\n\nThe room is furnished with a dining table in the background and a chair nearby. There is also a backpack placed on the floor, possibly belonging to the child or someone else in the room. Additionally, a bottle can be seen on a surface in the room, possibly for the child to stay hydrated during their gaming session."}
{"image_id": 147872, "caption": "In the image, a person is skiing down a snow-covered slope, leaving a trail of snow behind them. The skier is positioned in the middle of the scene, with their skis visible beneath them. Another skier can be seen further down the slope, adding to the lively atmosphere of the skiing area.\n\nThe snow-covered slope stretches from the foreground to the background, creating a picturesque winter landscape for the skiers to enjoy. The scene captures the excitement and thrill of skiing on a sunny day."}
{"image_id": 536158, "caption": "The image captures a young man wearing a helmet and a life vest, skillfully riding a surfboard on a river. He is skillfully navigating through the rapids, showcasing his expertise in the sport. The surfboard is positioned in the middle of the scene, with the man skillfully balancing on it.\n\nThe scene is set against a backdrop of rocks, adding to the excitement and challenge of the rapids. The young man's focus and determination are evident as he skillfully maneuvers his surfboard through the water."}
{"image_id": 197652, "caption": "The image features a bird cage filled with a variety of colorful birds, including green, red, yellow, and blue ones. The birds are closely packed together, occupying most of the cage's space. The cage appears to be a large one, providing ample room for the birds to comfortably perch and interact with each other. The birds seem to be enjoying their time together in the cage, creating a lively and vibrant scene."}
{"image_id": 553061, "caption": "In the image, a person is holding a Nintendo Wii game controller in their hand, likely preparing to play a video game. The Wii remote is white and appears to be in good condition. The hand holding the remote is positioned towards the center of the image, with the controller clearly visible."}
{"image_id": 219063, "caption": "The image features a white cat sitting on top of a wooden desk in front of a computer monitor. The cat appears to be looking at the monitor, possibly intrigued by the screen. The desk also has a keyboard and a mouse on it, indicating that it is a workspace.\n\nIn the background, there is a TV mounted on the wall, adding to the cozy atmosphere of the room. Additionally, a book can be seen placed on the desk, suggesting that the space is used for both work and leisure activities."}
{"image_id": 140983, "caption": "The image features a young child sitting on a couch, holding a toothbrush in their mouth. The child appears to be brushing their teeth or playing with the toothbrush. The couch is covered with a blanket, providing a comfortable and cozy environment for the child.\n\nThere are several books scattered around the scene, possibly indicating that the child enjoys reading or has recently been engaged in a reading activity. The presence of the books adds to the warm and inviting atmosphere of the scene."}
{"image_id": 562229, "caption": "In the image, a young boy is riding a skateboard on a sidewalk near a park. He is wearing a helmet for safety while enjoying his skateboarding session. There are a few other people in the scene, with one person standing closer to the right side of the image and another person further to the left.\n\nAdditionally, there is a bicycle parked on the left side of the image, and a bench can be seen in the background, providing a place for people to sit and relax. A backpack is also visible in the scene, likely belonging to one of the people in the area."}
{"image_id": 26174, "caption": "The image features a zebra standing in a grassy field, surrounded by trees. The zebra appears to be looking at the camera, capturing the viewer's attention. The zebra is positioned in the center of the scene, with its body facing the camera.\n\nThe grass in the field is tall and dry, giving off a natural and wild atmosphere. The trees in the background provide a sense of depth and contrast to the zebra's black and white striped pattern. Overall, it is a captivating scene that showcases the beauty of the zebra in its natural habitat."}
{"image_id": 514248, "caption": "The image features a city street with a fire hydrant positioned on the sidewalk. The fire hydrant is painted red and is located near the center of the scene. The street is lined with parked cars on both sides, with a total of six cars visible in various positions.\n\nThere are several people walking along the sidewalk, with three individuals closer to the left side of the scene and two more on the right side. A truck can also be seen parked on the left side of the street. The scene captures a typical day in an urban environment with pedestrians and parked vehicles."}
{"image_id": 272273, "caption": "In the image, a young boy and a young girl are standing next to each other, both holding cell phones in their hands. The boy is on the left side of the scene, while the girl is on the right. They appear to be looking at their cell phones, possibly engaging in a shared activity or conversation.\n\nThere is a handbag placed on the ground near the right side of the scene, possibly belonging to one of the children or another person in the vicinity."}
{"image_id": 196053, "caption": "In the image, a woman is standing on a tennis court, holding a tennis racket and preparing to serve the ball. She is wearing a white shirt and blue shorts, and her hair is pulled back in a ponytail. The woman appears to be focused and ready to hit the tennis ball.\n\nThe tennis court is surrounded by a chain-link fence, providing a secure environment for the game. The woman is the main subject of the scene, and her tennis racket is prominently visible in her hand."}
{"image_id": 241209, "caption": "The image features a glass measuring cup filled with chopped cucumbers. The cup is placed on a wooden table, and the cucumbers are distributed evenly throughout the measuring cup. The cucumbers appear to be freshly chopped and ready to be used in a recipe."}
{"image_id": 404349, "caption": "The image features a large orange cat curled up and sleeping inside a blue washing machine. The washing machine is filled with clothes, creating a cozy and comfortable space for the cat to rest. The clothes are scattered around the cat, with some near the top, middle, and bottom of the machine. The scene captures a unique and endearing moment of the cat finding a comfortable spot to sleep."}
{"image_id": 176232, "caption": "The image features a vase filled with purple flowers, placed on a table. The vase is positioned in the center of the scene, surrounded by a few books. There are two books on the left side of the vase, one closer to the front and the other further back. On the right side of the vase, there are two more books, one closer to the front and the other further back. The combination of the purple flowers and the books creates a cozy and inviting atmosphere."}
{"image_id": 568367, "caption": "The image features a wooden table with four cell phones placed on top of it. The cell phones vary in size and design, with one being a flip phone and the others being modern smartphones. The flip phone is positioned towards the left side of the table, while the other three smartphones are spread out across the table. The arrangement of the cell phones suggests that they might belong to different individuals or be used for various purposes."}
{"image_id": 72873, "caption": "The image depicts a hospital room with a hospital bed situated in the center of the room. The bed is surrounded by a few chairs, with one on the left side and another on the right side of the room. A TV is mounted on the wall above the bed, providing entertainment for the patient. \n\nThe room also features a window, allowing natural light to enter the space. In addition to the bed and chairs, there is a dining table located towards the right side of the room. A couple of bottles can be seen on the table, possibly containing medication or other medical supplies. Overall, the room appears to be well-equipped for patient care and comfort."}
{"image_id": 502410, "caption": "The image depicts a heartwarming scene of a mother horse and her foal grazing together in a grassy field. The adult horse is on the left side of the image, while the foal is on the right side. They are both eating grass, enjoying their time together.\n\nIn the background, there are two more horses, one on the far left and the other on the far right side of the image. The presence of these additional horses suggests that the scene might be taking place in a larger pasture or a farm."}
{"image_id": 365339, "caption": "The image captures a lively scene at the beach, where a large group of people is enjoying a day of kite flying. There are numerous kites of various shapes and sizes flying high in the sky, creating a vibrant and colorful atmosphere. Some of the kites have long tails, adding to the visual appeal of the scene.\n\nThe beach is bustling with activity, as people of all ages can be seen participating in the kite-flying fun. In total, there are at least 14 people visible in the image, scattered across the beach and engaging with the kites. The combination of the kites, people, and the beach setting creates a memorable and joyful scene."}
{"image_id": 188318, "caption": "The image features a tennis court with several tennis rackets and shoes scattered around. There are at least five tennis rackets visible in the scene, some placed horizontally on the court and others leaning against the ground. A pair of tennis shoes can also be seen on the court.\n\nTwo people are present in the scene, one standing closer to the left side of the court and the other towards the right side. Both individuals are wearing tennis shoes and appear to be either preparing to play or have just finished a game. The presence of the tennis rackets and shoes suggests an active and engaging atmosphere on the tennis court."}
{"image_id": 249025, "caption": "The image features a vase filled with a beautiful bouquet of yellow and pink roses. The vase is placed on a table, and the roses are arranged in a visually appealing manner. There are at least six roses in the vase, with some being larger and others smaller. The combination of yellow and pink roses creates a warm and inviting atmosphere in the scene."}
{"image_id": 283910, "caption": "The image depicts a lush green field where a herd of sheep and a black and white dog are running together. The dog appears to be herding the sheep, guiding them across the field. There are a total of nine sheep in the scene, with some closer to the foreground and others further in the background. The dog is positioned in the middle of the field, actively engaging with the sheep. The scene captures the dynamic interaction between the dog and the sheep as they move through the grassy field."}
{"image_id": 234934, "caption": "The image features a dining table with a white plate containing a delicious meal. The plate is topped with a fried egg, asparagus, and a slice of lemon. The asparagus is placed on the left side of the plate, while the lemon is positioned on the right side. A fork can be seen on the left side of the plate, ready to be used for enjoying this delightful meal."}
{"image_id": 3711, "caption": "The image features a black cat sitting on the hood of a white car. The car is parked on a dirt road, and the cat appears to be enjoying its elevated position on the vehicle. The cat's tail can be seen hanging off the side of the car, adding to the scene's charm."}
{"image_id": 507301, "caption": "In the image, a black and white cat is sitting on top of a laptop computer. The laptop is open, and the cat appears to be staring intently at the screen. The scene takes place in a room with a carpeted floor.\n\nAdditionally, there are several books scattered around the room. Some books are placed near the laptop, while others are located closer to the edges of the image. The presence of these books suggests that the room might be a study or workspace."}
{"image_id": 458054, "caption": "The image features a row of white toilets lined up in a forest setting. There are a total of nine toilets in the scene, with some of them appearing to be broken or damaged. The toilets vary in size and position, with some closer to the foreground and others further back in the scene.\n\nIn addition to the toilets, there is a pair of scissors lying on the ground near the center of the scene. The overall atmosphere of the image suggests that the toilets might be discarded or awaiting disposal."}
{"image_id": 222662, "caption": "The image depicts a busy city street with a woman standing under a blue and white umbrella, possibly waiting to cross the street. She is wearing a polka dot dress and appears to be the main focus of the scene.\n\nThere are several other people on the street, some carrying handbags and backpacks. A traffic light can be seen in the background, indicating the presence of an intersection. The scene captures the hustle and bustle of city life, with people going about their daily routines."}
{"image_id": 36713, "caption": "The image features a black dog laying down on a floral-patterned couch. The dog appears to be relaxed and comfortable, occupying a significant portion of the couch. The couch itself has a vibrant and colorful design, adding a lively atmosphere to the scene."}
{"image_id": 258085, "caption": "The image depicts a group of people, including a man in a suit and tie, shaking hands with a group of children. The man in the suit appears to be a politician, as he is shaking hands with the children in front of a crowd. The children are wearing white shirttops and are gathered around the politician, engaging in a handshake.\n\nThere are several other people present in the scene, some standing close to the politician and children, while others are positioned further away. A cell phone can be seen in the scene, likely belonging to one of the people present. The atmosphere seems to be friendly and positive as the politician interacts with the children."}
{"image_id": 53907, "caption": "The image features a group of three zebras standing together in a dry, grassy field. The zebras are positioned close to each other, with one on the left side, another in the middle, and the third on the right side of the field. They appear to be grazing or simply enjoying each other's company.\n\nThe field is vast and spans the entire image, with the zebras being the main focus of the scene. The landscape is characterized by dry grass and a mountainous background, creating a picturesque and natural setting for the zebras."}
{"image_id": 460866, "caption": "The image features a bathroom sink with a variety of toiletries, including toothbrushes and a toothpaste tube. There are three toothbrushes in the scene, with one on the left side, one in the middle, and another on the right side of the sink. The toothpaste tube is located near the center of the sink.\n\nIn addition to the toothbrushes and toothpaste tube, there are two bottles, one on the left side and another on the right side of the sink. A cup can also be seen on the left side of the sink. The arrangement of these items creates a typical bathroom scene."}
{"image_id": 382603, "caption": "The image showcases a bakery display case filled with an assortment of delicious pastries and donuts. There are at least 13 different types of donuts visible in the display case, with various shapes, sizes, and flavors. Some of the donuts are placed closer to the front, while others are positioned further back in the case.\n\nIn addition to the donuts, there are several cakes and pies displayed in the case, adding to the variety of baked goods available for customers to choose from. The bakery display case is well-stocked and offers a mouth-watering selection of treats for those with a sweet tooth."}
{"image_id": 435562, "caption": "The image features a young boy wearing a blue shirt, a red bow tie, and a red necktie. He is sitting in a seat, possibly on a bus or a train. The boy appears to be smiling and enjoying his time.\n\nThere are two chairs in the scene, with one being occupied by the young boy and the other one being empty. The boy's outfit and the presence of the chairs suggest that he might be dressed up for a special occasion or simply enjoying a ride on public transportation."}
{"image_id": 96006, "caption": "The image features a man walking along a rocky beach near a large, old brick building. The building appears to be a castle-like structure with a clock on its side. The man is walking towards the water, possibly enjoying the view or taking a leisurely stroll.\n\nThe scene is set against a backdrop of a cloudy blue sky, creating a serene atmosphere. The combination of the man, the old brick building, and the picturesque surroundings make for an interesting and captivating image."}
{"image_id": 507927, "caption": "The image features a group of people riding motorcycles down a city street. There are at least nine motorcycles visible in the scene, with some riders wearing sunglasses and others wearing helmets. The riders are spread out along the street, with some closer to the foreground and others further in the background.\n\nIn addition to the motorcycles, there are several cars parked or driving along the street. A traffic light can be seen in the middle of the scene, indicating that the motorcyclists are navigating through an urban environment.\n\nThere are also a few pedestrians visible in the image, some of whom are carrying handbags. Overall, the scene depicts a lively atmosphere with people enjoying their time on their motorcycles."}
{"image_id": 481891, "caption": "The image captures a group of young men playing a game of frisbee on a grassy field. There are four men in the scene, all wearing yellow shirts and actively participating in the game. One of the men is jumping in the air to catch the frisbee, while the others are spread out across the field, ready to make a play.\n\nThe frisbee can be seen in the middle of the scene, with one of the players about to make a catch. The group appears to be enjoying their time outdoors, engaging in friendly competition and camaraderie."}
{"image_id": 64059, "caption": "In the image, there are two people playing a game of frisbee on a grassy field. One person is positioned towards the left side of the field, while the other person is on the right side. The frisbee appears to be in the air, close to the person on the right.\n\nBoth players are wearing black pants as they engage in the game. The person on the left is wearing a green shirt, while the person on the right is wearing a red shirt. The scene captures the excitement and enjoyment of playing frisbee outdoors."}
{"image_id": 156372, "caption": "The image features a boat with a yellow wicker chair and a backpack placed on it. The chair is positioned near the center of the boat, while the backpack sits on the left side of the chair. The boat appears to be floating on a body of water, possibly a lake or a river.\n\nIn the background, there are a few other boats visible, adding to the overall atmosphere of the scene. The presence of the chair and backpack suggests that someone might be enjoying a leisurely day out on the water."}
{"image_id": 223554, "caption": "The image features a beach scene with two large pelicans standing next to each other near the water's edge. Both pelicans have long beaks and are looking in the same direction.\n\nIn addition to the two main pelicans, there are several other birds scattered throughout the scene. Some of these birds are closer to the water's edge, while others are further away. The presence of multiple birds creates a lively and bustling atmosphere at the beach."}
{"image_id": 120037, "caption": "In the image, a man is standing in a grassy field, flying a colorful kite high in the sky. The kite has a long tail, adding to its vibrant appearance. The man appears to be enjoying his time outdoors, controlling the kite as it soars through the air.\n\nThe scene is set against a backdrop of a building, possibly a house or a structure in the vicinity. The man is the main focus of the image, capturing the essence of a leisurely day spent flying a kite."}
{"image_id": 135673, "caption": "The image captures a breathtaking scene of two airplanes flying side by side in the sky. The first airplane is a large jetliner, while the second airplane is a small propeller plane. The two planes are flying at different altitudes, with the jetliner being higher up in the sky.\n\nThe jetliner is positioned more towards the left side of the image, while the propeller plane is flying closer to the center. The two airplanes appear to be maintaining a safe distance from each other, showcasing the impressive coordination and skill of the pilots involved."}
{"image_id": 365993, "caption": "The image captures a thrilling moment of a snowboarder performing a jump on a snow-covered slope. The snowboarder, wearing a green jacket, is in mid-air, showcasing their skill and athleticism.\n\nThere are several other people in the scene, likely watching the snowboarder's performance or waiting for their turn to showcase their own snowboarding abilities. Some of them are standing closer to the snowboarder, while others are further away.\n\nIn addition to the main snowboarder, there are two snowboards visible in the scene, one near the center and the other towards the right side. The presence of these snowboards suggests that the area is a popular spot for snowboarding enthusiasts."}
{"image_id": 245497, "caption": "The image captures a man skillfully riding a skateboard down a flight of stairs at night. The skateboard is positioned in the middle of the scene, with the skateboarder jumping over the stairs, showcasing his talent.\n\nThe setting appears to be a city street, with a few cars parked along the street. There are two cars on the left side of the image, one closer to the foreground and the other further back. On the right side of the image, there is another car parked near the stairs.\n\nAdditionally, there are two traffic lights visible in the scene, one near the center and the other towards the right side. The presence of these traffic lights suggests that the skateboarder is navigating through an urban environment while performing his daring stunt."}
{"image_id": 558966, "caption": "The image features a room with a black suitcase and a backpack placed on the floor. The suitcase is positioned towards the left side of the room, while the backpack is located closer to the center. There is also a handbag on the right side of the room.\n\nIn addition to the luggage, there is a book placed on the floor near the center of the room. The room appears to be well-organized and prepared for travel."}
{"image_id": 260738, "caption": "The image features a small brown and white dog standing on a set of stairs in front of a blue wooden door. The dog appears to be looking up, possibly waiting for someone to open the door or just observing its surroundings. The stairs are located next to a large pile of green bananas, creating an interesting contrast between the dog and the fruit."}
{"image_id": 414522, "caption": "The image captures a snowboarder wearing a helmet, standing on a snow-covered slope. The snowboarder is positioned in the middle of the scene, with their snowboard visible beneath them. The snowboarder appears to be enjoying their time on the mountain, possibly taking a break or preparing to continue snowboarding down the slope. The scene is set against a backdrop of trees, creating a picturesque winter landscape."}
{"image_id": 432534, "caption": "The image showcases a beautiful arrangement of pink and yellow tulips in various vases. The vases are placed on a wooden shelf, creating an eye-catching display. The tulips come in different shades of pink and yellow, adding a vibrant and lively touch to the scene.\n\nIn total, there are six vases holding the tulips, each varying in size and shape. Some vases are larger and more prominent, while others are smaller and more delicate. The combination of the tulips and the wooden shelf creates a warm and inviting atmosphere, perfect for decorating a home or a special event."}
{"image_id": 526804, "caption": "The image features a dining table with a delicious slice of pizza placed on a paper plate. The pizza is topped with cheese and black olives, making it a mouth-watering meal. Next to the pizza, there is a cup and a bottle, possibly containing a beverage to accompany the meal.\n\nIn addition to the pizza and beverage, there are two chairs positioned around the table, inviting someone to sit and enjoy the meal. A spoon can also be seen on the table, possibly for serving the pizza or a side dish. Overall, the scene presents a cozy and appetizing dining experience."}
{"image_id": 520389, "caption": "The image features a black and white cat lying on a purse, which is placed on a wooden floor. The cat appears to be enjoying its time on the purse, possibly curling up and taking a nap. The purse is decorated with a flower pattern, adding a touch of color to the scene."}
{"image_id": 9077, "caption": "The image depicts a bustling fruit and vegetable market filled with an abundance of fresh produce. The market is well-stocked with a variety of fruits and vegetables, including bananas, apples, oranges, and pears. The bananas are prominently displayed in multiple locations throughout the market, with some hanging from the ceiling and others placed on shelves.\n\nIn addition to the fruits and vegetables, there are several bottles scattered throughout the market, likely containing beverages or condiments. A person can be seen in the background, likely browsing or shopping for fresh produce. The overall atmosphere of the market is vibrant and inviting, showcasing the variety and freshness of the available fruits and vegetables."}
{"image_id": 451373, "caption": "The image features a street corner with two street signs, one for Kidney Bean Lane and the other for Lincoln Street. The street signs are attached to a metal pole, which is located in front of a house. The house has a red roof, and there are two windows visible in the scene.\n\nThe street signs are positioned close to each other, with the Kidney Bean Lane sign on the left and the Lincoln Street sign on the right. The scene appears to be set in a residential area, with the house and the street signs as the main focal points."}
{"image_id": 483867, "caption": "In the image, a woman is walking her dog on a leash while holding a colorful umbrella to protect herself from the rain. The dog is positioned close to the woman, following her as she walks down the sidewalk.\n\nThere are several cars parked along the street, with one on the left side of the scene, two on the right side, and one in the background. Additionally, a potted plant can be seen on the left side of the image, adding a touch of greenery to the scene."}
{"image_id": 447337, "caption": "The image features a delicious stack of banana pancakes on a white plate, placed on a dining table. The pancakes are topped with bananas and drizzled with syrup, making for a mouth-watering breakfast or dessert.\n\nIn addition to the main dish, there are several bottles and cups scattered around the table, possibly containing beverages or condiments to accompany the meal."}
{"image_id": 351840, "caption": "In the image, a dog is sitting in the driver's seat of a parked truck. The dog appears to be looking out the window, possibly observing the surroundings or waiting for its owner. The truck is parked on the side of the road, and there is another car visible in the background."}
{"image_id": 485485, "caption": "The image features two elephants standing in a dirt field under the shade of trees. The elephants are positioned close to each other, with one on the left and the other on the right side of the field. The trees surrounding the elephants provide a natural and serene environment for the animals."}
{"image_id": 65736, "caption": "In the image, a woman is playing tennis on a court, holding a tennis racket and preparing to hit a tennis ball. She is wearing a black shirt and shorts, and her posture suggests that she is focused on the incoming ball. The tennis ball can be seen in the air, close to her racket.\n\nThe scene takes place on a tennis court, which is surrounded by a fence. The woman appears to be the main subject of the image, showcasing her athleticism and skill in the sport."}
{"image_id": 210439, "caption": "The image captures a lively scene of a group of people playing frisbee in a park. There are four people in total, with two of them wearing red shirts and the other two wearing blue shirts. They are all actively engaged as they try to catch the blue frisbee in the air.\n\nThe frisbee is located towards the right side of the image, with one of the red-shirted individuals reaching out to catch it. The other red-shirted person is also trying to catch the frisbee, while the two blue-shirted individuals are focused on the game as well. The group appears to be enjoying their time outdoors, participating in a fun and energetic game of frisbee."}
{"image_id": 374576, "caption": "The image depicts a cozy bedroom with two beds placed next to each other. The beds are positioned under a window, allowing for natural light to illuminate the room. The beds are covered with blankets, giving them a comfortable and inviting appearance.\n\nIn addition to the beds, there is a chair located in the room, providing a seating option for relaxation or reading. The overall atmosphere of the bedroom is warm and welcoming, perfect for rest and rejuvenation."}
{"image_id": 183914, "caption": "In the image, a man is sitting at a dining table, holding a cell phone in his hand. He is smoking a cigarette and appears to be looking at the screen of his phone. There are several other people in the scene, with one person sitting close to the man with the cell phone and others further away in the background.\n\nThe dining table is surrounded by chairs, and there are a few cups placed on the table. A TV can be seen in the background, adding to the casual atmosphere of the scene."}
{"image_id": 564109, "caption": "The image features a group of five giraffes standing in a dirt field near some trees. The giraffes are positioned at various distances from each other, with one on the left side, two in the middle, and two on the right side. They appear to be enjoying the shade provided by the trees.\n\nIn addition to the giraffes, there are two birds visible in the scene, one near the top left corner and the other towards the top right corner. The presence of these birds adds to the natural ambiance of the scene."}
{"image_id": 416220, "caption": "The image is a black and white photograph of a city street filled with vintage cars parked along the sidewalk. There are numerous cars of various sizes, with some parked closer to the foreground and others further down the street. A fire hydrant can be seen on the right side of the street.\n\nIn addition to the cars, there are several people walking along the sidewalk, with one person closer to the left side of the street and others scattered throughout the scene. The overall atmosphere of the image is reminiscent of a bygone era, capturing the essence of a bustling city street filled with classic cars and pedestrians."}
{"image_id": 506982, "caption": "The image features a kitchen with a stainless steel refrigerator prominently placed in the scene. The refrigerator has a water dispenser on the door, and a box of Brawny paper towels can be seen next to it. There is also a can of soda on the countertop.\n\nIn addition to the refrigerator, there is a microwave placed above the countertop. The kitchen appears to be in the process of being set up or organized, as evidenced by the presence of the box of Brawny paper towels and the can of soda."}
{"image_id": 352111, "caption": "In the image, a tennis player is standing on a tennis court, holding a tennis racket in his hand. He is wearing a black shirt and appears to be focused on the game. Another person can be seen in the background, possibly watching the game or waiting for their turn to play.\n\nThere are several tennis balls scattered around the court, indicating an ongoing match or practice session. A sports ball is also visible near the bottom right corner of the image. Overall, the scene captures the intensity and excitement of a tennis match."}
{"image_id": 52282, "caption": "The image features a living room with a television on the left side and a bicycle parked in the middle of the room. The bicycle is leaning against a wall, taking up a significant portion of the space. The room also has a bookshelf filled with various books, adding to the cozy atmosphere of the living area.\n\nIn addition to the bicycle, there is a cell phone placed on the right side of the room, near the edge of the image. The living room appears to be a comfortable space for relaxation and entertainment."}
{"image_id": 575018, "caption": "The image depicts a bakery with a counter filled with a large assortment of pastries and desserts, such as donuts and cakes. There are at least 12 donuts displayed on the counter, with some placed closer to the front and others further back. In addition to the donuts, there are three cakes visible on the counter.\n\nThree people can be seen in the bakery, with one person standing near the left side of the counter, another person in the middle, and the third person on the right side. They appear to be working in the bakery, possibly preparing or serving the delicious treats.\n\nThe bakery is well-equipped with various kitchen appliances, including a refrigerator, a microwave, and an oven. A sink can also be seen in the background, indicating that the bakery is clean and well-maintained."}
{"image_id": 532548, "caption": "The image features a dining table with a white plate filled with a delicious assortment of vegetables. The plate is topped with several pieces of broccoli, some of which are placed closer to the center of the plate, while others are scattered around the edges. In addition to the broccoli, there are also a few carrots on the plate, adding a pop of color to the dish.\n\nThe vegetables are arranged in a way that makes for an appetizing and visually appealing presentation. The combination of broccoli, carrots, and possibly other vegetables creates a healthy and nutritious meal."}
{"image_id": 491556, "caption": "In the image, a man and a woman are sitting on red chairs, posing for a picture. The man is wearing a white shirt and tie, while the woman is dressed in a black and white outfit. They are accompanied by a brown dog, which is sitting on the floor between them.\n\nThe scene takes place in a workshop or garage, as evidenced by the presence of several tools and equipment scattered around the area. There is a clock on the wall, and a chair can be seen in the foreground. The overall atmosphere appears to be casual and friendly, with the couple and their dog enjoying their time together."}
{"image_id": 394050, "caption": "The image features a man wearing a red polo shirt and plaid shorts, holding a white frisbee in his hand. He appears to be the main focus of the scene. In the background, there are several other people, some of whom are also holding frisbees.\n\nA dining table can be seen in the background, along with a couple of chairs placed around it. There is also a handbag placed on the table. The presence of multiple people and frisbees suggests that this might be a gathering or a frisbee-related event."}
{"image_id": 152106, "caption": "The image depicts a black and white cow standing in a dirt field. The cow appears to be looking at the camera, capturing the viewer's attention. The field is surrounded by trees, creating a serene and natural setting.\n\nIn addition to the cow, there are several other cows in the background, some of which are closer to the trees. A truck can also be seen in the background, parked near the edge of the field."}
{"image_id": 4256, "caption": "The image features a dining table with two plates of food, each containing broccoli and cheese. The table is set with silverware, including forks, knives, and spoons, placed neatly around the plates. There are also two cups on the table, one near the top left corner and the other near the top right corner.\n\nIn addition to the food and silverware, there is a loaf of bread on the table, positioned near the top right corner. The table appears to be set for a meal, with the broccoli and cheese dishes as the main course."}
{"image_id": 69906, "caption": "The image features a dining table with a white plate containing a delicious meal. On the plate, there is a piece of meat, possibly chicken, accompanied by a side of broccoli and pasta. The broccoli is scattered around the plate, with some pieces closer to the meat and others near the edge of the plate. The pasta is placed on the right side of the plate, creating a well-balanced and appetizing meal."}
{"image_id": 187888, "caption": "The image features a dining table with a plate containing a delicious assortment of food. On the plate, there is a waffle, chicken, and pineapple. The waffle is placed in the center of the plate, while the chicken and pineapple are scattered around it.\n\nIn addition to the main dish, there are two forks on the table. One fork is located on the left side of the plate, and the other is on the right side. A knife can also be seen on the right side of the plate. The arrangement of the food and utensils creates a visually appealing and appetizing presentation."}
{"image_id": 352949, "caption": "The image features a woman wearing a purple shirt and a black tie with an octopus pattern. She is taking a selfie in front of a mirror, capturing her outfit and appearance. The woman appears to be in a bathroom, with a sink visible in the background.\n\nIn addition to the main subject, there is a cell phone in the scene, likely being used to take the selfie. The cell phone is positioned on the right side of the image, close to the woman's hand."}
{"image_id": 311205, "caption": "The image depicts a large dump truck driving down a street in a residential area. The truck occupies a significant portion of the scene, extending from the left to the right side of the image. The street is lined with houses on both sides, creating a peaceful neighborhood atmosphere.\n\nIn addition to the dump truck, there are two cars visible in the scene. One car is parked on the left side of the street, while the other car is further down the street on the right side. The combination of the truck, cars, and houses gives the impression of a typical day in a small town or suburban area."}
{"image_id": 264489, "caption": "The image features a vase filled with a variety of flowers, placed on a wooden table. The vase is positioned towards the left side of the table, while the flowers are spread throughout the vase, creating a visually appealing arrangement.\n\nIn addition to the main vase, there are two smaller vases present in the scene. One of the smaller vases is located on the right side of the main vase, while the other is situated on the left side. The combination of the main vase, smaller vases, and the assortment of flowers creates a harmonious and attractive display."}
{"image_id": 470801, "caption": "In the image, a woman is flying a colorful kite high in the blue sky. The kite is shaped like a butterfly and has a rainbow design, adding a vibrant touch to the scene. The woman appears to be enjoying her time outdoors, controlling the kite as it soars through the air."}
{"image_id": 235784, "caption": "In the image, a person is standing in a snow-covered field, wearing a backpack and holding ski poles. The person appears to be enjoying their time in the snowy landscape, possibly preparing for a skiing adventure. The backpack is placed on the person's back, and the ski poles are held in their hands, ready for use. The scene captures the essence of winter sports and outdoor activities."}
{"image_id": 117127, "caption": "The image depicts a man walking on a beach, carrying a surfboard under his arm. He appears to be enjoying his time near the water, possibly preparing to surf or having just finished a surfing session. The beach is bathed in a warm, golden light, creating a serene atmosphere. The man is the main focus of the scene, with the surfboard serving as a symbol of his connection to the ocean and the sport of surfing."}
{"image_id": 209728, "caption": "The image features two ducks, one of which is standing on a rock near a body of water. The duck on the rock appears to be looking at the camera, while the other duck is swimming in the water nearby. The duck on the rock has a distinctive orange beak, which stands out against its brown and black feathers. The scene captures a moment of curiosity and interaction between the two ducks in their natural habitat."}
{"image_id": 454314, "caption": "The image depicts a group of three brown bears walking through a lush, grassy field. The bears are spread out, with one on the left side, another in the middle, and the third on the right side of the field. The bears appear to be enjoying their time in the open, grassy area.\n\nIn the background, there is a mountain visible, adding to the picturesque scenery of the scene. The bears seem to be roaming freely, possibly searching for food or exploring their surroundings. Overall, the image captures a serene moment in the lives of these majestic creatures."}
{"image_id": 377097, "caption": "The image features a man standing behind a counter in a doughnut shop, surrounded by an assortment of doughnuts. There are at least 14 doughnuts visible in the scene, with various shapes, sizes, and flavors. Some doughnuts are placed closer to the man, while others are positioned further away.\n\nIn addition to the doughnuts, there are two cups on the counter. One cup is located near the left side of the counter, and the other cup is positioned closer to the right side. The man appears to be enjoying his time in the doughnut shop, surrounded by the delicious treats."}
{"image_id": 309940, "caption": "The image depicts a young man wearing a baseball uniform, standing on a grassy field. He is crouched down, likely preparing to catch a ball during a baseball game. The young man is wearing a baseball glove, which is visible on his left hand.\n\nThe field is surrounded by a chain-link fence, providing a secure boundary for the game. The scene captures the excitement and focus of the young man as he anticipates the next play in the game."}
{"image_id": 68080, "caption": "The image depicts a man playing tennis on a court, holding a tennis racket and preparing to hit the ball. He is the main focus of the scene, with his tennis racket positioned to make contact with the ball.\n\nThere are several other people in the scene, some of whom appear to be watching the game or waiting for their turn to play. A few potted plants are scattered around the court, adding a touch of greenery to the environment.\n\nIn addition to the main tennis player, there are at least 12 other people visible in the image, some of whom are closer to the foreground and others further in the background. A bottle can also be seen on the court, possibly belonging to one of the players or spectators."}
{"image_id": 113720, "caption": "The image features a man and a woman sitting together at a dining table, enjoying a meal of pizza. There are two pizzas on the table, one closer to the man and the other near the woman. They are both smiling and posing for the camera.\n\nThe table is set with various items such as cups, forks, knives, and a bottle. There are two cups, one near the woman and the other closer to the man. Two forks and two knives are placed on the table, one near each person. A bottle is also visible on the table, likely containing a beverage to accompany their meal.\n\nAdditionally, there are two wine glasses on the table, one near the woman and the other closer to the man. A cake can also be seen on the table, adding to the festive atmosphere of the meal."}
{"image_id": 346703, "caption": "The image is a collage of four pictures showcasing a family gathered around a dining table, enjoying a meal and celebrating a special occasion. In the first picture, a man is holding a spoon over a plate of food, possibly a cake, as the family looks on. In the second picture, a woman is holding a spoon over a plate of food, possibly a cake, as the family looks on. In the third picture, a man is holding a spoon over a plate of food, possibly a cake, as the family looks on. In the fourth picture, a woman is holding a spoon over a plate of food, possibly a cake, as the family looks on.\n\nThe dining table is surrounded by chairs, and there is a wine glass and a cup placed on the table. A cake can be seen in each of the four pictures, indicating that it is a central part of the celebration. The family appears to be enjoying their time together, sharing a meal and creating lasting memories."}
{"image_id": 284548, "caption": "The image features a red and black toy train with red wheels, sitting on a set of train tracks. The toy train appears to be an old-fashioned steam engine, adding a nostalgic touch to the scene. The train is positioned on the tracks, occupying a significant portion of the image from left to right."}
{"image_id": 527718, "caption": "In the image, a man is sitting on a snow-covered slope with a snowboard attached to his feet. He is wearing a yellow jacket and appears to be taking a break from snowboarding. The man is positioned in the center of the scene, surrounded by snow.\n\nThere are several orange cones scattered around the area, likely marking boundaries or guiding snowboarders and skiers. The cones are placed at various distances from the man, with some closer to him and others further away. Overall, the scene captures a moment of rest during a snowboarding adventure."}
{"image_id": 107068, "caption": "The image captures a thrilling moment during a baseball game. A baseball player is standing at home plate, holding a baseball bat and preparing to swing. The catcher is positioned behind the batter, ready to catch the ball.\n\nThere are several other people in the scene, including teammates, opponents, and possibly coaches or umpires, all focused on the game. Some of them are standing closer to the action, while others are further away.\n\nIn the background, there is a truck parked near the field, possibly used for transporting equipment or providing support during the game. Overall, the scene depicts the excitement and anticipation of a professional baseball game."}
{"image_id": 180784, "caption": "The image features a grassy field with two airplanes parked side by side. One of the airplanes is a large, old-fashioned propeller airplane, while the other is a smaller, more modern aircraft. The propeller airplane is positioned closer to the left side of the image, while the smaller airplane is on the right.\n\nThere are a few people scattered around the field, likely observing or working on the airplanes. One person is standing near the left side of the propeller airplane, while two others are positioned closer to the right side of the smaller airplane. The presence of these individuals suggests that the airplanes might be on display or undergoing maintenance."}
{"image_id": 189197, "caption": "The image depicts a peaceful scene of a bench sitting on top of a rock near a body of water. The bench overlooks the water, providing a serene view of the surroundings. The water appears to be calm and reflective, with the foggy atmosphere adding to the tranquil ambiance.\n\nIn addition to the bench, there is a tree nearby, adding to the natural beauty of the scene. The combination of the bench, water, and tree creates a picturesque and inviting setting for relaxation and contemplation."}
{"image_id": 28343, "caption": "The image features a dining table with a glazed donut and a cup of coffee placed on it. The donut is positioned in the center, while the cup of coffee is located to the left of the donut. The table is adorned with a colorful tablecloth, adding a vibrant touch to the scene."}
{"image_id": 543581, "caption": "The image features a living room with a brown couch and a black leather ottoman. On the couch, a black and white dog is sitting, while a cat is standing nearby. The room also has a TV placed on the left side of the couch.\n\nThere is a collection of books scattered around the room, with some on the couch and others on the floor. Additionally, there is a cup placed on the right side of the couch. The living room appears to be a comfortable space for both the dog and the cat to relax and enjoy their time together."}
{"image_id": 76619, "caption": "The image features a close-up of an orange and white cat sitting on a carpeted floor in front of a television. The cat seems to be staring directly at the camera, capturing the viewer's attention.\n\nIn the background, there is a bookshelf filled with various books, adding a cozy and lived-in atmosphere to the scene. A remote can also be seen on the floor, likely used to control the television."}
{"image_id": 8853, "caption": "In the image, a person is skiing down a snow-covered mountain slope. They are wearing a yellow jacket and appear to be enjoying the thrill of the descent. The skier is positioned in the middle of the scene, with their skis visible beneath them.\n\nThe mountain slope is surrounded by a beautiful snowy landscape, and the skier's shadow can be seen on the snow below them. The scene captures the excitement and adventure of skiing down a mountain, showcasing the skier's skill and the breathtaking surroundings."}
{"image_id": 195271, "caption": "In the image, a woman is standing in a kitchen, holding a box of corn flakes. She appears to be in the process of opening the box, possibly preparing a meal or snack. The kitchen is well-equipped with various appliances such as a microwave, an oven, a sink, and a refrigerator.\n\nSeveral bottles can be spotted in different areas of the kitchen, possibly containing cooking ingredients or beverages. A bowl is also visible on the countertop, indicating that the woman may have been preparing a meal or snack. Additionally, there is a cup placed near the sink, suggesting that the woman may have been enjoying a beverage while working in the kitchen."}
{"image_id": 454751, "caption": "The image depicts a group of people gathered in a room, playing a video game on a Nintendo Wii console. There are at least five people in the scene, with two of them actively playing the game using Wii remotes. The other three people are watching and enjoying the gameplay.\n\nThere are two Wii remotes visible in the scene, one held by a person on the left side and another held by a person on the right side. A backpack can be seen placed on the floor, likely belonging to one of the players. The atmosphere appears to be lively and fun, with everyone engaged in the gaming experience."}
{"image_id": 93985, "caption": "The image features a young boy wearing a baseball glove, standing on a deck and preparing to catch a baseball. He is holding the baseball glove in front of him, ready to make the catch. The baseball is in mid-air, approaching the boy. \n\nThe boy is wearing a jacket, which adds to the casual and playful atmosphere of the scene. The outdoor setting and the presence of the baseball glove suggest that the boy is enjoying a game of catch or practicing his baseball skills."}
{"image_id": 551315, "caption": "The image features a red fire hydrant on a sidewalk, with water pouring out of it. There are several people gathered around the hydrant, observing the water flowing from it. In total, there are at least 13 people visible in the scene, some standing closer to the hydrant and others further away.\n\nA cup can be seen on the ground near the hydrant, possibly belonging to one of the people in the crowd. The scene appears to be a public gathering or event where the fire hydrant has caught the attention of the attendees."}
{"image_id": 80367, "caption": "The image features a white plate filled with a delicious and colorful salad. The salad consists of a variety of vegetables, including broccoli, carrots, and red peppers. The broccoli can be seen in different parts of the plate, with some pieces closer to the center and others towards the edges.\n\nIn addition to the vegetables, the salad also contains chicken, making it a well-balanced and nutritious meal. The chicken pieces are scattered throughout the plate, with some near the center and others closer to the edges. The combination of vegetables, chicken, and sauce creates a visually appealing and appetizing dish."}
{"image_id": 542939, "caption": "In the image, a man is lying on the floor with a baby on top of him, creating a playful scene. The baby appears to be enjoying the time spent with the man, who is wearing a blue shirt. A dog is standing nearby, watching the interaction between the man and the baby.\n\nThe room features a bookshelf filled with various books, which adds to the cozy atmosphere of the scene. A bottle can also be seen on the floor, possibly belonging to the baby or the man. Overall, the image captures a heartwarming moment between the man, the baby, and the dog."}
{"image_id": 317402, "caption": "The image features a large white dog sitting comfortably on a chair in a living room. The dog occupies most of the chair, making it the central focus of the scene.\n\nThe living room is furnished with a dining table, a potted plant, a vase, and a few books. The dining table is located on the right side of the room, while the potted plant and vase are placed on the left side. The books are scattered around the room, with some near the dining table and others closer to the potted plant."}
{"image_id": 453792, "caption": "The image features a woman standing in a room, holding a snowboard on her shoulder. She is wearing a black and white striped shirt, and she appears to be smiling as she poses with her snowboard. The room appears to be a lobby or a waiting area, as there is a bench in the background.\n\nIn addition to the snowboard, the woman is also holding a handbag, which is placed in front of her. The scene conveys a sense of excitement and anticipation for a snowboarding adventure."}
{"image_id": 228981, "caption": "The image features a table with three cell phones placed side by side. The first cell phone is on the left side of the table, the second one is in the middle, and the third one is on the right side. The cell phones vary in size, with one being larger than the other two.\n\nIn addition to the cell phones, there is also a camera placed on the table, positioned between the second and third cell phones. The presence of the camera suggests that the table might be used for photography or other multimedia purposes."}
{"image_id": 484301, "caption": "The image features a parking lot with a row of motorcycles parked next to each other. There are two motorcycles prominently visible, with one closer to the left side of the parking lot and the other near the right side. In addition to the motorcycles, there are several cars parked in the lot, including one on the left side, one in the middle, and two on the right side.\n\nA person can be seen standing near the middle of the parking lot, possibly admiring the motorcycles or attending to their own vehicle. The parking lot is situated in front of a building, providing a convenient location for people to park their vehicles."}
{"image_id": 509589, "caption": "The image captures a lively scene of a group of young people gathered around a skateboard ramp, with some of them riding skateboards. There are at least four skateboarders in the scene, with one of them actively riding a skateboard down the ramp.\n\nIn addition to the skateboarders, there are several people standing around the ramp, watching the action or waiting for their turn to ride. A couple of backpacks can be seen placed on the ground, possibly belonging to the skateboarders or spectators.\n\nThe overall atmosphere of the scene is energetic and fun, with everyone enjoying their time at the skateboard ramp."}
{"image_id": 15566, "caption": "The image depicts a busy city street with a traffic light hanging above the road. The traffic light is displaying a red light, signaling vehicles to stop. The street is surrounded by tall buildings, creating a bustling urban atmosphere.\n\nIn addition to the traffic light, there are several street signs visible in the scene, including a \"No Parking\" sign and a \"Southwest Blvd\" sign. A \"19th St\" sign can also be seen, indicating the location of the street.\n\nThere are a few cars on the street, with one car positioned closer to the left side of the image and another car further back on the right side. The presence of these vehicles, along with the traffic light and street signs, highlights the dynamic nature of city life."}
{"image_id": 448448, "caption": "In the image, there are two giraffes standing next to each other, eating leaves from a tree. The giraffes are positioned close to each other, with one giraffe on the left and the other on the right side of the tree. Both giraffes have their mouths close to the tree branches, enjoying the fresh leaves. The scene captures a peaceful moment of the giraffes interacting with their natural surroundings."}
{"image_id": 124930, "caption": "The image depicts a group of people gathered in a swimming pool, enjoying a meal and drinks together. There are at least 12 people in the pool, with some sitting on chairs and others standing. The chairs are placed around the pool area, and there are several cups and wine glasses scattered throughout the scene.\n\nIn addition to the cups and wine glasses, there are multiple bottles, likely containing beverages for the attendees. The atmosphere appears to be relaxed and social, with people engaging in conversation and enjoying their time in the pool."}
{"image_id": 191721, "caption": "In the image, a young girl is playing tennis on a court, holding a tennis racket in her hand. She is wearing a pink skirt and a striped shirt, and her hair is in a ponytail. The girl appears to be enjoying her time on the court, possibly practicing her tennis skills."}
{"image_id": 145199, "caption": "The image depicts a cozy kitchen with a dining table surrounded by chairs. The table is adorned with a tablecloth, and there are several wine glasses and bottles placed on it. A potted plant is hanging above the table, adding a touch of greenery to the space.\n\nThe kitchen is well-equipped with various appliances such as a refrigerator, oven, microwave, and toaster. A sink can also be seen in the kitchen area. The dining table is surrounded by chairs, making it an inviting space for meals and gatherings.\n\nIn addition to the main dining area, there is a bookshelf filled with books, adding a personal touch to the kitchen. The combination of the dining table, chairs, appliances, and decorative elements creates a warm and welcoming atmosphere in the kitchen."}
{"image_id": 307936, "caption": "In the image, there is a large elephant walking through a grassy field with trees in the background. The elephant is positioned towards the center of the scene, surrounded by tall grass. The field appears to be a mix of dried grass and green vegetation, providing a natural habitat for the elephant."}
{"image_id": 304159, "caption": "The image features a vintage suitcase placed on top of a wooden chest of drawers. The suitcase is green in color and appears to be old-fashioned. The chest of drawers is positioned underneath the suitcase, creating a visually appealing arrangement. The suitcase and chest of drawers are the main focus of the scene, evoking a sense of nostalgia and a connection to the past."}
{"image_id": 222559, "caption": "The image depicts a group of people walking along a sandy beach near the water. There are at least five people in the scene, some closer to the water and others further back on the beach. The group appears to be enjoying their time at the beach, possibly playing or exploring the area.\n\nIn the background, there are several boats of various sizes scattered across the water. Some boats are closer to the shore, while others are further out in the ocean. The combination of people and boats creates a lively and relaxing atmosphere at the beach."}
{"image_id": 442136, "caption": "The image features a man standing next to a red and black motorcycle with an American flag attached to the back. The man appears to be admiring the motorcycle, which is parked in a driveway. The motorcycle is prominently displayed in the foreground of the scene, capturing the viewer's attention."}
{"image_id": 38238, "caption": "The image features a kitchen scene with a refrigerator as the focal point. On the side of the refrigerator, there is a sticker of a character from the video game series \"The Legend of Zelda.\" The sticker captures the essence of the game and adds a fun element to the kitchen.\n\nIn addition to the refrigerator, there is a handbag placed on the countertop, and a knife can be seen nearby. The kitchen appears to be well-equipped for cooking and meal preparation."}
{"image_id": 107990, "caption": "In the image, a young boy is sitting on a motorcycle, holding the handlebars and enjoying his time on the bike. The motorcycle is parked on the street, and the boy appears to be the main focus of the scene.\n\nIn the background, there are two potted plants, one on the left side and another on the right side of the image, adding a touch of greenery to the scene. Additionally, there is a car parked further back on the right side of the image."}
{"image_id": 447328, "caption": "The image depicts a well-equipped kitchen with a stove top oven and a microwave above it. The stove has a pot and a bowl placed on it, indicating that it is being used for cooking or baking. The microwave is situated above the stove, providing easy access to both appliances.\n\nIn addition to the stove and microwave, the kitchen also features a sink and a dining table. The sink is located on the left side of the room, while the dining table is positioned on the right side. A chair can be seen near the dining table, ready for someone to sit and enjoy a meal.\n\nThere are also a few bottles placed around the kitchen, possibly containing cooking ingredients or beverages. Overall, the kitchen appears to be a functional and well-equipped space for cooking and dining."}
{"image_id": 358796, "caption": "The image depicts a cozy living room scene with a person sitting comfortably on a couch. In front of the person, there is a wooden dining table with various items on it. A TV is mounted on the wall, providing entertainment for the person relaxing on the couch.\n\nOn the dining table, there is a bowl, a cup, a spoon, and a book. The bowl is placed towards the left side of the table, while the cup and spoon are positioned closer to the center. The book is located near the right edge of the table. Additionally, there is a vase placed on the table, adding a decorative touch to the room."}
{"image_id": 521088, "caption": "The image depicts a man wearing a bandana around his head, holding a plate with two hot dogs on it. He appears to be enjoying his meal, possibly at a park or a similar outdoor location.\n\nIn the background, there are several other people present, some of whom are closer to the foreground and others further away. A bench can be seen in the middle of the scene, providing a place for people to sit and relax. Additionally, there is a car parked in the background, possibly belonging to one of the people in the area."}
{"image_id": 368349, "caption": "The image depicts a bathroom with a white toilet positioned under a window. Above the toilet, there are two towels hanging, one on the left side and the other on the right side. The towels are folded and neatly arranged.\n\nIn addition to the toilet, there is a sink located on the left side of the bathroom. Above the sink, there is a mirror that reflects the towels hanging above the toilet. The bathroom appears to be well-maintained and organized."}
{"image_id": 305781, "caption": "The image features a man wearing a hat, sitting at a desk with a laptop and a cell phone in front of him. He appears to be using the cell phone while working on the laptop. The desk is also equipped with a keyboard and a mouse.\n\nThere are several books scattered around the desk, suggesting that the man might be working on a project or researching information. In addition, a cup can be seen on the desk, possibly containing a beverage to help the man stay focused and energized during his work."}
{"image_id": 373748, "caption": "The image depicts a dimly lit bar with a large TV mounted on the wall above a refrigerator. The refrigerator is filled with numerous drinks, including several bottles and cups. The TV is turned on, displaying a map of the United States.\n\nIn addition to the TV and refrigerator, there is a dining table in the room, surrounded by several chairs. A bowl can also be seen on the table, possibly containing snacks or condiments. The bar appears to be a cozy and inviting space for patrons to relax and enjoy their drinks."}
{"image_id": 483135, "caption": "The image depicts a group of young people gathered in a living room, playing a video game on a Nintendo Wii console. There are at least five people in the scene, with some sitting on a couch and others standing or sitting on the floor. A total of three Wii remotes can be seen in the hands of the players.\n\nThe living room is furnished with a couch, a chair, and a dining table. The couch occupies the left side of the room, while the chair is placed near the center. The dining table is located on the right side of the room. The group appears to be enjoying their time together, engaging in friendly competition and laughter."}
{"image_id": 278395, "caption": "In the image, a man is skillfully paddling a surfboard on top of a large body of water. He is wearing a black shirt and appears to be enjoying his time on the water. The surfboard is positioned in the middle of the scene, and the man is actively maneuvering it through the water. The scene captures the excitement and challenge of surfing on a large body of water."}
{"image_id": 167781, "caption": "In the image, a man is standing next to an elephant, spraying it with a hose. The elephant is positioned on the left side of the scene, with the man standing on the right. The man appears to be washing the elephant, ensuring its cleanliness and well-being. The interaction between the man and the elephant creates a sense of connection and care for the animal."}
{"image_id": 145422, "caption": "The image captures a group of people skiing down a snow-covered slope. There are at least five skiers visible in the scene, with some of them wearing blue and white outfits. One of the skiers is wearing a blue and white outfit with the number 22 on it.\n\nThe skiers are positioned at various points on the slope, with some closer to the foreground and others further down the hill. The skiers appear to be enjoying their time on the snow-covered slope, possibly participating in a skiing competition or simply skiing for leisure."}
{"image_id": 197597, "caption": "The image features a white plate filled with a delicious meal consisting of meat, broccoli, and cauliflower. The meat appears to be chicken, and it is accompanied by a generous portion of both broccoli and cauliflower. The broccoli is spread across the plate, with some pieces near the center and others closer to the edges. The cauliflower is also distributed evenly across the plate, creating a visually appealing and appetizing dish. The plate is placed on a dining table, ready to be enjoyed."}
{"image_id": 283005, "caption": "The image depicts a sandy beach with a man and a woman standing next to a surfboard. The man is holding the surfboard, while the woman is standing close to him. They seem to be preparing for a surfing session or have just finished one.\n\nIn the background, there are several other people scattered across the beach, enjoying the sunny day and the ocean view. Additionally, there is a handbag placed on the sand, possibly belonging to one of the beachgoers. The scene captures the essence of a leisurely day at the beach, with people engaging in various activities."}
{"image_id": 498919, "caption": "The image showcases a vibrant display of fruits at a grocery store or market. There is a large assortment of pears, oranges, apples, and other fruits arranged in a visually appealing manner. The pears are scattered throughout the scene, with some in the foreground and others in the background. The oranges and apples are also abundant in the display, with several oranges and apples visible in various positions.\n\nIn addition to the fruits, there is a handbag placed in the scene, likely belonging to a customer browsing the fruit selection. The overall atmosphere of the image is fresh and inviting, highlighting the variety of fruits available for purchase."}
{"image_id": 366950, "caption": "The image features a herd of sheep gathered together in a field. There are at least nine sheep visible in the scene, with some standing closer to the foreground and others further in the background. A few of the sheep are standing near a wooden fence, while others are scattered throughout the field. The sheep appear to be looking at the camera, creating a sense of curiosity and interaction with the viewer."}
{"image_id": 334713, "caption": "In the image, a man is sitting on the ground next to a white horse with a saddle on its back. The horse appears to be carrying a significant amount of luggage on its back, including a backpack, a suitcase, and a handbag. The man seems to be admiring the horse and its impressive load.\n\nThe scene takes place in a grassy area with trees in the background, creating a peaceful and natural setting. The man and the horse are the main focus of the image, showcasing the bond between the two and the horse's ability to carry the weight of the luggage."}
{"image_id": 571215, "caption": "The image features a black and white graffiti mural of a person riding a skateboard. The skateboarder appears to be in motion, possibly performing a trick or simply enjoying the ride. The graffiti is located on the side of a cement wall, which adds to the urban atmosphere of the scene. The skateboarder's silhouette is prominently displayed, capturing the essence of skateboarding culture."}
{"image_id": 190395, "caption": "The image features a stainless steel refrigerator standing in the corner of the kitchen. The refrigerator is large and occupies a significant portion of the space, extending from the left side to the right side of the kitchen.\n\nIn addition to the refrigerator, there is a microwave placed on the countertop, slightly to the right of the refrigerator. The microwave is positioned at a higher level than the refrigerator, allowing for easy access while cooking or reheating food."}
{"image_id": 303603, "caption": "The image captures a beautiful scene of a small airplane flying over a large body of water, possibly the ocean. The airplane is flying at a relatively low altitude, creating a sense of excitement and adventure.\n\nBelow the airplane, there are several boats scattered across the water, adding to the lively atmosphere of the scene. Some of the boats are closer to the shore, while others are further out in the water.\n\nIn the foreground, a group of people can be seen observing the airplane and the boats, likely enjoying the view and the spectacle of the airplane flying so close to the water."}
{"image_id": 117645, "caption": "In the image, a person is standing in the middle of a snow-covered slope, surrounded by deep snow. The person appears to be snowboarding or preparing to snowboard, as they are wearing a snowboard on their feet. The snowboarder is positioned in the center of the scene, surrounded by a significant amount of snow.\n\nThe snow-covered slope stretches across the entire image, with the person being the main focal point. The scene captures the excitement and challenge of snowboarding on a snow-covered hill."}
{"image_id": 241758, "caption": "The image features a picturesque scene of two boats docked at a pier on a beautiful blue lagoon. The boats are positioned close to each other, creating a sense of harmony with their surroundings.\n\nIn addition to the boats, there are several people scattered throughout the scene, likely enjoying the serene environment or attending to their boats. Some of them are closer to the boats, while others are further away, taking in the view of the lagoon or engaging in other activities.\n\nThere are also a few chairs placed around the area, providing seating options for those who wish to relax and enjoy the view. Overall, the scene exudes a sense of tranquility and leisure, with the boats and people coexisting peacefully in this idyllic setting."}
{"image_id": 6397, "caption": "The image features a black suitcase with two cats sitting inside of it. The cats are positioned close to each other, with one cat on the left side and the other on the right side of the suitcase. Both cats appear to be sleeping or resting comfortably in the luggage.\n\nIn the background, there is a dining table with a laptop and a mouse placed on it. A chair can also be seen in the scene, positioned near the table."}
{"image_id": 37958, "caption": "The image features a close-up of an orange cut in half, revealing its juicy interior. The orange slices are placed on a table, with one slice on the left side and the other slice on the right side. The orange slices are arranged in a way that allows the viewer to see the orange's interior, showcasing its vibrant color and texture."}
{"image_id": 26200, "caption": "The image features a white vase filled with a variety of flowers, including red, yellow, and white ones. The vase is placed on a wooden shelf or table, adding a touch of natural beauty to the space. The flowers are arranged in such a way that they create an eye-catching centerpiece for the room. The vibrant colors of the flowers and the elegant white vase create a pleasant and inviting atmosphere."}
{"image_id": 25685, "caption": "The image features a red and white airplane, possibly a seaplane, flying low over a body of water. There are several people on the water, enjoying the view and the experience. Some of them are in a boat, while others are swimming or simply standing in the water. The airplane appears to be either taking off or landing, adding excitement to the scene.\n\nIn addition to the people and the airplane, there is a dog present in the water, possibly accompanying one of the individuals. Overall, the image captures a lively and adventurous moment shared by the people on the water and the seaplane flying overhead."}
{"image_id": 64439, "caption": "The image features a woman dressed in a blue shirt and gray shorts, holding a tennis racket and preparing to hit a tennis ball. She appears focused and ready to play. The tennis ball is in the air, close to her racket, and she is positioned on a tennis court."}
{"image_id": 118710, "caption": "The image depicts a blue and white city bus driving down a street. The bus is positioned in the middle of the road, and there are multiple traffic lights visible in the scene. One traffic light is located on the left side of the bus, another on the right side, and a third one further down the street.\n\nIn addition to the bus, there are a few other vehicles in the scene, including a car and a truck. The car is situated behind the bus, while the truck is located further down the street on the right side."}
{"image_id": 427094, "caption": "The image features a street corner with a street sign that reads \"Fell.\" The street sign is attached to a pole, and it is located in front of a green and white apartment building. The apartment building has many windows, some of which are open, allowing natural light to enter the space.\n\nIn addition to the street sign, there is a traffic light visible in the scene, ensuring the safety of pedestrians and vehicles in the area. The overall atmosphere of the image suggests a well-maintained and organized urban environment."}
{"image_id": 251508, "caption": "In the image, a woman wearing a green hat and a black hoodie is holding a yellow banana in her hand. She is smiling and appears to be enjoying the moment. The banana is positioned in the center of the scene, and the woman's face is prominently visible in the foreground."}
{"image_id": 411685, "caption": "In the image, a black cat is standing on the edge of a white toilet seat and appears to be drinking from the toilet bowl. The cat is positioned on the left side of the toilet, with its head inside the bowl. The scene takes place in a bathroom with a bathtub visible in the background."}
{"image_id": 305622, "caption": "The image depicts a group of people enjoying a sunny day on a sandy beach near the ocean. They are flying a yellow kite, which is soaring high in the sky. There are several people scattered across the beach, with some standing closer to the water and others further back.\n\nIn addition to the people and the kite, there are a few birds visible in the sky, adding to the lively atmosphere of the scene. A backpack can be seen placed on the sand, likely belonging to one of the beachgoers. Overall, the image captures a fun and relaxing day at the beach."}
{"image_id": 412455, "caption": "The image depicts a black and white scene of a city street with an old-fashioned car parked on the side of the road. A fire hydrant is located on the sidewalk near the car. There are several people walking on the sidewalk, with one person closer to the left side of the image and two others further down the sidewalk.\n\nIn addition to the car, there are a few other vehicles parked along the street, including a truck and a bus. A traffic light can be seen in the middle of the scene, and a potted plant is placed on the sidewalk near the right edge of the image. The overall atmosphere of the scene is reminiscent of a bygone era, with the old-fashioned car and the black and white photo adding to the nostalgic feel."}
{"image_id": 456756, "caption": "The image features a giraffe standing in an enclosure at a zoo. The giraffe is positioned in the center of the scene, with its long neck and legs prominently visible. Another giraffe can be seen in the background, slightly to the right of the main giraffe.\n\nIn addition to the giraffes, there are two zebras present in the scene. One zebra is located on the left side of the main giraffe, while the other zebra is on the right side, closer to the background. The enclosure appears to be well-maintained, providing a comfortable environment for the animals."}
{"image_id": 124832, "caption": "In the image, a man is skillfully riding a wave on a surfboard in the ocean. He is wearing a blue shirt and appears to be enjoying the thrill of surfing. The surfboard is positioned in the middle of the scene, with the man skillfully balancing on it as he navigates the wave. The scene captures the excitement and challenge of surfing, showcasing the surfer's talent and connection with the ocean."}
{"image_id": 268745, "caption": "The image depicts a train station with a blue and white train parked on the tracks. The train is filled with passengers, some sitting and others standing, as they wait for the train to come to a complete stop. In total, there are at least 13 people visible on the train.\n\nThere are also a few individuals standing near the train, possibly waiting to board or just observing the scene. A handbag can be seen placed on the ground, likely belonging to one of the passengers. Overall, the scene captures a typical day at a train station with people commuting and traveling."}
{"image_id": 476735, "caption": "The image captures a thrilling scene of a man water skiing behind a speed boat on a lake. The man is skillfully riding on water skis, holding onto a rope that is attached to the boat. The boat is positioned in the middle of the lake, pulling the skier through the water.\n\nIn addition to the main skier, there are two other people visible in the scene, likely enjoying the water sports activities or observing the action. The overall atmosphere of the image is energetic and exciting, showcasing the fun and adventure of water skiing."}
{"image_id": 140908, "caption": "The image depicts a lively scene at a park near a lake, with a group of people enjoying a sunny day outdoors. There are at least 13 people visible in the scene, some of them riding bicycles or walking along the sidewalk. A bench can be seen in the foreground, providing a place for people to sit and relax.\n\nTwo stuffed animals, a pink elephant and a gray elephant, are placed on the bench, adding a playful touch to the scene. A backpack is also visible on the ground near the bench, possibly belonging to one of the people in the park.\n\nIn the background, a city skyline can be seen, creating a picturesque contrast between the urban environment and the serene park setting."}
{"image_id": 234902, "caption": "In the image, a man wearing a suit and tie is standing in an elevator, holding up his cell phone to take a selfie. He appears to be focused on capturing the moment. The elevator is located in a building, and the man is the main subject of the scene."}
{"image_id": 342650, "caption": "In the image, a man is standing in a kitchen, preparing a pizza on a cutting board. He is using a knife to cut the pizza into slices. The kitchen is well-equipped, featuring a sink, an oven, a refrigerator, a microwave, and a few bottles placed around the area.\n\nAdditionally, there are a couple of bowls in the kitchen, one near the sink and the other closer to the refrigerator. The man appears to be focused on his task, creating a delicious homemade pizza."}
{"image_id": 476975, "caption": "The image depicts a herd of elephants in their natural habitat. There are three elephants visible in the scene, with one large elephant standing prominently in the foreground and two smaller elephants positioned behind it. The elephants are surrounded by a lush green forest filled with trees and bushes.\n\nThe elephants appear to be walking through the forest, possibly in search of food or exploring their surroundings. The scene captures the beauty and majesty of these magnificent creatures in their natural environment."}
{"image_id": 237920, "caption": "The image features a bench situated on a sidewalk in front of a building. The bench has a blue and yellow color scheme, making it stand out in the scene. There are two chairs nearby, one closer to the bench and the other further away. The bench is positioned between the two chairs, creating a cozy outdoor seating area.\n\nIn addition to the bench and chairs, there is a dining table located towards the right side of the scene. The overall setting appears to be a pleasant outdoor space for relaxation and socializing."}
{"image_id": 156609, "caption": "The image features a wooden desk with a large computer monitor prominently placed on it. The monitor is turned on, displaying a web page. Next to the monitor, there is a keyboard and a mouse, ready for use. A cell phone can be seen on the desk as well.\n\nIn the background, there is a bookshelf filled with various books, creating a cozy and organized workspace. The desk occupies a significant portion of the image, showcasing its size and the items placed on it."}
{"image_id": 303626, "caption": "The image depicts a woman standing in a small, cluttered kitchen. She is wearing glasses and appears to be leaning against the kitchen counter. The kitchen is equipped with a refrigerator, a microwave, and a sink.\n\nThere is a dining table in the room, with a chair positioned in front of it. On the table, there are two cell phones, a laptop, and a magazine. Additionally, there are a couple of bottles and a bowl placed around the kitchen, contributing to the cluttered appearance of the space."}
{"image_id": 161144, "caption": "In the image, a brown and white dog is standing in a grassy field, holding a frisbee in its mouth. The dog appears to be enjoying its time outdoors, possibly playing with the frisbee or preparing to throw it.\n\nThe field is surrounded by a fence, providing a secure environment for the dog to play. In the background, a car can be seen parked at a distance, possibly belonging to the dog's owner or someone visiting the area."}
{"image_id": 49091, "caption": "The image depicts a narrow alleyway in an Asian city, lined with tall buildings and numerous banners and signs. The signs are predominantly written in Chinese, creating a vibrant and bustling atmosphere. The alleyway is filled with a variety of signs, some of which are hanging from the buildings, while others are attached to the sides of the buildings.\n\nIn addition to the signs, there is a car parked on the left side of the alleyway, adding to the urban feel of the scene. The combination of the narrow alleyway, the tall buildings, and the multitude of signs creates a unique and lively urban environment."}
{"image_id": 108272, "caption": "The image depicts a busy city street with a crowd of people gathered on the sidewalk. Among the crowd, there is a woman holding a clipboard, possibly a reporter, and a police officer standing nearby. The police officer is wearing a yellow jacket and appears to be observing the situation.\n\nSeveral people in the crowd are carrying handbags and backpacks, with one person holding a backpack near the center of the scene. There is also a bicycle parked on the left side of the street.\n\nIn the background, a bus can be seen parked on the right side of the street, and a traffic light is visible further down the road. Overall, the scene captures the hustle and bustle of city life."}
{"image_id": 24040, "caption": "The image depicts a group of three skiers racing down a snow-covered slope. They are wearing blue and white uniforms, and each skier is holding ski poles in their hands. The skiers are in close proximity to one another, showcasing their competitive spirit.\n\nThe skiers are positioned at different points on the slope, with the first skier on the left side, the second skier in the middle, and the third skier on the right side. Their skis are visible as they glide down the hill, creating a sense of motion and excitement in the scene."}
{"image_id": 70158, "caption": "The image features a group of four zebras walking together on a dirt ground. They are arranged in a line, with the first zebra on the left, the second zebra in the middle, and the third and fourth zebras on the right side. The zebras appear to be in a natural habitat, possibly a zoo or wildlife reserve."}
{"image_id": 322724, "caption": "The image captures a snowy mountain scene with a woman wearing a bright orange jacket and blue pants standing on skis. She appears to be enjoying her time on the snow-covered slope. Another person can be seen in the background, also wearing skis.\n\nThere are several trees scattered throughout the scene, adding to the wintery atmosphere. The skis of the woman in the foreground are prominently visible, as well as the skis of the person in the background. The overall scene conveys a sense of adventure and outdoor fun during the winter season."}
{"image_id": 134001, "caption": "The image features a street corner with a pole displaying several street signs. The signs are pointing in different directions, providing guidance to pedestrians and drivers. Above the street signs, there is a traffic light, ensuring the safe flow of traffic in the area. \n\nIn the background, a building can be seen, adding to the urban atmosphere of the scene. There is also a person standing near the street corner, possibly waiting to cross the street or just passing by."}
{"image_id": 465537, "caption": "The image features a red car parked next to a parking meter on the side of the street. The parking meter is located near the center of the scene, with the car parked in front of it. The car appears to be a compact vehicle, possibly a hatchback.\n\nIn addition to the car and parking meter, there are a few other objects in the scene. A handbag can be seen placed on the ground near the car, and a traffic light is visible in the background. There is also a truck parked further down the street on the right side."}
{"image_id": 324040, "caption": "The image features an elephant standing in a body of water, possibly a river or a lake. The elephant appears to be enjoying its time in the water, with its trunk partially submerged. There are several other elephants in the scene, some of which are also partially submerged in the water.\n\nIn addition to the elephants, there are two people in the scene. One person is standing near the left side of the elephant in the water, while the other person is located on the right side of the elephant. Both individuals seem to be observing or interacting with the elephants in the water."}
{"image_id": 5388, "caption": "The image captures a baseball game in progress on a field. There are several players on the field, with one player holding a baseball bat and another player wearing a baseball glove. The players are spread out across the field, some closer to the foreground and others further in the background.\n\nIn addition to the players, there is a crowd of spectators watching the game from various positions around the field. Some spectators are closer to the action, while others are further away. The scene is lively and filled with anticipation as the players engage in the game."}
{"image_id": 132415, "caption": "The image features a delicious slice of pizza on a white paper plate. The pizza appears to be a pepperoni and sausage pizza, with a generous amount of toppings. A fork is placed on the plate, ready to be used to enjoy the scrumptious meal.\n\nIn the background, there is a computer mouse and a keyboard, suggesting that the scene takes place in a workspace or a home office."}
{"image_id": 210766, "caption": "The image features a red and white sign attached to a pole, which reads \"Like a Brick Fitschen.\" The sign is placed in front of a brick building, adding a touch of humor to the urban setting. The weather appears to be snowy, as there are snowflakes visible in the scene."}
{"image_id": 214703, "caption": "The image captures a serene scene of two people swimming in the ocean. Both individuals are wearing black wetsuits, and they are lying on their stomachs in the water. They appear to be enjoying their time in the ocean, possibly surfing or simply relaxing.\n\nThe water is calm, and the sky can be seen in the background, adding to the tranquil atmosphere of the scene. The two swimmers are positioned relatively close to each other, creating a sense of companionship and shared enjoyment of the ocean."}
{"image_id": 324253, "caption": "The image depicts a bathroom with a white bathtub and a white pedestal sink. The bathtub is located on the left side of the room, while the sink is situated on the right side. The sink is accompanied by a mirror above it, which reflects the light in the bathroom.\n\nIn addition to the sink, there are two toothbrushes placed nearby, one closer to the sink and the other further away. The bathroom also features a towel rack with a towel hanging on it. The overall appearance of the bathroom is clean and well-maintained."}
{"image_id": 304012, "caption": "The image features a city street with a yellow sign attached to a pole. The sign is written in a foreign language and appears to be a parking or traffic regulation sign. The street is lined with buildings on both sides, creating an urban atmosphere.\n\nIn addition to the sign, there is a truck parked on the left side of the street, and a car can be seen further down the street on the right side. The scene captures the essence of a bustling city street with various modes of transportation."}
{"image_id": 25717, "caption": "The image depicts a cozy, old-fashioned bedroom with antique furniture and a fireplace. The bed is positioned in the center of the room, and a small doll can be seen lying on it, giving the room a charming and nostalgic atmosphere.\n\nThere are several vases placed around the room, with one on the left side, one on the right side, and one near the top of the bed. Additionally, there are two wine glasses, one on the left side and another on the right side of the room, adding to the vintage ambiance. A chair is also present in the room, located near the left side.\n\nIn the background, there is a painting on the wall, further enhancing the room's old-fashioned aesthetic. Overall, the room exudes a sense of warmth and comfort, reminiscent of a bygone era."}
{"image_id": 235006, "caption": "The image features an old, vintage truck parked in a dirt lot, surrounded by trees. The truck appears rusty and weathered, indicating its age and exposure to the elements. The truck is positioned in the middle of the scene, with trees on both sides.\n\nIn addition to the main truck, there are two smaller trucks visible in the background. One truck is located towards the left side of the image, while the other is on the far right side. The presence of these trucks adds to the overall rustic atmosphere of the scene."}
{"image_id": 89603, "caption": "The image features a spooky scene with a large number of pumpkins arranged on a shelf. There are at least 14 pumpkins of various sizes, with some placed closer to the front and others towards the back of the shelf. The pumpkins are arranged in a way that creates a sense of depth and creates an eerie atmosphere.\n\nIn addition to the pumpkins, there is a spooky decoration, possibly a witch or a skeleton, hanging on the wall above the pumpkins. The combination of the pumpkins and the spooky decoration creates a unique and intriguing display."}
{"image_id": 68852, "caption": "The image features a blue car with a yellow surfboard strapped to its roof. The car is parked on a street, and the surfboard is prominently displayed on top of the vehicle. The car appears to be an older model, possibly a Volkswagen Beetle.\n\nIn the background, another car can be seen parked further down the street. Additionally, there is a person standing near the top left corner of the image."}
{"image_id": 457178, "caption": "The image is a black and white photograph of a busy city street filled with horse-drawn carriages. There are numerous horses and carriages scattered throughout the scene, with some closer to the foreground and others further in the background.\n\nSeveral horse-drawn carriages can be seen on the left side of the street, while others are positioned closer to the center and right side of the street. A few people are visible in the scene, with one person standing near the left side of the street, another in the middle, and a third person on the right side.\n\nThe street appears to be bustling with activity, capturing the essence of a bygone era when horse-drawn carriages were a common mode of transportation in the city."}
{"image_id": 357322, "caption": "In the image, a woman is laying down on a wicker chair, surrounded by a group of adorable golden retriever puppies. She appears to be enjoying the company of the puppies as they snuggle up to her. The puppies are positioned all around her, with some close to her head and others near her feet. The scene is warm and inviting, showcasing the bond between the woman and the puppies."}
{"image_id": 439657, "caption": "The image features an airport scene with three airplanes parked on the tarmac. The airplanes are positioned in a row, with one airplane on the left side, another in the middle, and the third on the right side. The airplanes have the letters \"A\" and \"A\" on their tails, indicating that they belong to the same airline.\n\nIn addition to the airplanes, there are two cars visible in the scene. One car is located near the right side of the image, while the other car is situated closer to the center. The presence of these vehicles suggests that the airplanes are being serviced or prepared for their next flights."}
{"image_id": 196924, "caption": "The image depicts a cluttered room filled with various pieces of furniture, including chairs, a couch, a dining table, and a mirror. The room appears to be a storage area, possibly a garage or a warehouse.\n\nThere are three chairs in the room, with one placed near the left side, another in the middle, and the third on the right side. The dining table is located in the middle of the room, surrounded by chairs. A couch can be seen on the right side of the room.\n\nIn addition to the furniture, there are several items scattered throughout the room, such as a clock, a vase, and a bowl. A cup is also visible on the dining table. The overall atmosphere of the room is cluttered and somewhat disorganized."}
{"image_id": 527440, "caption": "In the image, a man is sitting on a green tractor in a field, surrounded by hay. He appears to be enjoying the outdoors and possibly taking a break from farming. There are several cows in the background, some of which are closer to the man and others further away. The cows are dispersed throughout the field, creating a peaceful and rural atmosphere. The man's presence on the tractor and the cows in the background suggest a connection to agriculture and a sense of tranquility in the countryside."}
{"image_id": 59952, "caption": "The image features a man wearing glasses, a white shirt, and a green and black striped tie. He is standing in a room with a white wall behind him. The man appears to be looking directly at the camera, capturing the viewer's attention."}
{"image_id": 306582, "caption": "The image depicts a group of cows standing in a grassy field. There are four cows in total, with one on the left side, one in the middle, and two on the right side. The cows are positioned close to each other, creating a sense of togetherness.\n\nIn the background, there is a line of clothes hanging on a wooden structure, possibly a clothesline or a makeshift drying rack. The clothes are arranged in a neat row, adding a touch of organization to the scene. The combination of the cows and the clothes creates a peaceful, rural atmosphere."}
{"image_id": 424002, "caption": "In the image, two men are standing on a rocky hill, each wearing a backpack. They appear to be hikers, enjoying their time outdoors with their dogs. There are a total of three dogs in the scene, with one dog standing close to the left man and the other two dogs standing near the right man.\n\nThe two men are positioned in the center of the image, while the dogs are spread out around them. One of the men is wearing a red jacket, adding a pop of color to the scene. Overall, the image captures a moment of adventure and camaraderie between the hikers and their canine companions."}
{"image_id": 329375, "caption": "In the image, there are two black goats standing in a grassy field. One of the goats is wearing a red ribbon around its neck, making it stand out from the other goat. The goats appear to be grazers, enjoying the lush green grass in their surroundings. The scene captures the essence of a peaceful, natural environment where these animals can thrive."}
{"image_id": 38858, "caption": "The image captures a heartwarming moment between a man and a woman, likely a bride and groom, as they exchange vows during their wedding ceremony. The couple is standing close to each other, with the bride on the left and the groom on the right. They are both dressed in formal attire, with the bride wearing a dress and the groom in a suit.\n\nIn the background, there are several potted plants placed around the area, adding a touch of greenery to the scene. The couple appears to be enjoying their special day, surrounded by the love and support of their friends and family."}
{"image_id": 179273, "caption": "The image features a delicious meal served on a plate, consisting of a combination of meat, vegetables, and cheese. There are several pieces of broccoli scattered throughout the dish, adding a healthy touch to the meal. A slice of pizza can also be seen on the plate, contributing to the variety of flavors and textures.\n\nIn addition to the main dish, there are a couple of sandwiches placed on the plate, one on the left side and another on the right side. A bowl is also present in the scene, possibly containing a side dish or additional ingredients for the meal. Overall, the meal appears to be a hearty and appetizing feast."}
{"image_id": 182734, "caption": "In the image, a person is riding a blue motor scooter or moped on a paved surface, possibly a playground or a parking lot. The person is wearing a helmet and appears to be enjoying their ride. The motor scooter is positioned towards the center of the scene, with the rider sitting comfortably on it."}
{"image_id": 492284, "caption": "In the image, a woman is standing next to a rock wall, petting a black cat that is sitting on top of the wall. The woman is wearing a backpack, which is placed on the ground near her. The scene appears to be set in a rural or countryside area, with the woman and the cat enjoying each other's company."}
{"image_id": 224368, "caption": "In the image, a man is skiing down a snow-covered slope, wearing skis and holding ski poles. He appears to be enjoying his time on the snow-covered hill. The scene is set in a wooded area, with trees surrounding the slope. The man is the main focus of the image, showcasing his skiing skills as he glides down the hill."}
{"image_id": 560235, "caption": "The image features a street corner with a traffic light and a street sign. The street sign is green and reads \"Castro.\" The traffic light is red, indicating that vehicles must stop at the intersection.\n\nIn the background, there are two palm trees, one on the left side and the other on the right side of the scene. Additionally, there is a bus parked on the right side of the street, possibly waiting for passengers to board or disembark."}
{"image_id": 327352, "caption": "The image features a train station with two trains parked side by side on the tracks. The trains are of different colors, with one being green and the other being red. Both trains have their doors open, allowing passengers to board or disembark.\n\nThere are several people visible in the scene, some of them standing near the trains, possibly waiting to board or having just disembarked from the trains. One person can be seen closer to the left side of the red train, while two others are near the right side of the green train. Additionally, there is a person standing near the middle of the scene, possibly waiting for their train or just observing the surroundings."}
{"image_id": 259683, "caption": "The image is a black and white photo of a city street at night, featuring a horse-drawn carriage traveling down the wet street. The carriage is positioned in the center of the scene, with the horse and carriage driver visible.\n\nThere are several people on the street, with one person holding an umbrella near the right side of the image. Other individuals can be seen walking or standing along the sidewalk, adding to the bustling atmosphere of the city at night.\n\nIn addition to the horse-drawn carriage, there is a car parked on the right side of the street, and a traffic light can be spotted further down the road. The overall scene captures the essence of a lively city street at night, with a mix of traditional and modern modes of transportation."}
{"image_id": 203350, "caption": "In the image, there are two young children sitting in a stroller. One of the children is holding a stuffed animal, possibly a teddy bear, while the other child is looking at the stuffed toy. The stroller is positioned in the center of the scene, with the children seated comfortably.\n\nThere are several other stuffed animals in the image, including a teddy bear located near the left side of the stroller and another teddy bear on the right side. Additionally, there are two more teddy bears in the background, one near the top left corner and the other near the top right corner of the image."}
{"image_id": 344013, "caption": "The image captures a tennis match in progress on a clay court. A man wearing a red shirt and white shorts is holding a tennis racket, preparing to hit a tennis ball that is in the air. He appears to be the main focus of the scene.\n\nIn the background, there are several people watching the match. Some of them are standing closer to the court, while others are further away. A chair can also be seen near the edge of the court, possibly for the players to rest during breaks. Overall, the scene depicts an active and engaging tennis match."}
{"image_id": 306103, "caption": "The image depicts a herd of elephants walking across a dry grass field. There are a total of nine elephants in the scene, with some of them positioned closer to the foreground and others further in the background. The elephants are spread out across the field, creating a sense of depth in the scene.\n\nIn addition to the elephants, there is a tree visible in the background, adding to the natural setting of the scene. The elephants appear to be moving together as a group, possibly in search of food or water, or simply enjoying each other's company."}
{"image_id": 511241, "caption": "The image features a wooden dining table filled with a variety of food and drinks. There are several plates of food, including rice, beans, carrots, and broccoli, as well as a bowl of soup. In addition to the main dishes, there are multiple cups and bowls containing beverages and sauces.\n\nThe table is set with a variety of utensils, such as forks, knives, and spoons, which are placed around the plates and bowls. There are also a couple of bottles on the table, possibly containing beverages or condiments.\n\nThe dining table is surrounded by chairs, with one chair on the left side and another on the right side of the table. The scene appears to be a casually set meal, ready for people to enjoy."}
{"image_id": 114634, "caption": "The image captures a beautiful scene of a person flying a kite on a sandy hill. The kite is soaring high in the sky, creating a sense of freedom and enjoyment. The person flying the kite stands on the sandy hill, controlling the kite as it catches the wind.\n\nIn the background, another person can be seen, possibly observing the kite flying or waiting for their turn to join in the fun. The overall atmosphere of the scene is one of leisure and outdoor recreation, showcasing the joy of flying a kite on a sunny day."}
{"image_id": 230190, "caption": "The image features a desk with a keyboard and a remote control placed on it. The desk is positioned under a window, allowing natural light to illuminate the workspace. A chair is situated next to the desk, ready for someone to sit and use the computer.\n\nIn addition to the keyboard and remote, there is a mouse on the desk, and a cell phone can be seen resting nearby. The scene appears to be a comfortable and functional workspace, perfect for productivity and relaxation."}
{"image_id": 561578, "caption": "The image features a tall brick clock tower with two clocks on its sides. The clocks are positioned near the top of the tower, making them easily visible from a distance. The tower stands prominently in the middle of a courtyard, drawing attention to its architectural beauty.\n\nIn addition to the clock tower, there is a bench located in the foreground, providing a place for people to sit and enjoy the surroundings. A car can be seen in the background, parked near the edge of the courtyard. The combination of the clock tower, the bench, and the car creates a pleasant and inviting atmosphere in the courtyard."}
{"image_id": 449190, "caption": "The image features a dining table with a variety of food items on it. A large burrito is prominently placed on the table, accompanied by a bowl of chips and a bowl of vegetables. The vegetables in the bowl include carrots and peppers, adding a colorful touch to the meal.\n\nIn addition to the main dishes, there are a couple of sandwiches on the table, one closer to the burrito and the other further away. The table setting also includes a spoon and a fork, which are likely used for enjoying the meal. Overall, the scene depicts a delicious and appetizing meal."}
{"image_id": 445371, "caption": "The image features a brown dog sitting on a brick sidewalk next to a wooden bench. The dog appears to be on a leash, possibly waiting for its owner to return. The bench is positioned on the sidewalk, providing a place for people to sit and relax.\n\nIn the background, there are several cars parked along the street, with one car closer to the left side of the image and others further away. A fire hydrant can also be seen on the sidewalk, adding to the urban setting of the scene."}
{"image_id": 499480, "caption": "The image depicts a small kitchen with a white refrigerator and a white microwave placed above it. The refrigerator is located on the left side of the kitchen, while the microwave is positioned above the sink on the right side. The sink is situated in the middle of the kitchen.\n\nIn addition to the main appliances, there is a towel placed on the countertop near the sink. The kitchen appears to be clean and well-organized, making it an inviting space for meal preparation."}
{"image_id": 100306, "caption": "The image depicts a snowy landscape with a man wearing an orange jacket skiing down a snow-covered slope. He is holding ski poles and appears to be enjoying his time on the mountain. The scene is set against a backdrop of trees, creating a picturesque winter scene. The man is the main focus of the image, showcasing his skiing adventure in the snowy environment."}
{"image_id": 292118, "caption": "The image depicts a man standing on a sidewalk next to a parking meter. He is wearing a jacket with the words \"Parking Meter Repair\" written on the back. The man appears to be checking the parking meter, possibly ensuring it is functioning correctly.\n\nThere are several cars parked along the street, with one car on the left side of the man, another on the right side, and a third car further down the street. Additionally, there is a truck parked near the middle of the scene.\n\nAnother person can be seen in the background, standing near the left edge of the image. A handbag is placed on the ground near the center of the scene, possibly belonging to one of the people in the area."}
{"image_id": 368088, "caption": "The image features a beautiful beach scene with a group of horses standing on the sand. There are nine horses in total, with some closer to the water and others further back on the beach. The horses appear to be enjoying their time near the ocean, possibly taking a break from their daily activities. The scene is serene and picturesque, showcasing the natural beauty of the beach and the horses."}
{"image_id": 415990, "caption": "The image depicts a man standing in a lush green field, surrounded by a large herd of brown cows. The man appears to be tending to the cows, possibly checking on their well-being. The cows are dispersed throughout the field, with some closer to the man and others further away.\n\nIn total, there are 14 cows visible, varying in size and distance from the man. The scene conveys a sense of tranquility and connection between the man and the cows in their natural environment."}
{"image_id": 411368, "caption": "The image features a wooden block with three pairs of black scissors attached to it. Each pair of scissors has red handles, making them easily identifiable and accessible. The wooden block is placed on a dining table, providing a convenient and organized storage solution for the scissors."}
{"image_id": 16257, "caption": "The image features a young boy brushing his teeth with a toothbrush. He is wearing a striped shirt and appears to be focused on the task at hand. The scene takes place in a bathroom, with a sink visible in the background."}
{"image_id": 275120, "caption": "The image features a beautifully decorated birthday cake placed on a dining table. The cake is adorned with frosting and blue candles, making it an eye-catching centerpiece for the celebration. A bottle of whiskey can be seen next to the cake, adding to the festive atmosphere.\n\nIn addition to the cake and whiskey, there is a knife on the table, likely to be used for cutting and serving the cake. The overall scene conveys a warm and inviting ambiance, perfect for a birthday celebration."}
{"image_id": 94033, "caption": "The image depicts a lush green field with a yellow frisbee golf disc golf goal, also known as a frisbee golf basket, situated in the middle of the field. Several trees surround the field, creating a serene and natural environment.\n\nIn addition to the frisbee golf goal, there are two frisbees visible in the scene. One frisbee is located closer to the left side of the field, while the other frisbee is near the right side of the field. The presence of these frisbees suggests that people are enjoying a game of frisbee golf in this picturesque setting."}
{"image_id": 555622, "caption": "The image depicts a busy street scene with numerous people and bicycles. A man wearing a tie-dye shirt is standing next to a bicycle, possibly preparing to ride it. There are several other bicycles in the scene, some parked and others being ridden by people.\n\nIn addition to the people and bicycles, there is a car parked on the side of the street. A backpack can also be seen on the ground, possibly belonging to one of the people in the scene. The overall atmosphere is lively and bustling, with people engaging in various activities."}
{"image_id": 462376, "caption": "The image features a group of six young men standing together, posing for a picture. They are all smiling and appear to be enjoying their time together. One of the men is holding a yellow frisbee, adding a playful element to the scene.\n\nIn the background, there is a dining table with a couple of backpacks placed on it. Additionally, there is a chair positioned near the table. The group seems to be having a good time, possibly engaging in a friendly game of frisbee or simply hanging out together."}
{"image_id": 371245, "caption": "The image features a zebra standing on a dirt road, grazing on grass. The zebra is the main focus of the scene, with its distinctive black and white stripes clearly visible. The zebra appears to be in a natural environment, surrounded by trees and greenery.\n\nIn the background, there is a truck parked, possibly indicating that the zebra is in a protected area or a wildlife reserve. The presence of the truck and the zebra's peaceful grazing suggest that the area is well-maintained and suitable for the zebra's well-being."}
{"image_id": 120478, "caption": "The image depicts a highway with a street sign indicating the direction to Boston, Albany, and the third left. The sign is positioned above the road, providing guidance to drivers. The highway is surrounded by trees, creating a scenic atmosphere.\n\nThere are several traffic lights along the highway, ensuring the safe flow of traffic. Two traffic lights can be seen on the left side of the road, one closer to the center and another further back. On the right side of the road, there are three traffic lights, with one closer to the center and the other two further back.\n\nThe highway appears to be relatively empty, with no visible cars or pedestrians at the moment."}
{"image_id": 288399, "caption": "The image captures a brown dog in mid-air after jumping off the ground. The dog is flying through the air with its front paws raised, showcasing its athleticism and agility.\n\nThere are trees in the background, providing a natural outdoor setting for the scene. Additionally, there is a person visible in the background, likely observing the dog's impressive leap. The dog's enthusiasm and energy are evident as it soars through the air, creating an exciting and lively atmosphere in the image."}
{"image_id": 35062, "caption": "The image features a bed with a blue and white comforter on it. The comforter is adorned with a pattern of yellow daisies, creating a visually appealing and cozy atmosphere. The bed appears to be unmade, with the sheets and blanket slightly rumpled.\n\nA dog can be seen lying on the bed, partially covered by the comforter. The dog is positioned near the center of the bed, adding a sense of warmth and companionship to the scene."}
{"image_id": 510798, "caption": "The image captures an exciting moment during a baseball game. A baseball player is in the middle of swinging his bat, attempting to hit the ball. The catcher is positioned nearby, ready to catch the ball if the batter misses.\n\nThere are several other players on the field, with some standing closer to the batter and others further away. A baseball glove can be seen in the scene, likely belonging to one of the players.\n\nIn the background, a bench is visible, likely for players to sit on when they are not actively participating in the game. Overall, the scene is full of action and anticipation as the players await the outcome of the batter's swing."}
{"image_id": 500200, "caption": "The image features a kitchen counter with a variety of vases filled with colorful flowers. There are six vases in total, each containing different types of flowers, creating a beautiful and vibrant display.\n\nIn addition to the vases of flowers, there are several kitchen utensils and appliances on the counter. Two knives can be seen, one closer to the left side of the counter and the other near the center. A spoon is also present, positioned towards the left side of the counter.\n\nA potted plant is situated on the right side of the counter, adding a touch of greenery to the scene. The overall atmosphere of the kitchen is lively and inviting, thanks to the combination of the colorful flowers and the well-organized arrangement of kitchen utensils and appliances."}
{"image_id": 525665, "caption": "The image depicts a sandy beach with a herd of cows grazing and resting on the shore. There are a total of six cows in the scene, with some standing and others lying down. The cows are spread out across the beach, with some closer to the water and others further inland. The sky above the beach is cloudy, adding a dramatic backdrop to the scene. The combination of the cows, the sandy beach, and the cloudy sky creates a picturesque and serene atmosphere."}
{"image_id": 2521, "caption": "The image features a street corner with a one-way sign prominently displayed on a pole. Above the sign, there is a drawing of a person pointing to the right, possibly indicating the direction of the one-way street.\n\nThe scene also includes a bench located on the right side of the image, providing a place for pedestrians to rest. In the background, there are several cars parked or passing by, adding to the urban atmosphere of the scene."}
{"image_id": 56567, "caption": "The image features a dining table with a white plate topped with a delicious meal consisting of pasta, meat, and cheese. There are two pizzas on the table, one placed closer to the left side and the other near the center. A bowl of pasta is also present on the table, adding to the variety of dishes.\n\nSeveral chairs are positioned around the dining table, with one chair on the left side, another on the right side, and two chairs at the head and foot of the table. Additionally, there are two cups on the table, one near the center and the other towards the right side. A bottle can also be seen on the table, likely containing a beverage to accompany the meal."}
{"image_id": 241602, "caption": "The image depicts a small bathroom with a white toilet positioned on the left side of the room. The bathroom is decorated with colorful flowers painted on the walls, adding a touch of vibrancy to the space. There is also a sink located on the right side of the room, with a mirror above it.\n\nIn addition to the toilet and sink, the bathroom contains a few other items. There is a vase placed near the toilet, and a bottle can be seen on the right side of the room. A potted plant is also present, adding a touch of greenery to the space. Overall, the bathroom appears to be well-maintained and inviting."}
{"image_id": 114579, "caption": "In the image, a woman is skiing down a snow-covered slope, wearing skis and holding ski poles. She appears to be focused on her skiing, possibly participating in a cross-country skiing event. The woman is the main subject of the scene, with her skis and poles clearly visible.\n\nIn the background, there is a large brown bear, seemingly watching the woman ski. The bear is positioned on the right side of the image, capturing the viewer's attention. The combination of the woman skiing and the bear in the background creates a unique and interesting scene."}
{"image_id": 149780, "caption": "The image features a man in a green striped shirt standing in a bathroom, adjusting the seat of a toilet. The toilet is located on the left side of the room, while the man is positioned on the right side. Another toilet can be seen in the background, slightly to the right of the main toilet. The man appears to be in the process of fixing the toilet seat, ensuring its proper functioning."}
{"image_id": 320203, "caption": "The image features a stop sign with two street signs attached to it, indicating the intersection of Riverbass Lane and Saw Point Drive. The stop sign is positioned on the left side of the image, while the two street signs are placed above it.\n\nIn the background, there are trees visible, adding a touch of nature to the scene. The combination of the stop sign, street signs, and trees creates a sense of order and organization in the urban environment."}
{"image_id": 434204, "caption": "The image depicts a young man skillfully riding a skateboard down a sidewalk. He appears to be enjoying his time as he maneuvers the skateboard, possibly performing a trick.\n\nThere are several other people in the scene, with one person standing close to the skateboarder on the left side of the sidewalk, and two more people further away on the right side. A bench can be seen near the center of the sidewalk, providing a place for pedestrians to sit and relax.\n\nAdditionally, there are a couple of bottles placed on the ground, possibly belonging to the skateboarder or other people in the area."}
{"image_id": 301766, "caption": "The image captures a thrilling moment of a skier performing a jump off a snow-covered hill. The skier is in mid-air, showcasing their skill and athleticism. The skier is wearing a brown jacket, which adds a touch of color to the scene.\n\nThere are two sets of skis visible in the image, one belonging to the skier performing the jump and the other set located further down the slope. The skis are positioned in such a way that they appear to be flying through the air alongside the skier. The scene is a testament to the excitement and adrenaline rush associated with skiing and jumping off snow-covered hills."}
{"image_id": 75719, "caption": "The image features a small green parrot standing on a carpeted floor. The parrot appears to be looking at something, possibly a person taking a picture of it. Another person can be seen in the background, taking a picture of the parrot with a cell phone.\n\nThere are two birds in the scene, one being the green parrot and the other being a toy bird. The toy bird is positioned on the left side of the image, while the green parrot is on the right side. The carpeted floor and the presence of the toy bird create a playful atmosphere in the scene."}
{"image_id": 326081, "caption": "In the image, a black and white dog is lying on the ground, seemingly exhausted after playing with a frisbee. The frisbee is located near the dog's head, close to its mouth, indicating that the dog has just finished playing with it. The dog appears to be enjoying its time outdoors, possibly in a sandy or dirt area."}
{"image_id": 360064, "caption": "The image features a vintage blue pickup truck parked on a grassy field. The truck is the main focus of the scene, and it appears to be an older model, possibly from the 1950s. The truck is parked next to a car, which is also visible in the background.\n\nIn addition to the vehicles, there are several people scattered throughout the scene, possibly attending an outdoor event or gathering. Some of them are standing closer to the truck, while others are further away, enjoying the outdoor atmosphere."}
{"image_id": 349896, "caption": "The image depicts a herd of elephants walking across a lush green field on a sunny day. There are four elephants in total, with one on the left side, two in the middle, and one on the right side of the field. The elephants appear to be enjoying their time in the open field, possibly grazing or exploring their surroundings. The sky above them is filled with clouds, adding to the serene atmosphere of the scene."}
{"image_id": 20777, "caption": "The scene features two red fire trucks parked in front of a building. One of the fire trucks is positioned closer to the left side of the image, while the other is on the right side. Both fire trucks have their ladders extended, indicating that they are likely responding to an emergency situation.\n\nThere are several people around the fire trucks, possibly firefighters or bystanders. One person is standing near the left fire truck, while two others are closer to the right fire truck. Additionally, there is another person standing further away from the trucks, closer to the building."}
{"image_id": 75932, "caption": "The image depicts a large white and red boat filled with people enjoying their time on the water. There are at least 14 people visible on the boat, with some standing closer to the front and others scattered throughout the vessel. The boat appears to be a ferry or a cruise ship, as it is carrying a significant number of passengers.\n\nIn the background, a bird can be seen flying above the water, adding to the lively atmosphere of the scene. The boat is floating on a body of water, possibly the ocean, as it carries its passengers to their destination or on a leisurely cruise."}
{"image_id": 33815, "caption": "In the image, a man is riding a motorcycle down a street, drawing the attention of several onlookers. The motorcycle is positioned in the center of the scene, with the rider skillfully maneuvering it.\n\nThere are several people standing on the sidewalk, watching the man on the motorcycle. Some of them are closer to the motorcycle, while others are further away. A few chairs can be seen placed on the sidewalk, possibly for people to sit and enjoy the event.\n\nAdditionally, there are a couple of handbags visible in the scene, likely belonging to some of the onlookers. Overall, the atmosphere appears to be lively and engaging as the man on the motorcycle captures the attention of the crowd."}
{"image_id": 327961, "caption": "The image depicts a group of people traveling on horseback through a mountainous area. There are at least nine people visible in the scene, some riding horses and others walking alongside them. The horses are carrying a substantial amount of luggage, including backpacks and saddlebags.\n\nIn total, there are at least 13 backpacks and saddlebags visible in the scene, indicating that the travelers are well-prepared for their journey. The horses and their riders are spread out across the scene, with some closer to the foreground and others further in the background. The overall atmosphere suggests a sense of adventure and camaraderie among the group as they traverse the challenging terrain."}
{"image_id": 72315, "caption": "The image depicts a group of people gathered in a room, working on their laptops. There are at least 12 people in the scene, with some sitting and others standing. They are all focused on their laptops, which are spread across the room.\n\nThere are a total of six laptops in the scene, with some placed on tables and others on people's laps. In addition to the laptops, there are two keyboards visible in the room, one near the center and another towards the right side.\n\nThe room appears to be a workspace or a collaborative environment, with people engaged in various tasks on their laptops."}
{"image_id": 333321, "caption": "The image depicts a train station with a train on the tracks. There is a sign on a pole near the tracks, possibly providing directions or information about the train station. The train is positioned in the middle of the scene, and the station appears to be empty at the moment.\n\nAdditionally, there are two benches visible in the image, one located closer to the left side of the scene and the other further to the right. The presence of these benches suggests that the train station is designed for passengers to sit and wait for their trains."}
{"image_id": 387375, "caption": "The image features a group of five people sitting in a ski lift, enjoying their time on the mountain. They are all wearing appropriate ski gear, including skis and snowboards attached to their feet. The ski lift is carrying them up the mountain, providing them with a scenic view of the surrounding snow-covered landscape.\n\nThe people are seated in various positions within the ski lift, some closer to the front and others further back. They appear to be having a good time and are likely looking forward to skiing or snowboarding down the slopes once they reach their desired location."}
{"image_id": 146710, "caption": "In the image, a man and a woman are shaking hands on a tennis court. The man is wearing a white shirt and white shorts, while the woman is wearing a black shirt and black shorts. They are both holding tennis rackets in their hands, indicating their involvement in the sport.\n\nThe tennis court appears to be well-maintained, and the two players seem to be engaging in a friendly match or practice session. The scene conveys a sense of camaraderie and sportsmanship between the man and the woman."}
{"image_id": 246701, "caption": "The image depicts a small, clean bathroom with a white toilet and sink. The toilet is positioned towards the right side of the room, while the sink is located on the left side. The bathroom also features a window, which allows natural light to enter the space.\n\nIn addition to the toilet and sink, there is a toilet paper roll placed on the right side of the toilet. A bottle can be seen on the left side of the sink, possibly containing a cleaning product or a personal care item. The bathroom appears to be well-maintained and ready for use."}
{"image_id": 350251, "caption": "The image features a small microwave oven sitting on top of a counter. The microwave is open, and there is a yellow sticker placed on the door. The sticker reads \"Achetez Moins,\" which translates to \"Buy Less.\" The microwave appears to be an older model, possibly a vintage appliance."}
{"image_id": 458048, "caption": "The image features a dining table with an assortment of pizzas placed in cardboard boxes. There are a total of nine pizzas, each with different toppings, spread across the table. Some pizzas are larger, while others are smaller, showcasing a variety of sizes.\n\nIn addition to the pizzas, there is a bottle on the table, possibly containing a beverage to accompany the meal. The table is surrounded by chairs, inviting people to sit and enjoy the delicious pizzas. Overall, the scene presents a cozy and inviting atmosphere for a pizza party or gathering."}
{"image_id": 471869, "caption": "The image features a large, cuddly teddy bear sitting on a couch. The teddy bear is positioned towards the left side of the couch, occupying a significant portion of the seating area. The couch has a blue and white checkered pattern, adding a touch of color to the scene. The teddy bear appears to be the main focus of the image, creating a warm and inviting atmosphere."}
{"image_id": 30270, "caption": "The image features a bathroom with a white bathtub sitting on a stone floor. The bathtub is positioned near a window, allowing natural light to enter the room. The bathroom also has a sink and a toilet.\n\nThere are several bottles scattered around the bathroom, possibly containing toiletries or cleaning supplies. Additionally, a potted plant is present in the room, adding a touch of greenery to the space. A towel can be seen hanging near the bathtub, ready for use after a bath or shower."}
{"image_id": 112128, "caption": "The image depicts two white sheep grazing in a grassy field. One sheep is positioned towards the left side of the field, while the other is on the right side, closer to the center. Both sheep are focused on eating the grass, enjoying the sunny day.\n\nThe field appears to be a mix of grass and hay, providing a comfortable environment for the sheep to graze. The overall scene conveys a sense of peacefulness and natural beauty."}
{"image_id": 409542, "caption": "The image depicts a bustling city scene with a large clock mounted on a pole in the middle of the sidewalk, capturing the attention of pedestrians. Numerous people can be seen walking past the clock, some carrying handbags and backpacks. In total, there are at least 13 people visible in the scene, each going about their day.\n\nA few individuals are carrying umbrellas, suggesting that the weather might be rainy or overcast. Additionally, there is a car parked on the side of the street, adding to the urban atmosphere. Overall, the image captures the hustle and bustle of city life, with the clock tower serving as a focal point for the pedestrians passing by."}
{"image_id": 467467, "caption": "The image depicts a group of three elephants standing next to each other in a dirt area. They are positioned under a large tent, which provides shade for the elephants. The elephants are standing close to a fence, and there are several buckets scattered around the area, possibly containing water or food for the elephants.\n\nIn addition to the elephants and buckets, there are a few other objects in the scene, such as a chair and a handbag. The chair is located near the left side of the image, while the handbag is placed closer to the center. The presence of these objects suggests that the elephants might be in a controlled environment, such as a sanctuary or a zoo."}
{"image_id": 221725, "caption": "The image features a large, old television set sitting on a sandy beach near the water. The TV is positioned in the center of the scene, surrounded by a few pieces of driftwood and seaweed. The beach appears to be relatively empty, with no other objects or people visible. The sun is shining brightly, casting a warm glow over the scene, creating a serene and peaceful atmosphere."}
{"image_id": 170813, "caption": "In the image, a person is sitting on a park bench, using a laptop computer. The bench is positioned under a large tree, providing shade and a comfortable spot for the person to work. The person appears to be focused on their task, possibly enjoying the peaceful atmosphere of the park."}
{"image_id": 17267, "caption": "The image depicts a man in a uniform, possibly a sailor, standing next to a parking meter. He is wearing a hat and appears to be attending to the parking meter. The parking meter is located on the sidewalk, and there is a bicycle parked nearby.\n\nIn the background, there are several cars parked along the street. Additionally, there are other people present in the scene, with one person standing close to the sailor and another person further away. A handbag can also be seen placed on the ground, possibly belonging to one of the people in the scene."}
{"image_id": 92107, "caption": "The image features a green bowl filled with a creamy soup containing broccoli and corn. The bowl is placed on a dining table, accompanied by a spoon resting next to it. The soup appears to be a delicious and nutritious meal, with the broccoli and corn providing a balance of flavors and textures. The presence of the spoon suggests that someone is about to enjoy this tasty dish."}
{"image_id": 31092, "caption": "The image depicts a man sitting on a red motorcycle parked on the side of a street. Beside him, there are two bicycles parked on the sidewalk. One of the bicycles is positioned closer to the motorcycle, while the other is further away.\n\nIn addition to the motorcycle and bicycles, there are a few other objects in the scene. A handbag can be seen placed on the ground near the man on the motorcycle, and a backpack is located close to one of the bicycles. There is also a person visible in the background, possibly walking or standing on the sidewalk."}
{"image_id": 539196, "caption": "The image depicts a white horse and a white dog standing next to each other in a stable. The horse is positioned on the left side of the scene, while the dog is on the right side. The horse appears to be looking at the dog, creating a sense of companionship between the two animals.\n\nIn addition to the horse and dog, there is a person standing in the background, possibly observing or taking care of the animals. The scene is set in a stable, with a fence visible in the background, providing a sense of enclosure for the animals."}
{"image_id": 455261, "caption": "In the image, a person is riding a motorcycle down a country road on a sunny day. The motorcycle is positioned in the center of the scene, and the rider is holding the handlebars with one hand. The rider appears to be enjoying a leisurely ride through the countryside.\n\nIn addition to the motorcycle and the rider, there are a few other elements in the scene. A car can be seen parked on the side of the road, and a stop sign is visible further up the road. The overall atmosphere of the image is one of relaxation and enjoyment of the outdoors."}
{"image_id": 564166, "caption": "The image captures a thrilling moment during a professional baseball game. A batter is standing at home plate, holding a baseball bat and preparing to swing at an incoming pitch. The catcher and umpire are positioned behind the batter, ready to react to the play.\n\nThere are several other players on the field, some closer to the batter and others further away. A baseball glove can be seen in the scene, likely belonging to one of the fielders.\n\nIn the background, a crowd of spectators is watching the game intently, filling the stadium with excitement and anticipation."}
{"image_id": 426874, "caption": "The image depicts a brown dog curled up and sleeping on the floor next to a wooden desk. The dog is positioned underneath the desk, taking advantage of the space and comfort provided by the area. The desk is equipped with a computer, keyboard, and mouse, indicating that this is likely a home office or workspace. A chair can be seen in the background, placed near the desk. The scene conveys a sense of relaxation and contentment as the dog enjoys its nap in this cozy spot."}
{"image_id": 263477, "caption": "In the image, there are two giraffes standing next to each other in a lush green forest. The giraffes are positioned under a canopy, which provides shade and protection from the sun. They appear to be enjoying their time in the forest, surrounded by trees and greenery. The scene captures the beauty and tranquility of the natural habitat of these majestic creatures."}
{"image_id": 190227, "caption": "The image depicts a small bathroom with a toilet and a sink. The toilet is positioned towards the left side of the bathroom, while the sink is on the right side. The sink appears to be a metal basin, and the toilet is made of metal as well.\n\nIn addition to the toilet and sink, there is a toilet paper roll on the left side of the bathroom. The bathroom also features a window, providing natural light to the space."}
{"image_id": 299649, "caption": "The image depicts an airport tarmac with a large white airplane parked on the runway, surrounded by several vehicles. There are two trucks positioned in front of the airplane, with one closer to the left side and the other further to the right. Additionally, there are three cars parked near the airplane, with one on the left side, one in the middle, and another on the right side.\n\nA person can be seen standing near the middle of the scene, possibly attending to the vehicles or the airplane. The airplane occupies a significant portion of the tarmac, stretching from the left to the right side of the image."}
{"image_id": 298994, "caption": "The image showcases a wooden table filled with an assortment of fresh vegetables. There are numerous carrots spread across the table, with some placed closer to the front and others towards the back. In addition to the carrots, there are several cucumbers, broccoli, and other vegetables displayed on the table.\n\nA few of the vegetables are placed in plastic bags, likely for easy transportation or storage. The variety of vegetables on the table suggests a focus on healthy eating and the importance of incorporating these nutritious ingredients into one's diet."}
{"image_id": 154431, "caption": "The image features a living room with a television sitting on top of an entertainment center. The television is positioned towards the left side of the room, while a potted plant is located on the right side, adding a touch of greenery to the space.\n\nIn addition to the television, there is a collection of books scattered about the room, with some placed near the television and others on the right side of the entertainment center. A vase can also be seen on the right side of the room, further enhancing the room's decor."}
{"image_id": 571920, "caption": "In the image, two women are sitting on a bench under a clock, accompanied by a black and white dog. The dog is wearing a blue ribbon around its neck, adding a touch of charm to the scene. The women seem to be enjoying each other's company and the outdoor setting.\n\nThere are several cars parked in the background, with one car on the left side of the image, another on the right side, and a third car further back. Additionally, there is a handbag placed on the ground near the women, possibly belonging to one of them. The overall atmosphere appears to be relaxed and leisurely, as the women and their dog spend time together under the clock."}
{"image_id": 565227, "caption": "In the image, a woman is sitting at a dining table, holding a glass of red wine in her hand. She appears to be enjoying her drink while eating a sandwich. There are several other people in the scene, with one person sitting close to the woman and another person further away.\n\nThe dining table is surrounded by chairs, with one on the left side and another on the right side of the table. A handbag can be seen placed on the floor near the right side of the table. The scene appears to be set in a restaurant or a similar dining environment."}
{"image_id": 145921, "caption": "The image depicts an airport tarmac with several large airplanes parked on the runway. There are four airplanes in total, with one on the left side of the tarmac, one in the middle, and two on the right side.\n\nIn addition to the airplanes, there are several vehicles on the tarmac, including two trucks and a car. The trucks are positioned near the airplanes on the right side of the tarmac, while the car is located closer to the left side. The presence of these vehicles suggests that the airport is actively preparing for takeoff or has recently arrived from a flight."}
{"image_id": 347848, "caption": "In the image, a person is skillfully riding a skateboard down a ramp at a skate park. They are wearing a black shirt and jeans, showcasing their balance and control while performing the trick. The skateboarder is in the middle of the ramp, capturing the essence of skateboarding and the thrill of the sport."}
{"image_id": 18291, "caption": "The image features a vase filled with a beautiful bouquet of red, orange, and pink flowers. The vase is placed on a wooden shelf or table, creating a visually appealing display. The flowers are arranged in a way that showcases their vibrant colors, making them stand out against the wooden surface. The combination of the flowers and the wooden shelf creates a warm and inviting atmosphere in the room."}
{"image_id": 100343, "caption": "The image features a brown teddy bear sitting among a bunch of green bananas. The teddy bear is positioned between the bunches of bananas, creating a playful scene. The bananas are arranged in various bunches, with some closer to the teddy bear and others further away. Overall, the scene is a cute and whimsical combination of a stuffed animal and fresh produce."}
{"image_id": 558635, "caption": "In the image, a man is sitting on a metal bench in a city square, looking at his cell phone. The bench is located in the center of the scene, and the man appears to be focused on his phone.\n\nThe city square is bustling with activity, as there are several other people scattered throughout the area. Some of them are standing, while others are sitting on various benches. There are multiple cars parked around the square, and a bus can be seen on the right side of the image.\n\nAdditionally, there is a handbag placed on the ground near the center of the scene, possibly belonging to one of the people in the area."}
{"image_id": 365129, "caption": "The image captures a serene scene of a large body of water with a beautiful sunset in the background. Numerous boats of various sizes are floating on the water, creating a sense of tranquility and leisure. Some boats are closer to the shore, while others are further out in the water. The combination of the sunset, the boats, and the calm water creates a picturesque and peaceful atmosphere."}
{"image_id": 457322, "caption": "The image features a man sitting on a parked motorcycle in a parking lot. He is wearing a black shirt and appears to be the main focus of the scene. The motorcycle is positioned in the center, with the man sitting comfortably on it.\n\nThe parking lot is surrounded by several cars, including one on the left side of the motorcycle, another on the right side, and a few more in the background. A truck can also be seen in the background, parked further away from the motorcycle. The scene captures a moment of leisure and relaxation for the man on the motorcycle."}
{"image_id": 141770, "caption": "The image features a zebra standing in an enclosure at a zoo. The zebra is positioned in the center of the scene, surrounded by a fence that encloses the area. The zebra appears to be looking at the camera, possibly curious about its surroundings.\n\nThe enclosure is filled with rocks, creating a more natural habitat for the zebra. There are several large rocks scattered throughout the area, with some closer to the foreground and others further in the background. Overall, the scene captures a moment of the zebra's life within its zoo enclosure."}
{"image_id": 243212, "caption": "The image features a young boy wearing a green shirt and holding a blue frisbee in his hands. He appears to be posing for a picture, possibly in a park or a similar outdoor setting.\n\nIn the background, there are several cars and a truck parked, indicating that the location might be near a road or a parking area. Additionally, there are a couple of dogs visible in the scene, one located near the left side and the other closer to the right side of the image."}
{"image_id": 58329, "caption": "The image depicts a spacious bathroom with a large bathtub and a television mounted on the wall above it. The bathtub is situated under a window, allowing natural light to enter the room. There are two sinks in the bathroom, one closer to the left side and the other towards the right side.\n\nIn addition to the sinks, the bathroom features a towel rack with several towels hanging on it. A bottle can be seen on the right side of the room, possibly containing a bath product or soap. The overall atmosphere of the bathroom is clean and well-maintained."}
{"image_id": 190907, "caption": "The image depicts a man wearing a backpack standing in front of a sign that reads \"Iraq: Stop Killing Gays!\" He appears to be taking a picture of the sign, capturing the message it conveys. Another person can be seen in the background, possibly observing the scene or waiting for their turn to take a photo.\n\nThere are also two handbags visible in the scene, one near the man with the backpack and the other closer to the person in the background. The presence of these handbags suggests that the people in the image might be out for a walk or running errands."}
{"image_id": 258588, "caption": "In the image, a young boy is playing with a frisbee on a basketball court. He is running with the frisbee held in his hand, possibly preparing to throw it. The court is surrounded by a chain-link fence, providing a secure area for the boy to play.\n\nThere are a few other people in the background, possibly watching the boy play or waiting for their turn to participate. Additionally, there is a car parked nearby, possibly belonging to one of the people at the court."}
{"image_id": 69009, "caption": "The image features two young boys wearing blue hats, standing in front of a glass enclosure at a zoo. They are observing a large brown bear inside the enclosure, captivated by its presence. The boys are positioned close to each other, with one on the left side and the other on the right side of the enclosure. They seem to be enjoying their time at the zoo, taking in the sights of the fascinating bear."}
{"image_id": 283874, "caption": "The image depicts an outdoor market bustling with activity. Numerous people can be seen throughout the scene, with some standing under umbrellas to protect themselves from the sun. The umbrellas are scattered throughout the market, providing shade for the vendors and customers alike.\n\nThe market is filled with a variety of fruits, with bananas being the most prominent. There are numerous bunches of bananas spread across the market, attracting the attention of shoppers. In addition to the bananas, there are also apples and oranges available for purchase.\n\nSeveral motorcycles are parked around the market, likely belonging to the vendors or customers. A handbag can also be spotted in the scene, possibly belonging to one of the shoppers.\n\nOverall, the image captures the lively atmosphere of an outdoor market filled with fresh produce and people going about their day."}
{"image_id": 304484, "caption": "The image features a wooden grandfather clock standing next to a wooden table. The clock is positioned towards the right side of the table, while the table occupies most of the left side of the scene.\n\nOn the table, there is a tea set consisting of a teapot, a cup, and a spoon. The teapot is placed towards the left side of the table, while the cup and the spoon are positioned closer to the center. Additionally, there is a vase located on the left side of the table, adding a decorative touch to the scene."}
{"image_id": 69411, "caption": "The image captures a group of six snowboarders on a snow-covered slope. They are all sitting on their snowboards, taking a break or preparing for their next run down the hill. The snowboarders are positioned at various locations on the slope, with some closer to the foreground and others further in the background.\n\nEach snowboarder is wearing a helmet, ensuring safety while enjoying their time on the mountain. The snowboards themselves are visible beneath the riders, showcasing the equipment they use for their winter sports activities. The scene conveys a sense of camaraderie and shared enthusiasm for snowboarding among the group."}
{"image_id": 114946, "caption": "In the image, a man and a woman are standing next to each other, both holding umbrellas. The woman is holding a yellow umbrella, while the man is holding a black umbrella. They appear to be posing for a picture, possibly in front of a brick wall.\n\nThe woman is wearing a black shirt and white pants, while the man is wearing a blue shirt. They seem to be enjoying their time together, despite the weather conditions."}
{"image_id": 176007, "caption": "The image features a pile of old cell phones sitting on top of a couch cushion. There are five cell phones in total, varying in size and design. Some of the cell phones are positioned closer to the edge of the couch, while others are more centrally located.\n\nIn addition to the cell phones, there is a remote control resting on the couch, slightly to the left of the cell phones. The arrangement of these items creates a sense of nostalgia and showcases the evolution of technology over time."}
{"image_id": 431523, "caption": "The image features an old-fashioned steam locomotive traveling down a snow-covered track. The train is black and white, giving it a vintage appearance. It is moving along the tracks, likely transporting passengers or cargo during the winter season.\n\nIn addition to the train, there are a few people visible in the scene. One person is standing near the left side of the train, while two others are located closer to the right side. The presence of these individuals suggests that they might be observing the train or waiting for it to pass. Overall, the scene captures the essence of a classic steam locomotive in action during the winter months."}
{"image_id": 341957, "caption": "The image features a bed with a blue comforter and a stuffed teddy bear sitting on top of it. The teddy bear appears to be wearing a black shirt, adding a touch of personality to the scene. The bed is positioned in front of a window, allowing natural light to illuminate the room."}
{"image_id": 345288, "caption": "The image captures a thrilling moment of a snowboarder performing a high jump in the air. The snowboarder is in mid air, showcasing their skill and athleticism. The snowboard can be seen beneath the snowboarder, emphasizing their impressive jump.\n\nThe scene is set against a backdrop of snow-covered mountains, adding to the excitement and beauty of the moment. The snowboarder's jump is a testament to their talent and the exhilarating sport of snowboarding."}
{"image_id": 19624, "caption": "The image depicts a bustling city street filled with traffic and pedestrians. Numerous vehicles such as cars, trucks, and motorcycles can be seen driving and parked along the street. A few motorcycles are also parked on the side of the road.\n\nSeveral people are walking on the sidewalks, with some carrying handbags and backpacks. One person is using a cell phone, possibly checking messages or navigating their way through the city.\n\nThe street is lined with buildings, including a large white building with a giant advertisement on its side. The scene captures the hustle and bustle of a busy urban environment."}
{"image_id": 361022, "caption": "In the image, a man is sitting on the ground, surrounded by two brown dogs. One dog is on his left side, and the other is on his right side. The man appears to be enjoying the company of the dogs, possibly petting them.\n\nThe man is wearing a gray shirt, and he is also wearing sunglasses. The scene takes place on the street, with a car visible in the background. The man and the dogs seem to be having a great time together, creating a warm and friendly atmosphere."}
{"image_id": 435389, "caption": "The image features a wooden bookshelf filled with various items. On the shelf, there is a clock positioned towards the left side, and a television is mounted on the wall above it. The bookshelf is also adorned with several vases containing flowers, adding a touch of elegance to the space.\n\nIn addition to the vases, there are two bowls placed on the shelf, one near the center and the other towards the right side. A potted plant can be seen on the left side of the bookshelf, and a card is placed in the middle of the shelf. The combination of these items creates a cozy and inviting atmosphere in the room."}
{"image_id": 113294, "caption": "In the image, a man is standing on a rocky shore, holding onto a boat that is tied to the shore. The boat is positioned in the water, and the man appears to be either preparing to launch the boat or has just returned from a fishing trip.\n\nThere are several other boats visible in the background, both near the shore and further out in the water. These boats vary in size and distance from the main boat being held by the man. The scene captures the essence of a day spent on the water, with the man and his boat as the focal point."}
{"image_id": 334178, "caption": "The image depicts a man wearing glasses and a white shirt, smoking a cigarette. He is holding the cigarette close to his mouth and appears to be enjoying the smoke. The man is also wearing a pink tie, which adds a touch of color to the scene.\n\nIn the background, there is a TV mounted on the wall, likely providing entertainment for the man as he enjoys his cigarette. Another person can be seen in the background, but they are not the main focus of the scene. Overall, the image captures a moment of relaxation and leisure for the man as he smokes his cigarette."}
{"image_id": 724, "caption": "The image features a red stop sign with the word \"STOP\" written upside down. The stop sign is located on a street corner, and there is a truck parked nearby. The scene also includes a few other vehicles, such as cars and another truck, parked or driving along the street.\n\nIn addition to the vehicles, there are a few pedestrians visible in the scene. One person can be seen closer to the left side of the image, while another person is located further to the right. A fire hydrant can also be spotted on the right side of the scene."}
{"image_id": 516313, "caption": "The image features a man and a woman sitting next to each other, with a large teddy bear in between them. The teddy bear is holding a heart that says \"I love you.\" The man is wearing a red shirt, while the woman is wearing a black shirt.\n\nIn the background, there is a dining table with a bottle placed on it. A cell phone can be seen on the table as well. The scene appears to be a cozy and intimate moment between the two individuals and the teddy bear."}
{"image_id": 559303, "caption": "The image depicts a man sitting on a parked motorcycle on the side of a street. He is wearing a hat and appears to be relaxed, possibly taking a break from riding. The motorcycle is positioned next to a trash can, and there are a few cars parked nearby.\n\nIn addition to the man on the motorcycle, there are several other people in the scene. One person is standing close to the man on the motorcycle, while two other individuals are further away. A handbag can be seen placed on the ground near the man on the motorcycle.\n\nOverall, the scene captures a moment of leisure and relaxation for the man on the parked motorcycle."}
{"image_id": 345419, "caption": "The image captures a man skillfully riding a wave on a surfboard in the ocean. He is positioned in the center of the scene, with the surfboard beneath him as he skillfully navigates the wave. The man appears to be enjoying his time in the water, showcasing his surfing abilities."}
{"image_id": 267690, "caption": "The image is a vintage black and white photograph featuring three young boys dressed in suits and ties. They are standing together on a sidewalk, posing for the picture. Each of the boys is wearing a tie, adding a formal touch to their attire.\n\nIn the background, there is a train visible, suggesting that the photo was taken near a train station. The boys appear to be enjoying their time together, creating a nostalgic and heartwarming scene."}
{"image_id": 290610, "caption": "The image depicts a train traveling down the tracks in a rural countryside setting. The train is positioned in the middle of the scene, surrounded by lush green grass and a fence. The train appears to be an old-fashioned steam engine, adding a nostalgic touch to the scene.\n\nIn addition to the train, there are a few sheep scattered throughout the countryside, grazing and enjoying the peaceful surroundings. One sheep can be seen near the left side of the image, while two others are closer to the right side. The overall atmosphere of the scene is serene and picturesque, showcasing the beauty of the countryside and the harmony between nature and human-made transportation."}
{"image_id": 571876, "caption": "The image features a counter with three different colored drinks in plastic cups. The drinks are placed next to each other, with one cup on the left side, another in the middle, and the third cup on the right side.\n\nIn the background, there is a pile of carrots stacked on a shelf. The carrots come in various sizes and are arranged neatly, creating an appealing visual display. The combination of the colorful drinks and the vibrant carrots creates a lively and inviting atmosphere in the scene."}
{"image_id": 377111, "caption": "In the image, a young man is skillfully performing a skateboard trick, jumping over a cement block. He is wearing a hoodie and appears to be in mid-air, showcasing his talent. The skateboarder is surrounded by several cement blocks, creating an urban setting for his stunt. The scene is captured in black and white, adding a sense of timelessness to the image."}
{"image_id": 1164, "caption": "In the image, two women are standing in a body of water, possibly a river or a lake. One of the women is petting an elephant that is lying down in the water. The elephant appears to be enjoying the attention, as it is partially submerged in the water.\n\nBoth women are wearing shorts, and one of them is wearing a pink shirt. They seem to be interacting with the elephant and enjoying their time in the water. The scene appears to be a unique and memorable experience for both the women and the elephant."}
{"image_id": 111629, "caption": "The image depicts a man wearing a red apron, standing at a dining table and preparing a delicious dessert. He is using a spatula to scoop bananas onto a pancake, which is placed on the table. The man appears to be focused on his task, ensuring that the bananas are evenly distributed on the pancake.\n\nIn the background, there are a few other people present, possibly observing or waiting for their turn to enjoy the dessert. Additionally, there are a couple of bottles on the table, possibly containing ingredients or condiments for the dessert."}
{"image_id": 506004, "caption": "The image features a large Ferris wheel, known as the London Eye, towering over the city of London. The Ferris wheel is lit up, making it a prominent and eye-catching landmark in the cityscape.\n\nIn addition to the Ferris wheel, there is a bridge visible in the scene, spanning across the body of water below. The cityscape is bustling with activity, as several boats can be seen floating on the water, adding to the lively atmosphere.\n\nOverall, the scene captures the essence of a vibrant and bustling city, with the iconic London Eye as its centerpiece."}
{"image_id": 351504, "caption": "The image depicts two men sitting in lawn chairs on a grassy field, possibly at a camping site. One of the men is wearing a black hoodie, while the other is wearing a hooded sweatshirt. They appear to be relaxing and enjoying their time outdoors.\n\nBoth men have cell phones in their hands, possibly checking messages or browsing the internet. In addition to the chairs, there are two backpacks nearby, one on the left side and the other on the right side of the men. The scene conveys a sense of leisure and camaraderie between the two individuals."}
{"image_id": 503210, "caption": "The image depicts a spacious living room with a variety of furniture and decorations. There is a large couch situated in the center of the room, accompanied by two chairs, one on the left side and another on the right side. A dining table is also present in the room, surrounded by multiple chairs.\n\nIn addition to the furniture, there is a piano in the room, adding a touch of elegance to the space. A potted plant can be seen on the left side of the room, and a clock hangs on the wall above the couch. The living room is well-lit, with a clock on the wall and a window providing natural light.\n\nOverall, the living room appears to be a comfortable and inviting space for relaxation and entertainment."}
{"image_id": 203085, "caption": "In the image, a man is sitting on a toilet in a room with a computer desk in front of him. He is using the computer, likely playing a game, as there is a keyboard and a mouse on the desk. The man appears to be wearing blue pants and a gray shirt.\n\nThe room also contains several books scattered around, with some on the desk and others on the floor. Additionally, there is a TV mounted on the wall above the computer desk."}
{"image_id": 41257, "caption": "The image features two pictures of a white animal, possibly a cat or a dog, lying down on a bed. In the first picture, the animal is sleeping on its side, while in the second picture, it is sleeping on its back. The bed appears to be covered with a blanket, providing a comfortable resting spot for the animal. The two pictures showcase the animal's relaxed and peaceful state."}
{"image_id": 128598, "caption": "The image features a close-up view of a variety of fruits, including oranges, lemons, and grapefruits, piled together on a table. The fruits are in different stages of ripeness, with some appearing ripe and others still unripe. The oranges and lemons are predominant in the scene, with a few grapefruits scattered among them. The fruits are arranged in a visually appealing manner, showcasing their vibrant colors and textures."}
{"image_id": 409239, "caption": "The image features a delicious-looking pizza with a generous amount of toppings, including onions and cheese. The pizza is placed on a dining table, and it appears to be freshly baked. The pizza is cut into slices, making it easy to serve and enjoy.\n\nIn the background, there is a person partially visible, likely preparing to enjoy the pizza or waiting for it to be served. The scene is set in a cozy and inviting atmosphere, perfect for sharing a meal with friends or family."}
{"image_id": 101715, "caption": "The image features a dining table with a wooden tray holding a variety of food items. On the tray, there is a banana, a slice of pineapple, and a small bowl of guacamole. A glass of milk is placed next to the tray, completing the meal. The banana and pineapple slices are arranged neatly on the tray, while the guacamole sits in the bowl. The table setting creates a pleasant and inviting atmosphere for a meal."}
{"image_id": 482062, "caption": "The image captures a beautiful scene of three zebras standing on a lush green hillside. The zebras are positioned in a line, with one zebra on the left side, another in the middle, and the third zebra on the right side of the hill. The grassy hill provides a perfect environment for the zebras to graze and roam freely."}
{"image_id": 203631, "caption": "In the image, a man is standing on a snow-covered slope, wearing skis and holding ski poles. He appears to be posing for a picture while enjoying his time on the mountain. The man is wearing a red jacket, which stands out against the snowy backdrop.\n\nThe scene also features a mountain in the background, adding to the picturesque winter setting. The skier is the main focus of the image, showcasing his gear and enthusiasm for the sport."}
{"image_id": 556932, "caption": "The image showcases a delicious pizza with various toppings, including peppers, cheese, and sausage. The pizza is sliced and ready to be eaten. It is placed on a dining table, and a knife can be seen nearby, likely used for cutting the pizza. The pizza appears to be a personal-sized pizza with a generous amount of toppings, making it a mouth-watering treat for anyone who enjoys a good slice of pizza."}
{"image_id": 315863, "caption": "The image features a red and black train engine traveling down the tracks, with a man standing in the doorway of the train. The train appears to be an old-fashioned steam engine, adding a nostalgic touch to the scene.\n\nIn addition to the train, there are several potted plants scattered around the area, adding a touch of greenery to the surroundings. Some potted plants are located near the train tracks, while others are placed further away, creating a pleasant atmosphere."}
{"image_id": 391016, "caption": "The image features a herd of zebras walking across a lush green field. There are at least 13 zebras in the scene, spread out across the field. Some zebras are walking closer to the foreground, while others are further in the background, creating a sense of depth in the scene. The zebras appear to be grazing and enjoying their time in the field."}
{"image_id": 218215, "caption": "The image captures a polar bear swimming in a body of water, possibly an ocean. The bear appears to have its mouth open, possibly enjoying the water or cooling off. The bear's body is surrounded by a splash of water, indicating that it is actively swimming. The scene conveys a sense of freedom and playfulness as the polar bear enjoys its time in the water."}
{"image_id": 24480, "caption": "The image depicts a black and white cow standing in a grassy field near a body of water. The cow appears to have a yellow tag in its ear, indicating that it might be a dairy cow. The cow is grazing on the grass, enjoying its surroundings.\n\nIn addition to the cow, there are a few other elements in the scene. A potted plant can be seen on the left side of the image, and a bottle is located on the right side. The presence of the potted plant and the bottle suggests that the area might be used for leisure or relaxation."}
{"image_id": 228914, "caption": "The image depicts a group of jockeys riding horses on a race track. There are four horses in the scene, each with a jockey riding them. The jockeys are wearing colorful outfits, adding to the excitement of the race.\n\nIn addition to the horses and jockeys, there is a clock visible in the background, likely indicating the time of the race. The scene captures the essence of a thrilling horse race, with the jockeys skillfully guiding their horses around the track."}
{"image_id": 65969, "caption": "The image features a dining table with a glass of beer and two vases of flowers placed on it. The glass of beer is positioned towards the right side of the table, while the two vases of flowers are located closer to the left side. The table appears to be set outdoors, as there is a view of the ocean in the background."}
{"image_id": 213171, "caption": "The image features a young baseball player standing on a field, wearing a baseball uniform and holding a catcher's mitt. The player appears to be posing for a picture, possibly during a game or practice session.\n\nIn the background, there is a car parked near the field, possibly belonging to one of the players or spectators. Additionally, a bench can be seen in the background, providing a place for resting or observing the game."}
{"image_id": 126123, "caption": "In the image, a man is standing next to a large brown bear, which is wearing a chain around its neck. The man appears to be holding a musical instrument, possibly a guitar, while standing close to the bear. Another person can be seen in the background, possibly observing the scene or waiting for their turn to interact with the large bear. The setting seems to be outdoors, with a dirt hill visible in the background."}
{"image_id": 255448, "caption": "The image features a box filled with two slices of pizza. One slice is placed towards the left side of the box, while the other slice is positioned towards the right side. Both slices are topped with cheese and herbs, making them look delicious and appetizing. The pizza appears to be freshly baked and ready to be enjoyed. The box itself is placed on a dining table, creating an inviting atmosphere for a meal."}
{"image_id": 109403, "caption": "In the image, a man is riding a brown horse, skillfully navigating through an obstacle course. The man is wearing a cowboy hat and appears to be focused on the task at hand. The horse is positioned in the center of the scene, with the rider skillfully guiding it through the course.\n\nThere are several other people in the background, watching the man and the horse as they make their way through the obstacle course. Some of them are standing closer to the foreground, while others are further in the background. The scene captures the excitement and challenge of horse riding and the bond between the rider and the horse."}
{"image_id": 170015, "caption": "The image depicts a bakery with a woman standing behind the counter, wearing a green dress and a black hat. She appears to be a worker at the bakery, ready to serve customers. The bakery offers a wide variety of donuts, with at least 13 different types visible in the display case.\n\nThe donuts are arranged in a visually appealing manner, showcasing the assortment of flavors and toppings. The bakery seems to be well-stocked and ready to cater to the customers' sweet tooth cravings."}
{"image_id": 421566, "caption": "In the image, a young boy is sitting at a dining table, enjoying a slice of pizza. He is accompanied by a bottle of beer, adding to the casual atmosphere of the scene. Another person is visible in the background, but they are not the focus of the image.\n\nThe dining table occupies most of the space in the scene, with the pizza and the beer bottle placed on it. The boy appears to be the main subject of the image, as he sits and enjoys his meal. The presence of the pizza and the beer suggests a relaxed and leisurely mealtime for the young boy."}
{"image_id": 32038, "caption": "The image features a large, freshly baked pizza with a generous amount of cheese and spinach toppings. The pizza is placed on a wooden table, occupying most of the table's surface. The pizza appears to be ready to be sliced and served.\n\nIn the background, a person can be seen, possibly preparing to enjoy the delicious pizza or attending to other tasks. The scene conveys a warm and inviting atmosphere, perfect for sharing a meal with friends or family."}
{"image_id": 516800, "caption": "The image features a green passenger train parked at a train station. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. The train appears to be an older model, possibly a vintage train.\n\nIn addition to the train, there are a few people visible in the scene. One person is standing near the left side of the train, while two others are located closer to the right side. The presence of these individuals suggests that they might be passengers waiting to board the train or simply passing by the station."}
{"image_id": 443963, "caption": "The image depicts a small, clean bathroom with a white toilet and a sink. The toilet is positioned close to the sink, which is located towards the right side of the bathroom. The sink is accompanied by a mirror above it. The bathroom also features a window, providing natural light to the space.\n\nThere is a toilet paper roll placed on the left side of the toilet, and a bottle can be seen on the right side of the sink. The bathroom appears to be well-maintained and ready for use."}
{"image_id": 67207, "caption": "The image depicts two women standing in a living room, each holding a Nintendo Wii game controller and actively playing a video game together. They are both smiling and enjoying their gaming session.\n\nThe living room features a couch in the background, and a potted plant can be seen placed near the left side of the room. A cat is also present in the scene, sitting on the floor and observing the women as they play. Additionally, there is a book placed on a surface towards the right side of the room."}
{"image_id": 386650, "caption": "The image features a wooden bench placed on a brick patio, surrounded by several potted plants. The bench is positioned near the center of the scene, with a few potted plants on the left and right sides of the bench.\n\nIn addition to the potted plants, there are two vases in the scene. One vase is located on the left side of the bench, while the other vase is situated on the right side. The combination of the bench, potted plants, and vases creates a cozy and inviting atmosphere for outdoor relaxation."}
{"image_id": 258954, "caption": "In the image, a woman is standing in a kitchen, leaning against a white refrigerator. She is wearing a black shirt and appears to be posing for a picture. The refrigerator is located on the left side of the scene, while the woman is positioned more towards the center. The kitchen seems to be a small space, with the refrigerator being the main focal point."}
{"image_id": 127530, "caption": "The image depicts a man in a blue shirt and white shorts playing tennis on a court. He is holding a tennis racket, preparing to hit a tennis ball that is in mid-air. The man appears to be focused and determined as he swings his racket to make contact with the ball."}
{"image_id": 550729, "caption": "The image features a colorful kite lying on the grass, with its vibrant colors making it stand out against the green background. The kite appears to be a rainbow-colored, three-sided kite with a red, yellow, and blue design. The kite is positioned in the middle of the grassy field, creating a visually appealing scene."}
{"image_id": 125160, "caption": "The image features a large elephant walking down a dirt road, with several other elephants following behind it. The elephants are spread out along the road, creating a sense of depth in the scene.\n\nIn the background, there is a car visible, likely capturing the moment as the elephants make their way down the road. The presence of the car adds an interesting contrast to the natural setting of the elephants."}
{"image_id": 55524, "caption": "The image features a large, ornate wooden clock mounted on the side of a marble pillar. The clock is prominently displayed, drawing attention to its intricate design. The clock's face is adorned with Roman numerals, giving it a classic and elegant appearance.\n\nIn addition to the main clock, there are two smaller, decorative clocks positioned above and below the main clock, further enhancing the overall aesthetic of the scene. The combination of the marble pillar, ornate woodwork, and the clock's intricate details create an impressive and eye-catching display."}
{"image_id": 261360, "caption": "The image features a parking meter with a green toy frog sitting on top of it. The toy frog appears to be smiling as it sits atop the parking meter. The parking meter is located next to a car, which is partially visible in the background. The scene captures a playful and whimsical moment with the toy frog interacting with the parking meter."}
{"image_id": 152618, "caption": "The image features a red and white stop sign with the words \"report all business here\" written on it. The sign is positioned in front of a chain-link fence, which is likely meant to secure the area.\n\nIn the background, there are several boats visible, suggesting that the location might be near a body of water or a marina. The presence of these boats adds to the overall atmosphere of the scene."}
{"image_id": 568426, "caption": "The image features a dining table with a plate of food, including a sandwich, tomatoes, and pickles. The plate is placed in the center of the table, and a glass of beer sits next to it. A person can be seen sitting at the table, likely enjoying the meal and the beverage.\n\nIn addition to the main plate, there are a few other items on the table, such as a knife and a bowl. A chair is positioned near the dining table, ready for someone to sit down and partake in the meal."}
{"image_id": 406053, "caption": "In the image, a man is taking a picture of a fox that is sitting on the side of the road. The man is using a mirror to capture the reflection of the fox in the scene. The fox is positioned towards the left side of the image, while the man is standing on the right side.\n\nIn the background, there are several cars parked along the street, with one car on the far left, another on the far right, and two more cars closer to the center of the scene. Additionally, there is a handbag placed on the ground near the center of the image, possibly belonging to the man taking the picture."}
{"image_id": 35148, "caption": "The image depicts a busy city street at dusk, with cars driving down the road and traffic lights controlling the flow of traffic. There are multiple traffic lights visible in the scene, some closer to the foreground and others further down the street, ensuring the safety of the vehicles and pedestrian crossings.\n\nSeveral cars can be seen on the street, with some positioned closer to the foreground and others further down the road. In addition to the cars, there are a couple of pedestrians walking along the sidewalk, navigating the bustling urban environment.\n\nOverall, the scene captures the hustle and bustle of a city street at dusk, with cars, traffic lights, and pedestrians all contributing to the lively atmosphere."}
{"image_id": 18728, "caption": "The image features a young man wearing a helmet and goggles, sitting on the snow with a snowboard attached to his feet. He appears to be enjoying his time on the snow-covered slope, possibly taking a break or preparing to continue snowboarding.\n\nThe snowboard is positioned horizontally on the ground, with the man's feet firmly strapped in. The scene captures the essence of winter sports and outdoor recreation."}
{"image_id": 377575, "caption": "The image features a black and brown dog standing on a sidewalk next to a fire hydrant. The dog is wearing a red collar and appears to be looking at the camera. The fire hydrant is located on the right side of the dog, and the sidewalk stretches across the scene.\n\nIn the background, there are a few leaves scattered on the ground, adding a touch of nature to the urban setting. Overall, the scene captures a casual moment between the dog and its surroundings."}
{"image_id": 281296, "caption": "In the image, a woman is holding a cat in her arms, showcasing her affection for the feline. The cat appears to be a calico, with a mix of orange, black, and white fur. The woman is wearing a red sweater, which complements the cat's coloring. The scene captures a warm and loving moment between the woman and her cat."}
{"image_id": 150508, "caption": "In the image, a woman is sitting on a wooden bench, reading a book. The bench is located on a brick sidewalk, and the woman appears to be enjoying her time outdoors. She is wearing a black jacket, which complements her outfit.\n\nThe scene also includes a dining table and a chair in the background, suggesting that the area might be a public space or a restaurant. Additionally, there is a cell phone placed on the bench, possibly belonging to the woman or someone else in the vicinity."}
