{"image_id": 220050, "caption": "The image features a young girl standing on a tennis court, holding a tennis racket in her hand. She appears to be posing for a picture, showcasing her enthusiasm for the sport. The girl is wearing a white dress, which complements her tennis attire.\n\nThe tennis court is surrounded by a fence, and there are two benches visible in the background, one on the left side and another on the right side of the court."}
{"image_id": 535050, "caption": "The image features a room with a large suitcase and a cardboard box placed next to each other. The suitcase is positioned towards the right side of the room, while the cardboard box is on the left side. The suitcase appears to be silver, and the cardboard box is brown.\n\nIn addition to the suitcase and the cardboard box, there is a smaller suitcase located in the middle of the room. This smaller suitcase is positioned between the larger suitcase and the cardboard box, creating a sense of depth in the scene."}
{"image_id": 438364, "caption": "The image features a red double-decker bus driving down a street. The bus is quite large and occupies a significant portion of the scene. There are several passengers visible on the bus, with some sitting on the upper deck and others on the lower deck.\n\nIn addition to the bus, there are a few people scattered along the street, with some standing closer to the bus and others further away. A car can also be seen parked on the side of the street, adding to the urban atmosphere of the scene."}
{"image_id": 173819, "caption": "The image depicts a pink Hello Kitty bathroom featuring a toilet, sink, and bathtub. The toilet is positioned towards the left side of the bathroom, while the sink is located on the right side. Above the toilet, there is a towel rack with a Hello Kitty towel hanging on it.\n\nIn addition to the toiletries, there are several bottles placed around the bathroom. One bottle can be found on the left side of the toilet, another on the right side of the sink, and a third one on the right side of the bathtub. A cup is also visible on the right side of the sink."}
{"image_id": 196295, "caption": "The image depicts a herd of elephants walking down a dirt road in a wooded area. There are a total of seven elephants in the scene, with one large elephant leading the way and the others following closely behind. The elephants vary in size, indicating a mix of adults and younger members of the herd.\n\nThe elephants are spread out along the road, with some closer to the foreground and others further in the background. The dirt road appears to be a natural path that the elephants are using to travel through the lush green forest."}
{"image_id": 527704, "caption": "The image features a woman wearing a blue outfit, skating on a sidewalk next to a parked RV. She appears to be enjoying her time outdoors, possibly as a form of exercise or leisure activity.\n\nIn the background, there are two cars parked nearby, one on the left side and the other on the right side of the scene. The presence of the RV and the parked cars suggests that the location might be a parking lot or a street with parked vehicles."}
{"image_id": 517454, "caption": "The image features a bed with three cats lying on it. The first cat is on the left side of the bed, the second cat is in the middle, and the third cat is on the right side. The cats appear to be relaxed and enjoying their time together on the bed.\n\nIn addition to the cats, there are two pairs of shoes placed on the bed, one near the top left corner and the other near the top right corner. These shoes might belong to the cats' owners or other people in the household."}
{"image_id": 474528, "caption": "The image features a group of stuffed teddy bears arranged on a table. There are four teddy bears in total, with one large teddy bear in the center and three smaller teddy bears positioned around it. The large teddy bear is wearing a pink dress, while the smaller teddy bears are dressed in various outfits.\n\nIn addition to the teddy bears, there are two chairs in the scene, one located on the left side and the other on the right side of the table. A potted plant can be seen in the background, adding a touch of greenery to the scene."}
{"image_id": 475271, "caption": "The image features a young woman wearing a blue shirt, sitting on the floor and using a laptop computer. She is smiling and appears to be enjoying her time on the computer. The laptop is positioned in front of her, and she is seated comfortably on the floor."}
{"image_id": 496081, "caption": "The image features two horses standing next to each other near a stone fence. One horse is positioned closer to the left side of the fence, while the other horse is on the right side. Both horses appear to be looking over the fence, possibly observing their surroundings or seeking attention from passersby.\n\nIn the background, there is a building, possibly a stable or a barn, which adds to the rural setting of the scene."}
{"image_id": 41923, "caption": "The image features a dining table with a delicious meal consisting of a sandwich, french fries, and a glass of water. The sandwich is placed towards the right side of the table, while the french fries are spread across the table, with some on the left side and others on the right. The glass of water is positioned near the center of the table.\n\nIn addition to the main meal, there are two bowls on the table. One bowl is located on the left side of the table, and the other is on the right side. A spoon can also be seen on the left side of the table, likely used for eating the soup."}
{"image_id": 40681, "caption": "The image captures a group of people skiing down a snow-covered slope on a sunny day. There are at least nine people visible in the scene, with some skiers closer to the foreground and others further down the slope.\n\nSeveral pairs or groups of skis can be seen on the snow, indicating that the skiers are actively skiing down the hill. The skiers are spread out across the slope, with some closer to the center and others near the edges of the image. The overall atmosphere of the scene is lively and enjoyable, as people engage in winter sports on a beautiful day."}
{"image_id": 393547, "caption": "The image features an orange and white cat sitting on top of a glass table, looking at its reflection in the mirror. The cat appears to be curious and intrigued by its own image. The table occupies a significant portion of the scene, extending from the left edge to the right edge of the image."}
{"image_id": 1803, "caption": "The image depicts a clean and well-organized bathroom with a blue tiled floor. There's white porcelain fixtures, including two sinks, one on the left side and the other on the right side of the room. Above the sinks, there are two mirrors, one on the left and the other on the right.\n\nIn addition to the sinks and mirrors, there are two toilets in the bathroom, one on the left side and the other on the right side. Above the toilets, there are two shelves, one on the left and the other on the right, providing storage space for toiletries and other bathroom essentials."}
{"image_id": 417055, "caption": "The image features a close-up view of the famous Big Ben clock tower in London, England. The tower is adorned with two large clocks, one on the left side and the other on the right side. The clocks are positioned at the top of the tower, making them easily visible from a distance.\n\nIn addition to the clocks, the tower is also decorated with gold trim, enhancing its grandeur and elegance. The clocks are set against a backdrop of the city skyline, showcasing the iconic landmark's prominence in the urban landscape."}
{"image_id": 498374, "caption": "The image depicts a bathroom with a white toilet and a sink. The toilet is located on the left side of the bathroom, while the sink is situated on the right side. The bathroom appears to be clean and well-maintained.\n\nA person can be seen in the reflection on the mirror, likely taking a picture of the bathroom. The mirror is positioned above the sink, providing a clear view of the bathroom's interior. Additionally, there is a bottle placed near the sink, possibly containing toiletries or cleaning supplies."}
{"image_id": 577866, "caption": "The image is a black and white photo of an old bus parked on the side of a road. The bus is positioned on the left side of the scene, and it appears to be a vintage model. There is a person standing near the bus, possibly waiting to board or disembark.\n\nIn the background, several houses can be seen, indicating that the bus is parked in a residential area. Additionally, there is a bench located on the right side of the scene, providing a place for people to sit and relax."}
{"image_id": 254491, "caption": "The image features two bicycles parked on a sandy beach near the ocean. The bicycles are positioned close to each other, with one located on the left side and the other on the right side of the scene. The beach appears to be relatively empty, with no other people or objects visible in the image. The bicycles seem to be the main focus of the scene, creating a peaceful and serene atmosphere."}
{"image_id": 360735, "caption": "The image depicts a man riding a red motorcycle down a street, with a blue car following closely behind him. The man appears to be wearing a helmet for safety while riding the motorcycle.\n\nThere are several other people visible in the scene, with one person standing near the left edge of the image, another person closer to the center, and a third person on the right side of the image. Additionally, there is a handbag placed on the ground near the center of the scene."}
{"image_id": 151338, "caption": "The image captures a young man skillfully riding a skateboard, performing a trick by jumping over a cement block. He is wearing a brown shirt and appears to be the main focus of the scene. Another person can be seen in the background, possibly watching the skateboarder or waiting for their turn to perform a trick.\n\nThere are two skateboards in the scene, with the main skateboarder's skateboard positioned underneath him as he jumps, and another skateboard located near the person in the background. The scene takes place at night, adding a sense of excitement and challenge to the skateboarder's performance."}
{"image_id": 183332, "caption": "In the image, there are two people standing in front of a laptop computer. One person is on the left side of the laptop, while the other person is on the right side. The laptop is placed on a desk, and both individuals appear to be engaged with the content displayed on the screen.\n\nThere are also two clocks visible in the scene, one on the left side and the other on the right side of the laptop. The presence of these clocks suggests that the people might be working or studying in a time-sensitive environment."}
{"image_id": 248148, "caption": "The image features a red and white train parked at a train station. The train occupies a significant portion of the scene, stretching from the left to the right side of the image. The train has multiple windows, allowing passengers to view the surroundings while traveling.\n\nIn addition to the train, there are two people visible in the scene. One person is standing near the left side of the train, while the other person is located closer to the right side. The presence of these individuals suggests that they might be waiting for the train or have just disembarked from it."}
{"image_id": 329341, "caption": "The image depicts a small, empty kitchen with white walls and brown cabinets. The kitchen is equipped with essential appliances such as a sink, a refrigerator, and an oven. The sink is located on the left side of the kitchen, while the refrigerator is positioned in the middle, and the oven is situated on the right side.\n\nThere are also a few items scattered around the kitchen. A bottle can be seen on the left side of the refrigerator, and a bowl is placed on the countertop near the sink. Additionally, a handbag is located on the right side of the kitchen, close to the oven."}
{"image_id": 373341, "caption": "The image depicts a busy city street filled with various vehicles, including cars, a truck, and a motorcycle. A FedEx truck is prominently driving down the street, surrounded by other cars and a motorcycle. The street is lined with parked cars on both sides, creating a bustling urban atmosphere.\n\nIn addition to the vehicles, there are several pedestrians walking along the sidewalks, contributing to the overall liveliness of the scene. The street is also adorned with a few potted plants, adding a touch of greenery to the urban environment."}
{"image_id": 220050, "caption": "The image features a young girl standing on a tennis court, holding a tennis racket in her hand. She appears to be posing for a picture, showcasing her enthusiasm for the sport. The girl is wearing a white dress, which complements her tennis attire.\n\nThe tennis court is surrounded by a fence, and there are two benches visible in the background, one on the left side and another on the right side of the court."}
{"image_id": 535050, "caption": "The image features a room with a large suitcase and a cardboard box placed next to each other. The suitcase is positioned towards the right side of the room, while the cardboard box is on the left side. The suitcase appears to be silver, and the cardboard box is brown.\n\nIn addition to the suitcase and the cardboard box, there is a smaller suitcase located in the middle of the room. This smaller suitcase is positioned between the larger suitcase and the cardboard box, creating a sense of depth in the scene."}
{"image_id": 438364, "caption": "The image features a red double-decker bus driving down a street. The bus is quite large and occupies a significant portion of the scene. There are several passengers visible on the bus, with some sitting on the upper deck and others on the lower deck.\n\nIn addition to the bus, there are a few people scattered along the street, with some standing closer to the bus and others further away. A car can also be seen parked on the side of the street, adding to the urban atmosphere of the scene."}
{"image_id": 173819, "caption": "The image depicts a pink Hello Kitty bathroom featuring a toilet, sink, and bathtub. The toilet is positioned towards the left side of the bathroom, while the sink is located on the right side. Above the toilet, there is a towel rack with a Hello Kitty towel hanging on it.\n\nIn addition to the toiletries, there are several bottles placed around the bathroom. One bottle can be found on the left side of the toilet, another on the right side of the sink, and a third one on the right side of the bathtub. A cup is also visible on the right side of the sink."}
{"image_id": 196295, "caption": "The image depicts a herd of elephants walking down a dirt road in a wooded area. There are a total of seven elephants in the scene, with one large elephant leading the way and the others following closely behind. The elephants vary in size, indicating a mix of adults and younger members of the herd.\n\nThe elephants are spread out along the road, with some closer to the foreground and others further in the background. The dirt road appears to be a natural path that the elephants are using to travel through the lush green forest."}
{"image_id": 220050, "caption": "The image features a young girl standing on a tennis court, holding a tennis racket in her hand. She appears to be posing for a picture, showcasing her enthusiasm for the sport. The girl is wearing a white dress, which complements her tennis attire.\n\nThe tennis court is surrounded by a fence, and there are two benches visible in the background, one on the left side and another on the right side of the court."}
{"image_id": 535050, "caption": "The image features a room with a large suitcase and a cardboard box placed next to each other. The suitcase is positioned towards the right side of the room, while the cardboard box is on the left side. The suitcase appears to be silver, and the cardboard box is brown.\n\nIn addition to the suitcase and the cardboard box, there is a smaller suitcase located in the middle of the room. This smaller suitcase is positioned between the larger suitcase and the cardboard box, creating a sense of depth in the scene."}
{"image_id": 438364, "caption": "The image features a red double-decker bus driving down a street. The bus is quite large and occupies a significant portion of the scene. There are several passengers visible on the bus, with some sitting on the upper deck and others on the lower deck.\n\nIn addition to the bus, there are a few people scattered along the street, with some standing closer to the bus and others further away. A car can also be seen parked on the side of the street, adding to the urban atmosphere of the scene."}
